{"lastName": "Brazie", "objectUrn": "urn:li:member:31600519", "contactInfo": {"websites": [{"category": "COMPANY", "dataSource": "LINKEDIN", "url": "http://www.ice.gov"}, {"category": "PERSONAL", "dataSource": "LINKEDIN", "url": "https://www.facebook.com/media/albums/?id=16109382"}]}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2016}, "fieldsOfStudy": ["Oversight and Inspection (OIG)"], "school": "urn:li:fs_salesSchool:18934", "degree": "Master's in Public Administration", "schoolName": "John Jay College (CUNY)", "startedOn": {"year": 2014}, "eduId": 207946625}, {"endedOn": {"year": 2016}, "fieldsOfStudy": ["Krav Maga, Brazilian Jiu Jitsu, Grappling, Muy Thai, and Law Enforcement/Special Forces combat."], "schoolName": "Krav Maga Academy", "startedOn": {"year": 2011}, "eduId": 93191820}, {"endedOn": {"year": 2015}, "fieldsOfStudy": ["Government"], "school": "urn:li:fs_salesSchool:150004", "degree": "Contracting Officer's Representative", "schoolName": "Defense Acquisition University", "startedOn": {"year": 2015}, "eduId": 293972658}, {"endedOn": {"year": 2015}, "fieldsOfStudy": ["National Security"], "degree": "Certification", "schoolName": "Executive Office of the President - Office of National Drug Control Policy - NY/NJ HIDTA", "startedOn": {"year": 2011}, "eduId": 80128819}, {"endedOn": {"year": 2014}, "fieldsOfStudy": ["Inspection and Oversight"], "degree": "CPE credits", "schoolName": "Association of Inspectors General Conference (Newark - 2014)", "startedOn": {"year": 2014}, "eduId": 262786662}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Muy Thai and Brazilian Jiu Jitsu"], "schoolName": "BWARRIOR / EPIC HYBRID", "startedOn": {"year": 2011}, "eduId": 93191564}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Martial Arts Training"], "schoolName": "Reign Training Center", "startedOn": {"year": 2011}, "eduId": 93191469}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["National Security"], "degree": "Certification", "schoolName": "Executive Office of the President - Office of National Drug Control Policy - LAHIDTA/LACLEAR", "startedOn": {"year": 2010}, "eduId": 52551622}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Drug Interdiction, Interrogation, and National Security"], "degree": "Certification", "schoolName": "Multijurisdictional Counterdrug Taskforce", "startedOn": {"year": 2010}, "eduId": 56530101}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["National Security"], "school": "urn:li:fs_salesSchool:20361", "degree": "Certification", "schoolName": "St. Petersburg College", "eduId": 64040489}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["Brazilian Jiu Jitsu"], "schoolName": "Gracie-Barra", "startedOn": {"year": 2010}, "eduId": 93191444}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["Justice Data Interface Controller"], "degree": "Certification", "schoolName": "Los Angeles Sheriffs Office", "startedOn": {"year": 2010}, "eduId": 58921005}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["CaLINX"], "degree": "Certification", "schoolName": "Naval Criminal Investigative Service", "startedOn": {"year": 2010}, "eduId": 53835573}, {"endedOn": {"year": 2009}, "fieldsOfStudy": ["ERO Basic Law Enforcement Training Program"], "degree": "Certification", "schoolName": "Federal Law Enforcement Training Center", "startedOn": {"year": 2009}, "eduId": 48283634}, {"endedOn": {"year": 2009}, "fieldsOfStudy": ["United States - Security Clearance Investigations"], "degree": "Background Investigator Certification", "schoolName": "OPM/USIS", "startedOn": {"year": 2009}, "eduId": 48283695}, {"endedOn": {"year": 2008}, "fieldsOfStudy": ["Security Guard"], "degree": "New York State Security Guard License", "schoolName": "Securitas Security Services USA, Inc.", "startedOn": {"year": 2008}, "eduId": 262870208}, {"endedOn": {"year": 2007}, "fieldsOfStudy": ["Criminal Justice, Political Science, Arabic"], "school": "urn:li:fs_salesSchool:19026", "degree": "B.A.", "schoolName": "State University of New York at Albany", "startedOn": {"year": 2005}, "eduId": 27221024}, {"endedOn": {"year": 2006}, "fieldsOfStudy": ["Criminal Justice"], "degree": "Seasonal Police Certification", "schoolName": "Eastern Shore Criminal Justice Academy", "startedOn": {"year": 2006}, "eduId": 48283680}, {"endedOn": {"year": 2005}, "fieldsOfStudy": ["Criminal Justice / Political Science"], "degree": "AAS", "schoolName": "Broome Community College", "startedOn": {"year": 2003}, "eduId": 40665516}, {"schoolName": "Albany CrossFit", "startedOn": {"year": 2015}, "eduId": 343867187}, {"fieldsOfStudy": ["National Security - Immigration"], "degree": "Government / Law Enforcement Training", "schoolName": "DHS - ICE", "startedOn": {"year": 2010}, "eduId": 64040353}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAHiL4cBUs2ycy2vTXl2q3SYo4Z_Jjz8gSs,NAME_SEARCH,undefined)", "numOfConnections": 2090, "showTotalConnectionsPage": false, "headline": "Deportation Officer with U.S. Immigration and Customs Enforcement.", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "My goal is to pursue a supervisory position within a federal law enforcement agency and upon retirement, run for political office in Congress.", "pendingInvitation": false, "defaultPosition": {"posId": 675446896, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Assigned to the Albany Enforcement and Removal Operations office. Assignments include the investigation, apprehension, and removal of criminal aliens. \n\nCriminal Alien Program - My primary responsibilities are involved in the Criminal Alien Program making at large street arrests in addition to running extensive system checks and jail interviewing/inspections. Interoperability between officers and units are comprehensive. \n\nDocket Work (Counties of Montgomery, Otsego, and Rensselaer, New York): Responsible for immigration enforcement activity for the aforementioned counties. Charged with the responsibilities to liaison with Federal, State, and Local law enforcement agencies. Additionally, liaison other non-law enforcement organizations, non-governmental organizations, and stake holders involved in U.S. immigration system. \n\nFugitive Recovery (Fugitive Operations) - Office adjunct responsibilities includes: field operations in the apprehension of criminal aliens and fugitives. Operate with a team to develop/investigate leads to locate fugitives and make lawful entry into residences/dwellings and other locations involving a reasonable expectation of privacy. Roving and stationary surveillance is conducted via vehicle or afoot around target locations and buildings. \n\nCriminal Prosecution (Violent Criminal Alien Section) - Office adjunct responsibilities: to assist case officers in the prosecution of criminal aliens brought before the Federal Court (Northern District of New York) and the US Attorney's Office for federal violations such as: 8 USC 1326, and 8 USC 1253. \n\nCriminal Apprehension (Criminal Alien Response Team) - Office adjunct responsibilities: to respond to law enforcement inquiries and other governmental agencies in regards to criminal aliens at large or in custody of the governmental entity; to conduct street arrests and apprehension of target/suspect aliens; conduct surveillance of suspected targets.", "location": "Albany, New York Area", "title": "Deportation Officer", "startedOn": {"month": 5, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Jason Brazie", "positions": [{"posId": 675446896, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Assigned to the Albany Enforcement and Removal Operations office. Assignments include the investigation, apprehension, and removal of criminal aliens. \n\nCriminal Alien Program - My primary responsibilities are involved in the Criminal Alien Program making at large street arrests in addition to running extensive system checks and jail interviewing/inspections. Interoperability between officers and units are comprehensive. \n\nDocket Work (Counties of Montgomery, Otsego, and Rensselaer, New York): Responsible for immigration enforcement activity for the aforementioned counties. Charged with the responsibilities to liaison with Federal, State, and Local law enforcement agencies. Additionally, liaison other non-law enforcement organizations, non-governmental organizations, and stake holders involved in U.S. immigration system. \n\nFugitive Recovery (Fugitive Operations) - Office adjunct responsibilities includes: field operations in the apprehension of criminal aliens and fugitives. Operate with a team to develop/investigate leads to locate fugitives and make lawful entry into residences/dwellings and other locations involving a reasonable expectation of privacy. Roving and stationary surveillance is conducted via vehicle or afoot around target locations and buildings. \n\nCriminal Prosecution (Violent Criminal Alien Section) - Office adjunct responsibilities: to assist case officers in the prosecution of criminal aliens brought before the Federal Court (Northern District of New York) and the US Attorney's Office for federal violations such as: 8 USC 1326, and 8 USC 1253. \n\nCriminal Apprehension (Criminal Alien Response Team) - Office adjunct responsibilities: to respond to law enforcement inquiries and other governmental agencies in regards to criminal aliens at large or in custody of the governmental entity; to conduct street arrests and apprehension of target/suspect aliens; conduct surveillance of suspected targets.", "location": "Albany, New York Area", "title": "Deportation Officer", "startedOn": {"month": 5, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 234501216, "new": false, "current": true, "companyName": "BrazieEnterprises", "description": "I presently run my own photography business, with over 15 years of experience in the taking of film (SLR) and digital media (DSLR).\n\nPhotography includes family portraits, engagements, childhood photos, fashion, landscape, nature, and political events.\n\nSoftware Experience: Presently utilize Adobe CS6, more specifically Adobe Lightroom, and Adobe Photoshop.\n\nEquipment: Utilize Nikon D300 & D300S with Nikon SB910 Speedlite and accessories.\n\nPhotography taken for the inauguration of Phillip Goldfeder, NYS Assemblyman, that included: Senator Charles Schumer, Speaker Sheldon Silver, Comptroller Dinapoli, and various members of the Governor's & Mayor's office.\n\nPhotography taken for Sarar, a men's clothing company that was hosted in the Turkish Embassy in Washington D.C. Members included: Senators, Governors, Congressional members, the Ambassador of Turkey, Members of the White House Staff, and members of the United Nations.\n\nPhotography taken for ChanceTV, a popular online TV show hosted by Chance Spiessbach that makes guest appearances on local news channels such as PIX 11.\n\nPhotography taken for a political event for Angelica Ottomanelli-Katz who was co-sponsored with Costa Costanides that included: Speaker Quinn of New York City, Representatives of former Senator Hillary Clinton, and local congressional members.\n\nPhotography taken for Bold WorldWide, an emmy award winning - Forbes Top 100 Global Ad Agencies marketing firm that regularly conducts business with: Microsoft, Jack Rabbit, Gilette, Mercedes, Tropicana, and City of Long Beach Campaign.\n\nPhotography taken for BroCon 2011, hosted by: Guyrilla at the New York Athletic Club, included prominent social media members such as Ted Rubin, hosts of ESPN, Microsoft Executives, Donna Daily, Lou Wallach of Comedy Central, and Brian Cristiano of Bold WorldWide.", "location": "Manhattan, NY", "title": "Photographer", "startedOn": {"month": 10, "year": 1990}}, {"posId": 554184819, "new": false, "current": false, "endedOn": {"month": 4, "year": 2015}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I presently coordinate and conduct transportation operations for the ICE Air Operations Unit located at 201 Varick Street, NY, NY. Operations consist of flight and convoy coordination for the mass transfer and deportation of criminal aliens. Exam, execute, and verify validity of I-205 (Warrant of Deportation), I-294 (Warning to Alien Ordered Removed or Deported), and other legal documentation for the transfer/removal of criminal aliens. Confirm the physical inventory and financial instruments of detainees.\n\nAliens are interviewed from a variety of cultural and linguistic backgrounds, often times with the interview conducted in the language of origin of the subject. I am seasoned in the art of persuasion in order to obtain signatory/biometric endorsements for specific removal/travel documents with hostile subjects.\n\nResponsibilities include the physical verification and legal documentation of departure, issuance and documentation of currency and/or financial instruments of detainees, inventory of detainee property, address medical issues or complaints", "location": "New York, New York", "title": "Immigration Enforcement Agent / ICE Air Operations / Flight Coordinator / Team Leader", "startedOn": {"month": 5, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 554187283, "new": false, "current": false, "endedOn": {"month": 8, "year": 2014}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "For all media inquiries please contact ICE office of public affairs:  915-231-3489.\n\nI provided humanitarian relief during the Southwest Border crisis of 2014. I assisted with the implementation and execution of ICE Family Residential Standards with the Joint Family Removal Unit (JFRMU), in addition to the continuity of immigration operations and the establishment of an emergency facility. Responsibilities included interviewing of illegal alien populous, transportation, site security, assisted/provided basic medical care, and enforced residential standards.\n\nMy primary position was assigned to the command centerâ\u0080\u0099s communication post with the responsibility to liaison with outside immigration stakeholders, news/media outlets, headquarters/senior management personnel, and multi-agency personnel involved with the operations at the A.F.R.C.\n\nConducted interviews with aliens in order to obtain basic static and intelligence information of the human trafficking infrastructure conducted to transport illegal aliens to the United States. Elicited information from both juveniles and adults regarding circumstances on their travel to include criminal activity.", "location": "Artesia, New Mexico", "title": "Immigration Enforcement Agent / Artesia Family Residential Center", "startedOn": {"month": 6, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 510433299, "new": false, "current": false, "endedOn": {"month": 5, "year": 2014}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Managed dockets for Non-Detained Unit, liasioned with Consular issues and regularly visited Consulate Offices regarding Detained/Non-Detained issues, requested/received travel documents, addressed stay of deportations/removal, reviewed prosecutorial discretion issues, and issued/revoked bonds(issued I-166's and I-340's). Regulary conducted case management, updated case information, addressed call ups, and managed dockets for multiple case categories (2A, 2B, 8A, 8B, etc...). Reviewed Immigration Court, Board of Immigration Appeals, Office of Immigration Litigation, and 2nd Circuit Court case decisions applicable to my docket(s).\n\nChecked the validity and accuracy of I-862 (Notice to Appear), served them upon the individual and/or court. Identified, analyzed, validated, and served applicable documentation to enforcement and removal operations. Knowledgeable of the requirements and regulations for Releases of Recognizance and Orders of Supervision. Prepared case synopsis for cases that involved Stays of Removal Deferred Actions.\n\nPrepared travel document requests and redacted releasable information.  Prepared written responses to applications for stays, deferred action, and parole requests. Experienced in docket management. Conducted system checks with CIS, NCIC, CLAIMS, TECS, EJustice, EOIR, BIA, and Circuit Court (2nd / PACER). \n\nKnowledgeable of the Intensive Supervision Alien Program (ISAP). Prepared Consular presentations and liaison with Consulates to acquire travel documents. Issued/revoked bonds(executed I-166 and I-340). Verified immigration documentation (I-205 Warrant of Deportation, I-294 Warning to Alien Ordered Removed or Deported, I-200 Warrant of Deportation, I-286 Notice of Custody Determination, I-217 Information for Travel Documentation or Passport, I-826 Notice of Rights and Request for Disposition, I-265 Notice to Appear/Bond/Custody Processing Sheet, and Notice of Intent/Decision to Reinstate Prior Order I-871).", "title": "Immigration Enforcement Agent / Non-Detained Management", "startedOn": {"month": 1, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 510428705, "new": false, "current": false, "endedOn": {"month": 1, "year": 2014}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I was assigned to the Transportation and Removal Operations(TRO) unit in the New York Field Office in June 2013 as a Team Leader. My position requires me to provide direct supervision and oversight of 15-30 employees along with 30-60 detainees in custody at our processing facility. I report directly to a Supervisory Immigration Enforcement Agent for guidance when needed, but I address all issues first hand in accordance to policy and discretion. I conducted this position during the tumultuous times during the fiscal crisis of 2013, to include a government shutdown.\n\nThe routine duties of the position include acting supervisory experience and the review and approval of legal documents. Daily responsibilities include the delegation of work and assignments, development and execution of a organizational structure, training agents both new and senior, and reviewing case work for completeness and legal sufficiency. I maintained accountability for all personnel and work assigned to Alien Processing Unit.\n\nI personally instructed and trained new officers post academy in the processing environment to provide reinforcement of seasoned and policy approved practices in the field. \n\nWhile under my supervision I updated officers on new policy and procedures. Additionally, I revamped the outdated infrastructure and practices to more productive measures. Materials utilized in the execution of daily tasks were outdated and I personally created this new structure through charts, manuals, and collected essential contact information for dissemination to the benefit of the TRO unit as a whole.\n\nWhen assigned team leader, my first task was in the organizational development for a streamlined process to acquire and organize equipment necessary for the execution of our duties. I inventoried defective/expired equipment and reviewed relevant policy and warranty information and executed the exchange to provide significant savings to the U.S. Government.", "location": "New York, New York", "title": "Immigration Enforcement Agent / Team Leader / Acting Supervisor", "startedOn": {"month": 5, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 510429823, "new": false, "current": false, "endedOn": {"month": 9, "year": 2013}, "companyName": "Fugazy Transportation", "description": "I was an official driver for the U.S. Open with Fugazy Transportation. The position required that I provide transportation for the Tennis Players, U.S. Open and International Tennis Officials, government dignitaries/officials, VIP/Executives, media, and celebrities. I interacted on a daily basis with the above mentioned individuals and ensured timely arrival for all of their transportation needs.", "location": "U.S. Open Tennis Center, Queens, NY", "title": "Professional Driver", "startedOn": {"month": 8, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:1405058"}, {"posId": 96502583, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Previously I was assigned to the Secure Communities(SECOM) unit at Varick Street Federal Building. I rendered immigration determinations based upon biometric data along with pre-existing case information provided by numerous immigration and law enforcement databases. Cases are analyzed in an expedient manner to determine the alienage and removability of a subject. I personally worked in Secure Communities during the development of the command center until the completion of one year from May 2012 to May 2013.\n\nI provided assistance in the implementation and foundation for the newly established command center in New York City. With prior experience, I guided Immigration Enforcement Agents (IEA), Deportation Officers (DO), and supervisory personnel in the SECOM process. Often I am an acting supervisor during shortages of supervisory personnel for the twenty four hour coverage required for the SECOM command center.\n\nWhen a supervisor, I delegated tasks and assignments. If an agent was unable to complete a task I identified the problem and trained them to fruition of their casework. I provide insight and advice to improve the overall efficiency of the SECOM unit through my immediate and secondary supervisors. When questions arose, I resolved conflicts and coordinated work with other units as necessary.\n\nAs protocols or procedures routinely change, I disseminated updated information immediately to my coworkers and associated departments such as Fugitive Operations, Criminal Alien Program, and the Violent Criminal Alien Section. If a conflict arose, I resolved the issues by a balance of policy and the necessary exercise of discretion.\n\nI continually seek personal improvement, constructive criticism, and ways to impact efficiency within our unit. Whenever a beneficial process or procedure has been discovered I ensure it is shared with the SECOM team, along with training opportunities to improve the unit as a whole.", "location": "Manhattan, NY", "title": "Immigration Enforcement Agent / Secure Communities / Acting Supervisor / Founding Member", "startedOn": {"month": 4, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 510430399, "new": false, "current": false, "endedOn": {"month": 4, "year": 2012}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I worked with the Transportation and Processing Unit upon transferring from the Los Angeles Field Office.  Additionally, I worked in the court security unit while immigration proceedings took place.", "location": "New York, New York", "title": "Immigration Enforcement Agent / Transportation / Court Security", "startedOn": {"month": 7, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 199024674, "new": false, "current": false, "endedOn": {"month": 6, "year": 2011}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As an Immigration Agent previously assigned to the Southern California Secure Communities Command Center (SC3), I was provided the opportunity to be a acting supervisor for the largest Secure Communities (SECOM) operation in the United States.\n\nWhen working as an acting supervisor, I was responsible for oversight of approximately 4-5 full time officers, 5 detailers, and 3 contractors. Additionally, I responded to complaints or issues from 3 separate states, 58 different county sheriff departments and 482 local municipalities from the State of California alone. I liaison with these localities regularly in order to develop and improve the continuity of our operations.\n\nI addressed a situation involving the Santa Barbara County Sheriff's department in a murder investigation involving several Lawful Permanent Residents and an illegal alien. The detective in charge of the situation contacted me for assistance in establishing communication with the immigration authorities at the point of entry of San Ysidro, California. Once communication was established, I assisted from the command center to develop a sting operation to apprehend the subjects of the detectives investigation.\n\nI coordinated between the Customs and Border Protection Officers, Border Patrol Agents, California Highway Patrol, and Santa Barbara County Sheriff's Department. As a result of my efforts and the successful operation, the driver was apprehended.\n\nSupervising, I evaluated the quality of the shifts work and corrections were provided through individual counsel. Solutions to complaints or areas of needed improvement were done regularly to my immediate supervisor. Through trial and error I implemented ways to increase the overall efficiency of SECOM.\n\nReviewed and revised the Standard Operating Procedures and Continuity of Operations plan for SECOM. Analyzed the SOP/CO-OP for sufficiency and provided recommendations in policy for implementation.", "location": "Laguna Niguel, CA", "title": "Immigration Enforcement Agent / Secure Communities / Acting Supervisor", "startedOn": {"month": 7, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 199025740, "new": false, "current": false, "endedOn": {"month": 7, "year": 2010}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I was assigned to the Phoenix, Arizona field office during the ACTT rotation established by headquarters.  My duties in Arizona were broad as we rotated through multiple unit assignments dependent on the needs each night.  While assigned I worked in Transportation, Processing, CAP, LEAR, ADOT detail, Gang Unit, assisted with Fugitive Operations, cleared drop houses, secured human trafficking sites, and answered calls from localities through Secure Communities.\n\nThe detail provided me the opportunity to assist the chain of command by a position they coined as \"Lead IEA\", we conducted our responsibilities just like an SIEA and reported to the chain of command.  \n\nI was initially responsible for processing of all incoming detainees, reviewing case files, initiating NTA's, and bringing any medical issues to the chain of command.  As a lead IEA, I oversaw a shift of 8-12 people, 3-4 contractors, and processed on average 45-80 detainees a night.\n\nI regularly coordinated with the contractors in order to ensure a smooth transition of custody and removal to the border point of Nogales.\n\nI was responsible for the care of juvenile detainees who were in our custody.  It was a daily routine to document all the activities of the juveniles to include: scheduled meals, medical/hygiene care, liaison with juvenile facilities, cross country transportation and general supervision of officer interaction with the juveniles.  \n\nI experienced the execution of a continuity of operations plan.  Arizona's SB1070 was passed and the office experienced a massive protest with ten's of thousands of protesters.  Assisting the supervisors, we evacuated the facility and temporarily continued at the Mesa, Arizona ICE flight operations base.  The facility provided a broad variety of logistical challenges in addition to normal processing problems.  Even in this operation I was able to maintain a sense of order and accomplished the routine and exceptional tasks asked of us as a shift.", "title": "Immigration Enforcement Agent / Team Leader / CAP / LEAR / JPATS / FUGOPS", "startedOn": {"month": 5, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 199031022, "new": false, "current": false, "endedOn": {"month": 5, "year": 2010}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I worked in the Transportation and the Criminal Alien Program (CAP) unit for my time in the downtown Los Angeles Field Office.  The transportation operations included members of multiple field offices and contracting agencies.\n\nI received 2 weeks of intensive CDL driver instruction from our own ICE transportation instructor for the operation of detention vehicles.  I successfully completed the requirements of the course without incident and received a CDL Class B License.\n\nWhen assigned to the JPATS unit, I was responsible for the organization and execution of the removal of 20-40 detainees from the Los Angeles Field Office.  The responsibilities of my assignment involved the individual inspection and processing of detainee property, medical paperwork, and travel documentation.\n\nWhen assigned to the San Ysidro point of entry detail, I provided an escort for the GS4 contractors from the downtown Los Angeles Field Office.  As an escort I was the point of contact for the GS4 contractors with the command staff of Customs and Border Protection, Border Patrol, and San Diego County Sheriff's Department.  I oversaw 3-5 contractors transporting 20-80 detainees in an operation with multiple transports, and ensured that all proper documentation was prepared in advance.\n\nI worked an adjunct function of CAP when completed with my transport duties, I assisted Deportation and Supervisory Deportation Officers in the processing of the incoming time sensitive casework.  I conducted interviews, processed detention information, and extensive immigration checks to render alienage and removability.\n\nI initiated Notices to Appear, completed immigration and removal documents (I: 200, 205, 213, 215, 247, 265, 286, 294, 296, 826, 862, and 871), requested certified conviction documents, and reinstated orders of removal with guidance from SDDO's for legal sufficiency.", "location": "Los Angeles, California", "title": "Immigration Enforcement Agent / Transportation / Criminal Alien Program", "startedOn": {"month": 12, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 199024098, "new": false, "current": false, "endedOn": {"month": 12, "year": 2009}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I was assigned for training at the Federal Law Enforcement Training Center in Glynco, G.A.", "location": "Glynco, Georgia", "title": "Immigration Enforcement Agent", "startedOn": {"month": 8, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 96502547, "new": false, "current": false, "endedOn": {"month": 7, "year": 2009}, "companyName": "USIS", "description": "I conducted Federal Background Investigations for the United States Office of Personnel Management as a Special Investigator.  The job required that I conduct investigations that are sensitive, controversial, often involving allegations, hearsay information, and vague or intangible information of an adverse nature that require clarification for security clearance determinations.\n\nI interacted with people from diverse backgrounds in the metropolitan area of Manhattan, New York, varying from basic military clearances to senior business executives requiring investigations to maintain fiduciary trust.  \n\nKnowledgeable of the OPM guidelines for security clearance investigations and requirements for maintaining active clearances or accesses.  Experienced in the adaptation of multiple government practices (Federal, State, and Local) that greatly influenced the articulation of facts, addressed cultural variations due to locality while maintaining federal reporting standards.    \n\nDatabases were utilized in the gathering of subject's information for completion of a National Security Clearance Investigation.  Records were obtained on subjects through various checks conducted at courthouses, review arrest records, credit bureaus, property records, financial records, licensing information, and other public documents.\n\nI applied principles of investigation as demonstrated during the performance of federal background investigations.  Identified false and misleading information, developed outside sources that verified or corroborated material falsification.  Probed to resolve questionable contradictory information or expanded the scope of the investigation due to the development of disqualifying issues.  The position required extensive report writing.", "location": "Manhattan, New York", "title": "Investigator", "startedOn": {"month": 10, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:166733"}, {"posId": 121647041, "new": false, "current": false, "endedOn": {"month": 8, "year": 2008}, "companyName": "Securitas Security Services USA, Inc.", "title": "Security Officer", "startedOn": {"month": 3, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:307494"}, {"posId": 96502663, "new": false, "current": false, "endedOn": {"month": 8, "year": 2007}, "companyName": "Ocean City Maryland Police Department", "description": "I maintained a fully certified law enforcement position in the State of Maryland, working as a seasonal police officer.  I conducted this position during my summers away from college.  My daily tasks involved vehicular and foot patrols, street level investigations, searches and seizures, issued summons, enacted arrests, controlled crowds, and accident report writing.\n\nSkills obtained through the position included: sworn police authority, criminal investigative experience, firearms/defensive tactics, criminal intelligence gathering, evidence preservation and collection, EVOC, CPR/First Aid, legal training (Criminal, Constitutional, and Civil), extensive report writing, and testifying in district and circuit courts.\n\nI trained new seasonal officers providing field guidance and advice regarding criminal activity and legal sufficiency for enacting arrests, issuing subpoenas, or warrants.  As part of the field officer training, I inspected and reviewed newly hired officer's arrest paperwork and citations for legal sufficiency in establishing probable cause.  \n\nWhen answering calls for service I guided the new hires in proven strategies utilized to gain access and consent from suspects of criminal activity.  Instruction of general practices and departmental policy was conducted daily with the new hires along with uniform and equipment inspection.\n\nWhen calls for service were low I would take one or two officer's out on patrol to conduct surveillance of local areas known for criminal activity or based on information gathered from informants.  \n\nI discovered human sex trafficking while on duty through the use of informants and the internet.\nI maintained a 100% conviction rate for all my law enforcement activities.  Casework included the take down of an armed gunman, domestic violence calls, extortion, prostitution, and violent assaults.", "location": "Ocean City, Maryland", "title": "Seasonal Police Officer", "startedOn": {"month": 5, "year": 2006}}, {"posId": 118837527, "new": false, "current": false, "endedOn": {"month": 4, "year": 2007}, "companyName": "New York State Senate", "description": "My position in the legislative process that included: legal research, development, and advisement in legislation.  I worked one on one with The New York State Senator Michael Nozzolio in liaison with foreign, federal, state, and local government officials.  \n\nI wrote official calendared government reports on behalf of the Crime Victims, Crime and Correction Committee of New York State and the Senator's Office.    \n\nI provided official representation of the Senator in state hearings, committee meetings, the senate floor, and composed policy analysis reports.  I met and spoke with special interest groups, compiled their concerns and drafted briefings from the minutes of various meetings to the Senator.  \n\nI was the official point of reference for communication to and from the Senator during session and events at the capitol.  I provided continuous updated communication for the Senator, Chief of Staff, and Operations.  \n\nI formulated legislative initiatives, devised policy, and crafted bills on behalf of the Senator.", "title": "Legislative Assistant", "startedOn": {"month": 1, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:745785"}, {"posId": 129480275, "current": false, "endedOn": {"year": 2005}, "companyName": "Broome Community College", "description": "http://www.sunybroome.edu/", "title": "Student Government", "startedOn": {"year": 2004}, "companyUrn": "urn:li:fs_salesCompany:57898"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Jason", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/jason-brazie-4076bba", "location": "Albany, New York Area"}