{"lastName": "Davis", "objectUrn": "urn:li:member:554087752", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Human Resources", "educations": [{"endedOn": {"year": 2011}, "fieldsOfStudy": ["General Studies"], "school": "urn:li:fs_salesSchool:21261", "degree": "Associate's degree", "schoolName": "Central Texas College", "startedOn": {"year": 2009}, "eduId": 390522853}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAACEGtUgBsVstcelbp8seTnlBBK776SmAVLo,NAME_SEARCH,undefined)", "numOfConnections": 20, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHkTiCe8aj0IA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=sQd5k576isJVOvh1mjD-p13pkRCOzebqQCIO4u3r_CI", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHkTiCe8aj0IA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=W1yfNrSf8zKe_cd2dzwAIwFs9jT01PGH1g4eTiVuCY4", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHkTiCe8aj0IA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=aVhW7urdVYKnYtMyaWblGbPdnSIDQdnqiOLhf0AXsik", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHkTiCe8aj0IA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=5KY8CRx4_55MqOgv4ng2H7Cce2oAzwQ8bG4vqUcakoE", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Human Resources at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Experienced Human Resources Manager, Specialist, and Assistant.  I have received numerous awards for my achievements and also have had favorable appraisals that state I have exceeded expectations.  I also have a military and law enforcement background.", "pendingInvitation": false, "defaultPosition": {"posId": 904946918, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Human Resources Specialist Experience\n\nI have successfully trained in different areas of expertise as a Human Resources Specialist such as coding using the Guidance to Processing Personnel Actions (GPPA), pay setting, and qualifications. Not only have I trained in these areas, but I have also worked on actual cases through the process. I have successfully processed both reassignments and student volunteers after being notified of the selection. I worked the whole selections without oversight except a review from my immediate supervisor, whom reviewed the action and approved. I am able to interpret applicable classification standards and guides to determine the proper pay plan, title, series, and grade for new positions. I am a subject matter expert with the Pathway Student and Presidential Management program. I have the knowledge and expertise to be able to process and maintain the interns utilizing both internal and external policies.\n\nAccomplishments: Delegated Examining (DE) Initial Certification Course, Processing Personnel Actions (Coding) Course, Basic Staffing Course", "title": "Human Resources", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Jeremy Davis", "positions": [{"posId": 904946918, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Human Resources Specialist Experience\n\nI have successfully trained in different areas of expertise as a Human Resources Specialist such as coding using the Guidance to Processing Personnel Actions (GPPA), pay setting, and qualifications. Not only have I trained in these areas, but I have also worked on actual cases through the process. I have successfully processed both reassignments and student volunteers after being notified of the selection. I worked the whole selections without oversight except a review from my immediate supervisor, whom reviewed the action and approved. I am able to interpret applicable classification standards and guides to determine the proper pay plan, title, series, and grade for new positions. I am a subject matter expert with the Pathway Student and Presidential Management program. I have the knowledge and expertise to be able to process and maintain the interns utilizing both internal and external policies.\n\nAccomplishments: Delegated Examining (DE) Initial Certification Course, Processing Personnel Actions (Coding) Course, Basic Staffing Course", "title": "Human Resources", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 904955168, "new": false, "current": false, "endedOn": {"month": 11, "year": 2014}, "companyName": "U.S. Federal Bureau Of Prisons", "description": "Supervised up to 350 prisoners daily activities, requiring skills such as difficult decision making and leadership. Resolved altercations between prisoners and verbally counseled them on behavioral infractions. Performed routine suicide and mental checks on prisoners. Enforced rules and directed Inmates activities throughout the institution without causing a disruption\nMaintained security and standards in accordance with federal standards. Recognized any abnormal behavior between prisoners in order to defuse any serious situations. Monitored housing assignments regularly to determine prisoner well-being. Supervised and coordinated prisoner visitation by matching ID's with approved visitors and scanned random visitors for drugs using the ION scanner. Corresponded with the public for inquires of release of personal information requiring knowledge of which type of information could be released. Wrote clear and detailed incident reports in order to enforce standards in the prison setting. Prisoner headcount's were conducted regularly in order to ensure a 100% accountability and prevent escape. Escorted prisoners to and from housing assignments. Supervised the accountability of weapons and keys with no incident. Supervised inmates with different religious and cultural beliefs. Performed work related to developing and maintaining relationships in various levels of government, private industry, and federal, state, and local agencies/organizations to communicate and disseminate information about agency law enforcement, regulatory compliance, and enforcement mission areas and activities. Intervened with both armed and unarmed individuals using the least amount of force possible to receive compliance. Planned and conducted investigations relating to alleged or suspected violations of prison facility rules.\n\nAccomplishments: Completed the Correctional Officer Basic Course at the Federal Law Enforcement Training Center Glynco, Georgia. Received a time off award for performance", "location": "Dallas/Fort Worth Area", "title": "Correctional Officer", "startedOn": {"month": 11, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:6900015"}, {"posId": 904956753, "new": false, "current": false, "endedOn": {"month": 12, "year": 2013}, "companyName": "United States Department of Defense", "description": "Processed Human Resource transactions related to recruitment, placement, employee leave and health benefits, life insurance, and entitlements. Conducted initial processing of new employees. Supervised the finances for the employee retirement and special events fund using both spreadsheets and forms that were both input manually and using automated systems. I verified the correctness of fuel control procedures by reviewing receipts and transactions when employees used government travel cards on a constant basis. I regularly used external/internal recruitment aids in order to assist the Specialist in recruitment planning. Advised senior staff of vacant positions. Prepared requests for job vacancy by initiating the SF-50 requests for announcements to distribute to the sections and sent them to the final approval authority. I have the knowledge capacity to be able to give basic information on regulatory requirements governing the competitive hiring and merit promotion process. Provided status updates to senior staff for additional duty vacancies and filled those positions in accordance to their preference. Performed administrative support in areas of incentive awards, classification, and performance ratings. Reviewed paperwork for clerical errors and checked accuracy before forwarding to the approval authority. Managed payroll for over 60 employees using the federal payroll system. Managed over 60 permanent records. Corresponded with federal health care companies regularly to keep updated information on changes and schedule appointments for seminars.  Maintained daily statistics of authorized and actual strength data from first-line Supervisors and sent to the senior manager. Maintained a variety of Human Resources employee files and publications and cross-referenced them when required. Received leave requests and submitted them to the main Human Resources Office to correctly charge them for attendance.\n\nAccomplishments: Promoted from GS-5 to GS-6 in 6 months of service", "location": "Dallas/Fort Worth Area", "title": "Human Resources Assistant", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:7510"}, {"posId": 904960177, "new": false, "current": false, "endedOn": {"month": 4, "year": 2013}, "companyName": "Wise County Sheriff Posse", "description": "Trained new Detention Officers how to perform daily functions. Supervised up to 80 prisoners daily activities, requiring skills such as difficult decision making and leadership. Worked in an environment with prisoners, which required a variety of problem solving skills and discipline. Enforcing rules and directing inmate activities throughout the institution without causing a disruption was my number one priority. I maintained security and standards in accordance with Texas TCLOSE regulations and passed all jail inspections conducted by the state. I also participated in a variety of tasks involving the process of prisoners for detention in or release from the municipal jail, recorded fingerprints, photographed prisoners in mug shot, and reviewed all appropriate paperwork. I had to recognize any abnormal behavior between inmates in order to defuse any serious situation and take appropriate action. I continually collected and securely stored all property of the inmates and bagged anything that could be used as possible evidence. I assisted in searching prisoners as necessary to find items of contraband and prevent them from being introduced into the jail. I had to write clear and detailed incident reports in order to enforce standards in the jail setting that could later be used in a court room. Performed work related to developing and maintaining relationships in various levels of local agencies or organizations to communicate and disseminate information about agency law enforcement, regulatory compliance, and enforcement mission areas and activities. Intervened with both armed and unarmed individuals using the least amount of force possible to receive compliance. Planned and conducted investigations relating to alleged or suspected violations of jail facility rules. Prepared for or participated in disciplinary hearings.\n\nAccomplishments: Officer of the Quarter Fiscal Year 12 4th Quarter", "location": "Decatur, TX", "title": "Detention Officer", "startedOn": {"month": 8, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:8038580"}, {"posId": 904961324, "new": false, "current": false, "endedOn": {"month": 10, "year": 2011}, "companyName": "United States Army Human Resources Command", "description": "Supervised the in processing of 150 new employees daily. Taught various Human Resources Specialist classes to co-workers as refresher training using PowerPoint presentations. Managed a mail-room that serviced over 500 employees and was nominated as the best mail-room on Fort Sill. Met or exceeded all postal rules and regulations, receiving a commendable rating during a mail-room inspection. Managed over 21,000 employee permanent records. Trained approximately new 15 employees to perform daily functions. Developed a Microsoft Excel program to track statistics of Equal Opportunity Employment. Provided status updates to senior staff for additional duty vacancies and filled those positions in accordance to preference. Developed a Microsoft Excel program to track amount of days mail have been held onto in order to meet federal requirements. Independently placed and managed suspense deadlines for routine work to be completed. Sent eligible employee promotion notifications to the commander's for final approval authority. Reviewed correspondence from subordinates to ensure that the information provided was correct grammatically, met Standard Operating Procedure guidelines, and was within regulation. Evaluated recommendations of employees for promotion and employee of the quarter boards by senior staff members. Made necessary changes to the employees permanent online record by reviewing and uploading the data. \n\nAccomplishments: Received the Army Commendation Medal and multiple Certificate of Achievement's. Met or exceeded all postal rules and regulations, receiving a commendable rating during a mail-room inspection. Managed a mail-room that serviced over 500 employees and was nominated as the best mail-room on Fort Sill. Developed a Microsoft Excel program to track amount of days mail has been held onto in order to meet federal requirements that was still being used after I left. ", "location": "Lawton, Oklahoma Area", "title": "Human Resources Manager", "startedOn": {"month": 5, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:9059601"}, {"posId": 904960507, "new": false, "current": false, "endedOn": {"month": 2, "year": 2007}, "companyName": "Johnson County Sheriff", "description": "Trained new Detention Officers how to perform daily functions. Supervised up to 80 prisoners daily activities, requiring skills such as difficult decision making and leadership. Worked in an environment with prisoners, which required a variety of problem solving skills and discipline. Enforcing rules and directing inmate activities throughout the institution without causing a disruption was my number one priority. I maintained security and standards in accordance with Texas TCLOSE regulations and passed all jail inspections conducted by the state. I also participated in a variety of tasks involving the process of prisoners for detention in or release from the municipal jail, recorded fingerprints, photographed prisoners in mug shot, and reviewed all appropriate paperwork. I had to recognize any abnormal behavior between inmates in order to defuse any serious situation and take appropriate action. I continually collected and securely stored all property of the inmates and bagged anything that could be used as possible evidence. I assisted in searching prisoners as necessary to find items of contraband and prevent them from being introduced into the jail. I had to write clear and detailed incident reports in order to enforce standards in the jail setting that could later be used in a court room. Performed work related to developing and maintaining relationships in various levels of local agencies or organizations to communicate and disseminate information about agency law enforcement, regulatory compliance, and enforcement mission areas and activities. Intervened with both armed and unarmed individuals using the least amount of force possible to receive compliance. Planned and conducted investigations relating to alleged or suspected violations of jail facility rules. Prepared for or participated in disciplinary hearings.", "location": "Dallas/Fort Worth Area", "title": "Correctional Officer", "startedOn": {"month": 10, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:6239444"}, {"posId": 904960602, "new": false, "current": false, "endedOn": {"month": 10, "year": 2006}, "companyName": "Silver Star Security, Inc.", "description": "Patrolled commercial premises to prevent and detect signs of intrusion and ensure security of doors, windows, and gates. Monitored and authorized entrance and departure of employees, visitors, and other people to guard against theft and maintain security of premises. Wrote reports of daily activities and irregularities, such as equipment or property damage, theft, presence of unauthorized persons, or unusual occurrences. Called police and fire departments in cases of emergency, such as fire or presence of unauthorized persons. Circulated among visitors, patrons, and employees to preserve order and protect property. Answered telephone calls to take messages, answer questions, and provide information during non-business hours. Scanned and received all incoming or outbound vehicles and communicate their arrival. Warned people of rule infractions or violations and removed the violators from premises when necessary. Screened individuals and vehicles to prevent passage of prohibited articles into restricted areas. Inspected and adjusted security systems, equipment, and machinery to ensure operational use and to detect evidence of tampering. Communicate with other guards on a scheduled basis status of patrol area. Scanned and received incoming vehicles and communicated their arrival.", "location": "Dallas/Fort Worth Area", "title": "Security Officer", "startedOn": {"month": 8, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:15941655"}, {"posId": 904959817, "new": false, "current": false, "endedOn": {"month": 7, "year": 2006}, "companyName": "Ellis County Sheriff's Office", "description": "Supervised up to 80 prisoners daily activities, requiring skills such as difficult decision making and leadership. Worked in an environment with prisoners, which required a variety of problem solving skills and discipline. Enforcing rules and directing inmate activities throughout the institution without causing a disruption was my number one priority. I maintained security and standards in accordance with Texas TCLOSE regulations and passed all jail inspections conducted by the state. I also participated in a variety of tasks involving the process of prisoners for detention in or release from the municipal jail, recorded fingerprints, photographed prisoners in mug shot, and reviewed all appropriate paperwork. I had to recognize any abnormal behavior between inmates in order to defuse any serious situation and take appropriate action. I continually collected and securely stored all property of the inmates and bagged anything that could be used as possible evidence. I assisted in searching prisoners as necessary to find items of contraband and prevent them from being introduced into the jail. I had to write clear and detailed incident reports in order to enforce standards in the jail setting that could later be used in a court room. Performed work related to developing and maintaining relationships in various levels of local agencies or organizations to communicate and disseminate information about agency law enforcement, regulatory compliance, and enforcement mission areas and activities. Intervened with both armed and unarmed individuals using the least amount of force possible to receive compliance. Planned and conducted investigations relating to alleged or suspected violations of jail facility rules. Prepared for or participated in disciplinary hearings.\n\nAccomplishments: Received Basic Jailer's License by the State of Texas\n", "location": "Dallas/Fort Worth Area", "title": "Detention Officer", "startedOn": {"month": 1, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:2947911"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Jeremy", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/jeremy-davis-774690135", "location": "Dallas/Fort Worth Area"}