{"lastName": "Thompson", "objectUrn": "urn:li:member:541743741", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2017}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:19028", "degree": "Bachelorâ\u0080\u0099s Degree", "schoolName": "University at Buffalo", "eduId": 381033008}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAACBKWn0BJn9ZpdwvP3WaaQ761aM5omVxisA,NAME_SEARCH,undefined)", "numOfConnections": 26, "showTotalConnectionsPage": false, "headline": "GS1801/13 Supervisor: United States Immigration & Customs Enforcement (ICE)_detention standards/compliance (medical)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I am a United States Federal Law Enforcement professional with 20+ years of progressive responsibilities, promotions, and management assignments. Iâ\u0080\u0099ve had the opportunity to represent the United States in multiple foreign postings assigned to the respective United States Embassies, where I've worked worked closely with foreign law enforcement agencies.\n\nI am certified bi-lingual (Spanish) and hold advanced training certificates in interviewing, firearms and defensive tactics.", "pendingInvitation": false, "defaultPosition": {"posId": 882246312, "new": false, "current": true, "companyName": "United States Department of Homeland Security/ US Immigration and Customs Enforcement (ICE)", "description": "I serve as the ICE managing supervisor, overseeing docket management and contract compliance at our contracted medical detention facility in Columbia, SC (GEO Corp./CCRS.) \n\nThis revolving docket of medical cases is universally regarded as the most visible and demanding ICE detained docket in the Nation; I have the opportunity to manage and oversee the work of multiple Deportation Officers throughout the Country, giving me the unique experience of managing the workload in various ICE Field Offices.\n\nI work closely with multiple foreign consulates and regularly provide written responses to congressional inquiries.\n\nSeptember 2015 - January 2016: I served USDHS/ICE HQ by negotiating the existing detention/service contract with the Immigration Health Service Corps (IHSC) and our detention facility partner. I was responsible for on-site participation in the negotiations, and providing my Field Office Director with specific docket/facility knowledge and both real-time, and follow-up recommendations. \n\nThis contract has Department-wide implications as it defines the roles and responsibilities for the 26 ICE Field Offices in the Nation, as well as our partners at IHSC and the facility.\n\nJuly 2015 - September 2015: I had the opportunity to serve USDHS/ICE HQ in the Juvenile Family Residential Management Unit (JFRMU) at our contract facility in South Texas (CCA/ STFRC.)\n\nSTFRC is a 2400 bed residential facility, encompassing 35 acres in Dilley, Texas; the facility was designed as a state-of-the-art \"neighborhood/community style\" detention unit where families can be housed in a open environment as they progress through the immigration process. \n\nI worked closely with the primary contractor to ensure our at-risk detainees/residents were properly managed; specifically, I was tasked with inspecting the facility to ensure compliance with detention standards and audited compliance/contract data to provide weekly results to USDHS/ICE HQ.", "location": "Charlotte, North Carolina Area", "title": "Supervisory Detention and Deportation Officer/  medical docket: detention standards & compliance", "startedOn": {"month": 11, "year": 2014}}, "degree": 3, "fullName": "Kevin M Thompson", "positions": [{"posId": 882246312, "new": false, "current": true, "companyName": "United States Department of Homeland Security/ US Immigration and Customs Enforcement (ICE)", "description": "I serve as the ICE managing supervisor, overseeing docket management and contract compliance at our contracted medical detention facility in Columbia, SC (GEO Corp./CCRS.) \n\nThis revolving docket of medical cases is universally regarded as the most visible and demanding ICE detained docket in the Nation; I have the opportunity to manage and oversee the work of multiple Deportation Officers throughout the Country, giving me the unique experience of managing the workload in various ICE Field Offices.\n\nI work closely with multiple foreign consulates and regularly provide written responses to congressional inquiries.\n\nSeptember 2015 - January 2016: I served USDHS/ICE HQ by negotiating the existing detention/service contract with the Immigration Health Service Corps (IHSC) and our detention facility partner. I was responsible for on-site participation in the negotiations, and providing my Field Office Director with specific docket/facility knowledge and both real-time, and follow-up recommendations. \n\nThis contract has Department-wide implications as it defines the roles and responsibilities for the 26 ICE Field Offices in the Nation, as well as our partners at IHSC and the facility.\n\nJuly 2015 - September 2015: I had the opportunity to serve USDHS/ICE HQ in the Juvenile Family Residential Management Unit (JFRMU) at our contract facility in South Texas (CCA/ STFRC.)\n\nSTFRC is a 2400 bed residential facility, encompassing 35 acres in Dilley, Texas; the facility was designed as a state-of-the-art \"neighborhood/community style\" detention unit where families can be housed in a open environment as they progress through the immigration process. \n\nI worked closely with the primary contractor to ensure our at-risk detainees/residents were properly managed; specifically, I was tasked with inspecting the facility to ensure compliance with detention standards and audited compliance/contract data to provide weekly results to USDHS/ICE HQ.", "location": "Charlotte, North Carolina Area", "title": "Supervisory Detention and Deportation Officer/  medical docket: detention standards & compliance", "startedOn": {"month": 11, "year": 2014}}, {"posId": 903507824, "new": false, "current": false, "endedOn": {"month": 11, "year": 2014}, "companyName": "United States Department of Homeland Security/ US Immigration and Customs Enforcement (ICE)", "description": "From July 2012, through November 2014, I managed the ICE offices in Columbia, SC and Greer, SC; my offices consisted of two Criminal Alien Program (CAP) Teams, a Detention Management Unit (DMU) Team, two Violent Criminal Alien Section (VCAS) Teams and the 287g Team in Lexington County, SC.  \n\nI spoke at multiple law enforcement conferences, representing the Atlanta Field Office; I was the ICE POC for the SC Department of Probation and Parole.\n\n287g:\nI have extensive experience with the 287g program, having had the opportunity to supervise the programs at Charleston County, SC, and Lexington County, SC.  I have experience with negotiations concerning our Memorandums of Agreements and OPR/ORSA Inspections.   \n\nIâ\u0080\u0099ve represented our Field Office at two OPR inspections of the 287g program as well as two Operational Review Self-Assessment (ORSA) inspections.\n\nCRIMINAL ALIEN PROGRAM:\nMy Teams covered twenty-seven SC Counties, twelve SC State facilities and one Federal Correctional Institute.  I had signatory authority on over 100 charging documents/arrests per month.  \n\nI consistently assigned personnel and resources in a manner which most effectively provided an umbrella of coverage with the local law enforcement community; we were rewarded with a continued rise in arrests.\n\nI initiated, developed and maintained successful partnerships with the various law enforcement groups in my AOR. Through partnering with local law enforcement, I was able to organize successful Operations which have included CAP Surges and fugitive apprehensions.\n\nVIOLENT CRIMINAL ALIEN SECTION:\nMy Teams covered two Federal District courts and twenty-seven Counties across South Carolina. I assigned Deportation Officers to present all pertinent cases for prosecution through the USAO.\n\nFUGITIVE OPERATIONS:\nI prepared operation plans and our Teams have arrested multiple ICE Fugitives.", "location": "Columbia, South Carolina Area", "title": "Supervisory Detention and Deportation Officer", "startedOn": {"month": 7, "year": 2012}}, {"posId": 883555502, "new": false, "current": false, "endedOn": {"month": 7, "year": 2012}, "companyName": "United States Department of Homeland Security/ US Immigration and Customs Enforcement (ICE)", "description": "As a Deportation Officer, I was responsible for managing the Criminal Alien Program (CAP) in 6 SC Counties; specifically, I worked with local law enforcement following the arrests of foreign-born individuals.  I interviewed those foreign-born arrestees and processed those applicable for deportation.\n\nPrior to an ICE/ERO Office in Columbia, my assigned Counties' experience with ICE was very limited. I initiated, established and maintained liaisons with various law enforcement groups, and I worked with those local police departments by providing training and resources to better help combat the problems those local communities were encountering with criminal illegal immigration.\n\nI developed a precise Standard Operating Procedure (SOP) to ensure a successful partnership with the local law enforcement community and an umbrella of coverage.\n\nI participated in multiple Fugitive Operations, including several ICE/ERO mandated National Operations; I took an active role in the preparation of our local Operation Plans and I had the opportunity to lead multiple one-day local Operations.\n\nI have extensive experience with the 287g program, having had the opportunity to supervise the program at Charleston County, SC on a short-term detail (90 days) and the program at Lexington County, SC. \n\nI have experience with negotiations concerning our Memorandums of Agreements and Office Professional Responsibility /detention standards Inspections.\n\n\n", "location": "Charlotte, North Carolina Area", "title": "Deportation Officer", "startedOn": {"month": 7, "year": 2009}}, {"posId": 883555215, "new": false, "current": false, "endedOn": {"month": 7, "year": 2012}, "companyName": "United States Department of Homeland Security/US Customs and Border Protection (CBP)", "description": "In addition to United States Customs and Border Protection (USCBP) Primary and Secondary inspections, I was also assigned to our Port's Passenger Analysis Unit (PAU) and the Counter-Terrorism Response Team (CTR).\n\nAs an Officer on the Passenger Analysis Unit, I was expected to review inbound flights and identify passengers who may pose a threat to the security of the United States and/or are carrying substances or goods that violate US law.\n\nAs an Officer on the Counter-Terrorism Response Team, I was primarily responsible for interviewing passengers that have suspect travel though regions of the world that have been associated with terrorism, and/or been identified as potentially having information regarding terrorist groups.\n\n", "location": "Charlotte, North Carolina Area", "title": "United States Customs and Border Protection Enforcement Officer", "startedOn": {"month": 1, "year": 2003}}, {"posId": 903297588, "new": false, "current": false, "endedOn": {"month": 10, "year": 2008}, "companyName": "United States Department of Homeland Security/US Customs and Border Protection (CBP)", "description": "In July 2008, I was selected to represent USCBP HQ as an Officer in the Immigration Advisory Program (IAP).\n\nThe Immigration Advisory Program places USCBP Officers in foreign countries to provide assistance and training to airline carriers, security companies and police departments.   The goal of the program is to prevent individuals suspected of having terrorist ties from boarding aircraft destined to the United States.\n\nOur program in London was fully supported by USCBP HQ, the US Embassy in London, England and the London Metropolitan Police, including London Metropolitan Police \"Special Branch\".\n\nMy primary duty was to interview \"targeted\" passengers identified by the National Targeting Center (NTC) in Reston, Virginia.  Following my interview, I relayed biographic and document identifiers back to the to NTC to determine if the passenger was a positive match to known terrorist individuals.  \n\nI made recommendations to the various airlines, security companies and London Metropolitan Police based on the information provided by the NTC following my interview.\n\nI held and maintained a United States Diplomatic passport.", "location": "United States Embassy/ London, United Kingdom", "title": "United States Customs and Border Protection Enforcement Officer", "startedOn": {"month": 7, "year": 2008}}, {"posId": 903508329, "new": false, "current": false, "endedOn": {"month": 10, "year": 2006}, "companyName": "United States Department of Homeland Security/US Customs and Border Protection (CBP)", "description": "While assigned to USCBP HQ, I had the opportunity to serve on a multi-disciplined task force assigned to provide intelligence on commercial aircraft scheduled to arrive in the United States from high-risk foreign airports.\n\nThe primary responsibility of the task force was to identify known terrorists, or individuals with terrorist ties prior to their boarding of the commercial aircraft. \n\nI was primarily responsible for using available United States Customs and Border Protection (USCBP) data-systems to provide intelligence on passengers who were scheduled to arrive in the United States.  I provided intelligence on their travel and any other pertinent information to assure the security of that aircraft.\n\nI am extremely comfortable in each analysis system available to USCBP and was personally recognized by senior management for \"outstanding\" contributions to USCBP HQ.", "location": "USCBP HQ/ Washington D.C. Metro Area", "title": "United States Customs and Border Protection Enforcement Officer", "startedOn": {"month": 7, "year": 2006}}, {"posId": 903500013, "new": false, "current": false, "endedOn": {"month": 1, "year": 2003}, "companyName": "United States Department of Homeland Security/US Customs and Border Protection (CBP)", "description": "In addition to United States Immigration and Naturalization Service (USINS) Primary and Secondary inspections, I volunteered to serve the Buffalo District office as the Port Intelligence Officer in Ottawa.\n\nAs Port Intelligence Officer, I was primarily responsible for establishing and maintaining liaisons with the various law enforcement agencies represented in Ottawa. \n\nI was also expected to work closely with officials at the US Embassy in Ottawa, and US Consulates across Canada identifying recent smuggling trends and analyzing intelligence data. \n\nThrough the liaisons I built and the intelligence I gathered, I was able to prepare monthly intelligence reports that were submitted to the Buffalo District office and used to keep our District up to date on the most recent trends and intelligence data generated from the field.\n\nI was personally recognized by the Buffalo District office for \"outstanding\" contributions to the District Intelligence Team. \n\nI represented the Buffalo District office at the 1998, 1999, 2000 and 2001 Canadian/American (CAN/AM) intelligence conferences.  Talks centered on Native American involvement in alien/narcotic smuggling; the return of motorcycle gangs as a dominant force in international smuggling; and cyber-smuggling.\n\nI represented the Buffalo District office in intelligence briefings hosted by Canada Customs and the Royal Canadian Mounted Police focusing on the 2001 Summit of the Americas, in Quebec City, Quebec.\n\nI held and maintained a United States Diplomatic passport.", "location": "United States Embassy/ Ottawa, Canada", "title": "United Sates Customs and Boarder Protection Officer", "startedOn": {"month": 7, "year": 1997}}, {"posId": 903502415, "new": false, "current": false, "endedOn": {"month": 7, "year": 1997}, "companyName": "United States Department of Justice/ United States Immigration and Naturalization Service (USINS)", "description": "In addition to United States Immigration and Naturalization Service (USINS) Primary and Secondary inspections, I also volunteered to serve the San Diego District office on the Port Enforcement Team (PET).\n\nAs an Inspector on the Port Enforcement Team, I was primarily responsible for processing persons who were being refused admission into the United States and being processed under I-860, Expedited Removal proceedings.\n\nI participated in numerous narcotic and fraudulent document seizures, and benefited from unparalleled â\u0080\u009cSouthern-Borderâ\u0080\u009d experience.\n\nI tested \"fully-fluent\" in the Spanish language and was rated \"outstanding\" in our annual performance review.", "location": "Calexico, California", "title": "United States Immigration Inspector", "startedOn": {"month": 6, "year": 1996}}], "pictureInfo": {}, "savedLead": false, "firstName": "Kevin M", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/kevin-m-thompson-139519131", "location": "Charlotte, North Carolina"}