{"lastName": "Gibbs", "objectUrn": "urn:li:member:373841301", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2019}, "fieldsOfStudy": ["Public Administration"], "school": "urn:li:fs_salesSchool:20072", "degree": "Master of Business Administration (MBA)", "schoolName": "Strayer University", "startedOn": {"year": 2015}, "eduId": 242044157}, {"endedOn": {"year": 2014}, "fieldsOfStudy": ["Criminal Justice/Law Enforcement and Public Safety"], "school": "urn:li:fs_salesSchool:18953", "degree": "Bachelor of Science (B.S.)", "schoolName": "Excelsior College", "startedOn": {"year": 2011}, "eduId": 242041596}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABZIXZUB9VjyfmBl_ej9_tdtT5TU9Xk9wz8,NAME_SEARCH,undefined)", "numOfConnections": 82, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHvrAvN_55wtg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=lWe8EK2Gkhd5E4KND9Nosn4UxknCV6q_acM81U3XUeA", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHvrAvN_55wtg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=7tnVGbdWne6eMpqtc8saWdf_48Jkr4TfkbfLQM4L6KU", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHvrAvN_55wtg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=Wkz05kVsYOpDv_i4uUo8Svet3b_q68Z4NwiJ-5Zittc", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHvrAvN_55wtg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=lZRJtmn6lWMiY7lriZSM6QA6IEEIW-WOyXtBRhnqdoc", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Motivated and very ambitious", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Over 15 yearâ\u0080\u0099s professional experience as a Law Enforcement Officer in conducting investigations and training law enforcement professionals.  To include 12 years  of coordinating simple and complex investigations,  case development utilizing investigative techniques and equipment and evidence preparation for admission according to court precedents.  Prepares investigative reports and interviews.  Vigilant in securing evidence according to legal and ethical rules of admissibility. Presents reports and summaries in accordance to standard operating procedures.", "pendingInvitation": false, "defaultPosition": {"posId": 758595902, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Deportation Officer", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Charles Gibbs", "positions": [{"posId": 758595902, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Deportation Officer", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 588578749, "new": false, "current": true, "companyName": "US Navy Reserve", "description": "Responsibilities consist of being part of a Law Enforcement and Security community providing a wide range of critical services to every part of the Navy. As a Master at Arms we're tasked with the following: Provide security and physical protection for service members, Train fellow Sailors in security and shore patrol duties, Serve as a security advisor, Assist in crowd control and riot prevention, Operate military prisons (brigs) on board ships,  Provide protective service to high ranking dignitaries and government officials, Conduct preliminary investigations into UCMJ violations.\n\n", "title": "Master at Arms", "startedOn": {"month": 5, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:1333"}, {"posId": 588577853, "new": false, "current": false, "endedOn": {"month": 12, "year": 2015}, "companyName": "US Navy", "description": "â\u0080¢Trained and qualified approximately 74 naval security force and 16 auxiliary security force personnel in achieving their sustainment qualifications, thereby enhancing the installations security posture to 97.09% \r\nâ\u0080¢Qualified over 80 personnel in small arms weapons qualifications which included the semiautomatic pistol, shotgun, and rifle, with little or no remedial training, increasing security department readiness to 96.3%\r\nâ\u0080¢Revamped over 74 training records for entries in the Data Housing and Reports Tool system and tracked approximately 60 personnel qualifications standard  for patrolman and watch commander qualifications with 100 percent accuracy\r\nâ\u0080¢Qualified 15 personnel in cardiopulmonary resuscitation first aid and automated external defibrillator\r\nâ\u0080¢Gained a high level of competency in the skills and knowledge required \r\nâ\u0080¢Needs minimal amount of supervision to fulfill responsibilities\r\nâ\u0080¢Displays a better than usual understanding of the interrelationship between his job and the job of others  \r\nâ\u0080¢Effectively uses the resources and tools available\r\nâ\u0080¢Produces more work than expected, and often completes work ahead of schedule\r\nâ\u0080¢Demonstrates a strong commitment to increasing productivity, and works at a faster pace than normally expected for the position\r\nâ\u0080¢Strives hard in the achievement of established goals\r\n", "location": "Naval Weapons Station Earle - Colts Neck NJ", "title": "Police Instructor", "startedOn": {"month": 11, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 588580229, "new": false, "current": false, "endedOn": {"month": 10, "year": 2012}, "companyName": "US Navy", "description": "Leadership\r\nâ\u0080¢Served as a first line supervisor for over 60 law enforcement personnel on daily tactical operation, executing yearly anti-terrorism procedures.  Consultant on methods as foot patrols, vehicle patrols, random vehicle inspection, roaming zones and fixed posts requiring prolonged standing\r\nâ\u0080¢Managed and operated a 35 personnel team during a high profile event that included over 2000 distinguished visitors\r\nâ\u0080¢Responsible for performing physical security, law enforcement and force protection at Department of Defenseâ\u0080\u0099s most efficient and affective ordnance supply system building facility with 12,000 acres, 110 miles of rail line, and over 26 million pounds of stored ordnance.\r\nLogistics\r\nâ\u0080¢Provided law enforcement, physical security, and anti-terrorism force protection for 31 tenant activities\r\nâ\u0080¢Supervised four patrol zones covering 150 critically manned spaces, resulting in a 25% decrease in crime\r\nâ\u0080¢Conducted an average of 50 commercial and personal vehicle inspections daily \r\nâ\u0080¢Maintained police presence and perimeters, ensuring safety and an incident free zone\r\nâ\u0080¢Provided law enforcement and logistic support to U.S. Naval Forces Central Command and Fifth Fleet with over 2,000 employees in support of Operation Enduring Freedom and Operation Iraqi Freedom\r\nâ\u0080¢Implemented standard operating procedures and pre-planned response procedures for police force personnel\r\nâ\u0080¢Arrested suspects, investigated crimes, and turn over suspects to appropriate authorities for detention\r\nâ\u0080¢Enforced the Uniformed Code of Military Justice, Navy regulations, local installation instructions, issuing traffic citations and federal violation notices in the Federal District of New Jersey and Pennsylvania\r\nâ\u0080¢Executed detailed law enforcement mission plans and operations providing expeditionary force protection of strategic US and Coalition assets at the primary sea port of debarkation/embarkation while working alongside the Hawaii Army National Guard Unit\r\n", "title": "Master at Arms", "startedOn": {"month": 10, "year": 1998}, "companyUrn": "urn:li:fs_salesCompany:1335"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Charles", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/charles-gibbs-419247a5", "location": "York, Pennsylvania Area"}