{"lastName": "Onello", "objectUrn": "urn:li:member:17734944", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2003}, "fieldsOfStudy": ["Computer Science"], "school": "urn:li:fs_salesSchool:20137", "degree": "B.S.", "schoolName": "Virginia Military Institute", "startedOn": {"year": 1999}, "eduId": 14169579}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAEOnSABVUYJX8y_9x6aiGiF6uxPjD6vCw0,NAME_SEARCH,undefined)", "numOfConnections": 1347, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHD1GxRNRFdxg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=_qb3nmQc8i08LMYkDv3ODkgg2ZOiIDpzlzjqhFiAbQA", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHD1GxRNRFdxg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=xtF-ihLaeIO4-htsHslr5wa3p9Ygx56-JVFKzdFHyCE", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHD1GxRNRFdxg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=NmYjbTSHmA65cEYgWu947ztTuKlyZ16U70RhVs4rr-o", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHD1GxRNRFdxg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=e4mV_9SAzKRi5NAJVmjmJwVxwnZ_F3voaq-3KYiXFv0", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Security Assessment and Penetration Testing Lead at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Results-oriented IT professional with information security, information assurance, incident response, security authorization, and physical security expertise.  In-depth knowledge of various NIST documentation with the proven ability to implement that knowledge in a fast-paced operational environment.  Exceptional project management and time management experience ensuring project deadlines are met and fall within budget standards.  Proven ability to build strong relationships with staff using negotiation talent, persuasion, and demonstrated commitment to significantly raise productivity levels.  Strong leader creating cohesiveness within teams and motivational skills to drive results in team performance above individual ability levels.  Self-motivated and an innovative thinker, consistently pursuing new challenges to stretch abilities, expand knowledge, and bring greater returns to the business.\n\nSpecialties: Risk Management, FISMA Compliance, Security Authorization (NIST and DIACAP), Security Assessment, Physical Security, Investigations, SharePoint, XML, and HTML\n\nSecurity Clearance - TS/SCI", "pendingInvitation": false, "defaultPosition": {"posId": 1154739136, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Security Assessment and Penetration Testing Lead", "startedOn": {"month": 11, "year": 2017}}, "degree": 3, "fullName": "Andrew Onello", "positions": [{"posId": 1154739136, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Security Assessment and Penetration Testing Lead", "startedOn": {"month": 11, "year": 2017}}, {"posId": 708283219, "new": false, "current": false, "endedOn": {"month": 11, "year": 2017}, "companyName": "US Citizenship and Immigration Services", "description": "Served as the Chief Information Security Officer and Division Chief for the Information Security Division within the Office of Information Technology, United States Citizenship and Immigration Services. Established the Agency standard for the Ongoing Authorization, Penetration Testing, automated Security Operations Center, application security, and continuous integration programs redefining the delivery of security services in the Federal Government. Managed the Information Security Division responsible for the successful delivery of security services across the USCIS environment. Oversaw, directed, and measured the success of assignments that involved Enterprise security activities assuring the confidentiality, integrity, availability, and ultimately protection of information and USCIS users, systems, applications, infrastructure, and data. Developed and implemented USCIS IT security strategies, plans, and future vision assuring the protection of USCIS information. Defined the scope and level of detail for security plans and policies applicable to the USCIS security program. Consulted and advised on risk and vulnerabilities of USCIS IT programs, systems, and services. Reviewed proposals for new USCIS systems, networks, and software designs for potential security risks making security recommendations to mitigate associated risk. Directed security assignments while leading the IT Security program, made decisions on the direction of the program, and assigned the necessary project leadership to ensure a successful outcome. Promoted and created a team environment within the Division fostering mutual respect and accountability that improved productivity utilizing open communication among the staff to eliminate organizational grievances.\n", "title": "Chief Information Security Officer", "startedOn": {"month": 7, "year": 2015}}, {"posId": 358660838, "new": false, "current": false, "endedOn": {"month": 7, "year": 2015}, "companyName": "US Citizenship and Immigration Services", "description": "Served as the Deputy Chief Information Security Officer / Deputy Division Chief for the Information Security Division within the Office of Information Technology, United States Citizenship and Immigration Services. Managed the day-to-day operations of the Information Security Division responsible for the successful delivery of security services across the USCIS environment. Oversaw, directed, and measured the success of assignments that involved Enterprise security activities assuring the confidentiality, integrity, availability, and ultimately protection of information and USCIS users, systems, applications, infrastructure, and data. Developed and implemented USCIS IT security strategies, plans, and future vision assuring the protection of USCIS information. Defined the scope and level of detail for security plans and policies applicable to the USCIS security program. Consulted and advised on risk and vulnerabilities of USCIS IT programs, systems, and services. Reviewed proposals for new USCIS systems, networks, and software designs for potential security risks making security recommendations to mitigate associated risk. Directed security assignments while leading the IT Security program, made decisions on the direction of the program, and assigned the necessary project leadership to ensure a successful outcome. Promoted and created a team environment within the Division fostering mutual respect and accountability that improved productivity utilizing open communication among the staff to eliminate organizational grievances.\n", "title": "Deputy Chief Information Security Officer", "startedOn": {"month": 1, "year": 2013}}, {"posId": 100535179, "new": false, "current": false, "endedOn": {"month": 1, "year": 2013}, "companyName": "US Department of Homeland Security", "description": "Served as the Cybersecurity Section Chief for the Risk Management Division Information Security Branch with the Department of Homeland Security.  Responsible to manage a FISMA Compliance team, Security Authorization team, Security Assessment team, Security Training team, Information Assurance Team, Vulnerability Assessment Team, Continuous Monitoring Team, and Information System Security Officer Team for over 60 operational sensitive but unclassified and classified Information Technology systems and over 20,000 personnel.  The section consists of over 30 contract employees and 4 Federal employees.  Provide oversight and validation of all HQ security activities to ensure all reports back to the HQ CISO are both accurate and in alignment with the HQ CISO vision for the security program. Provide training for all DHS HQ significant security personnel such as Information System Security Officers, Information System Security Managers, Risk Executives, Authorizing Officials, and System Owners.  Designed an automated security awareness delivery method to allow all DHS HQ personnel to complete training on an annual basis that was adopted as an Enterprise solution to be used for over 200,000 employees.  Previously served as the Security Compliance Manager responsible to build and maintain a security compliance program for the HQ component of DHS.", "title": "Cybersecurity Section Chief", "startedOn": {"month": 12, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 98644295, "new": false, "current": false, "endedOn": {"month": 12, "year": 2009}, "companyName": "Creative Computing Solutions, Inc (CCSi)", "description": "Served as the HQ Compliance Officer for the Risk Management and Control Division Information Security Branch with the Department of Homeland Security.  Responsible to manage all aspects of FISMA Compliance for over 30 Information Technology systems.  Provide oversight of all Certification and Accreditation documents to ensure all documents meet DHS standards.  Provide oversight and training for all Information System Security Officers.  Monitor system accreditation expirations, annual testing, vulnerabilty testing, key control testing, and plan of action and milestone dates.  Provide notification and enforcement of DHS security policy violations for HQ personnel.", "title": "Senior Consultant", "startedOn": {"month": 8, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:332207"}, {"posId": 28044688, "new": false, "current": false, "endedOn": {"month": 8, "year": 2009}, "companyName": "Booz Allen Hamilton", "description": "Participated as an integral member of the Department of Homeland Security Headquarters Certification and Accreditation Team.  Responsible to manage all aspects of the Certification and Accreditation package including the timely completion of all necessary documents and proper recording in the electronic tracking system.  Assigned multiple projects at one time with the ultimate goal to ensure all systems comply with established federal standards and receive accreditation in a timely manner.", "title": "Senior Consultant", "startedOn": {"month": 12, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:1403"}, {"posId": 26341088, "new": false, "current": false, "endedOn": {"month": 12, "year": 2007}, "companyName": "AOL", "description": "Ensured the integrity of the AOL network, employees, and consumers on a daily basis through the use of established security practices and procedures as part of the Information Technology Security division of AOL.", "title": "Associate Technical Security Analyst", "startedOn": {"month": 3, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:1258"}, {"posId": 26342940, "new": false, "current": false, "endedOn": {"month": 3, "year": 2006}, "companyName": "Watt, Tieder, Hoffar & Fitzgerald", "description": "During my transition from the Police Department to AOL, I spent a month gaining valuable work experience providing expert technical assistance to firm paralegals and attorneys for resolution of construction claims on a wide variety of civil, commercial, and industrial projects.", "title": "Project Assistant", "startedOn": {"month": 2, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:96438"}, {"posId": 26342440, "new": false, "current": false, "endedOn": {"month": 1, "year": 2006}, "companyName": "Fairfax County Police Department", "description": "Responsible to protect persons and property by providing essential law enforcement and public safety services, while promoting community involvement, stability, and order through service, assistance, and visibility.", "title": "Law Enforcement Officer", "startedOn": {"month": 8, "year": 2003}}], "pictureInfo": {}, "savedLead": false, "firstName": "Andrew", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/andrewonello", "location": "Columbia, South Carolina Area"}