{"lastName": "Matter", "objectUrn": "urn:li:member:522197740", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2018}, "fieldsOfStudy": ["Forensic Psychology"], "school": "urn:li:fs_salesSchool:17767", "degree": "Master of Arts - MA", "schoolName": "Argosy University", "startedOn": {"year": 2017}, "eduId": 434860256}, {"endedOn": {"year": 2015}, "fieldsOfStudy": ["Criminal Justice/Law Enforcement Administration"], "school": "urn:li:fs_salesSchool:19309", "degree": "Master of Arts (M.A.)", "schoolName": "Slippery Rock University of Pennsylvania", "startedOn": {"year": 2013}, "eduId": 363211489}, {"endedOn": {"year": 2013}, "fieldsOfStudy": ["Criminology"], "school": "urn:li:fs_salesSchool:19263", "degree": "Bachelorâ\u0080\u0099s Degree", "schoolName": "Indiana University of Pennsylvania", "startedOn": {"year": 2009}, "eduId": 363210911}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAB8gGuwBFs1wIYB9_MBZD006TD3-g4jMh5w,NAME_SEARCH,undefined)", "numOfConnections": 35, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFltt8s7MskTg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=-urNkvUjX_rJ-D83qzFCGjnbHYV-5VSpSL-Om4LRxt0", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFltt8s7MskTg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=JA_YmA2jvg0BiIe4q3UmkqQkEVzTw7BikRffpfHFSpE", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFltt8s7MskTg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=pZDvesDswN83cQUXvTkrHUnkIi1uk84AVO2AoVYELpA", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFltt8s7MskTg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=vA1qYuLqfi9-1kTfXMIrUNC2Upd3WzFBC3FMaVXgaQo", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Paralegal Specialist at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Dedicated federal officer with over 4 years of experience in security, screening, and supervisory skills.", "pendingInvitation": false, "defaultPosition": {"posId": 1035652371, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Process Freedom of Information Act (FOIA) and Privacy Act (PA) requests received by the organization from initial evaluations to final document release or denial. Process FOIA/PA actions to include: prepping affidavits, litigation reports, correspondence, notices, internal memoranda, or other documentation as necessary. Ensure that administrative procedures for receipt, control, processing, and responding to requests are adequate to comply with statutory time limits of FOIA/PA.\tSearching for and obtaining responsive files and expedited review by management and /or legal staff of proposed final actions. Coordinate with FOIA/PA officers in other organizations on FOIA/PA matters to include requests, appeals and litigation. Ensure that the FOIA/PA office has the necessary reference materials, equipment, and supplies to accomplish its mission. \tAssist in the preparation of approval packages to include Federal register notices, matching agreements between agencies, and justifications required for the Department of Homeland Security and the U.S. Immigration and Customs Enforcement.\tMonitor the status of cases, respond to inquiries, and provide customer service to both internal and external customers, the public, and management.", "location": "Washington D.C. Metro Area", "title": "Paralegal Specialist", "startedOn": {"month": 4, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Casie Matter", "positions": [{"posId": 1035652371, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Process Freedom of Information Act (FOIA) and Privacy Act (PA) requests received by the organization from initial evaluations to final document release or denial. Process FOIA/PA actions to include: prepping affidavits, litigation reports, correspondence, notices, internal memoranda, or other documentation as necessary. Ensure that administrative procedures for receipt, control, processing, and responding to requests are adequate to comply with statutory time limits of FOIA/PA.\tSearching for and obtaining responsive files and expedited review by management and /or legal staff of proposed final actions. Coordinate with FOIA/PA officers in other organizations on FOIA/PA matters to include requests, appeals and litigation. Ensure that the FOIA/PA office has the necessary reference materials, equipment, and supplies to accomplish its mission. \tAssist in the preparation of approval packages to include Federal register notices, matching agreements between agencies, and justifications required for the Department of Homeland Security and the U.S. Immigration and Customs Enforcement.\tMonitor the status of cases, respond to inquiries, and provide customer service to both internal and external customers, the public, and management.", "location": "Washington D.C. Metro Area", "title": "Paralegal Specialist", "startedOn": {"month": 4, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 847193201, "new": false, "current": true, "companyName": "Transportation Security Administration (TSA)", "description": "Complete Behavior Detection and Analysis (BDA) training at the Federal Law Enforcement Training Center (FLETC). Performed activities in support of the Behavioral Detection and Analysis Program, Transportation Security Administration, and the Ronald Reagan Airport. Conducts BDA Program duties at assigned airport(s) or other transportation terminals providing commercial service to the public. Engages in voluntary encounters and casual conversations with individuals to analyze and assess behaviors and refers individuals for additional screening when criteria is met. Develop baseline data which includes identifying flight destinations, understanding the anticipated composition of travelers associated with the flights, behaviors to be expected, and deviations from those behaviors. Assess multiple individuals simultaneously and use defined methods to detect unusual behavior. Exercise sound judgment while performing passive observation. Determine when behaviors have been resolved based on the completion of Behavior Detection Referral Screening. Verify appropriate checkpoint procedures are followed if prohibited items or hazardous materials are discovered during a referral. Document identified behaviors used as the basis for referrals. Prepare incident reports when law enforcement is involved. Ensure that superiors are aware of all ongoing activities. Participate in Playbook Plays and joint law enforcement assignments. Coordinate and collaborate with federal, state, and local law enforcement including K-9 units. Participate in National Special Security Events (NSSE). Respond to breaches of security and/or emergency situations; take appropriate steps to prevent entry to secure areas. Utilize computer hardware and software to create documents and report information in the appropriate format. Regularly utilize Behavioral Efficiency and Accountability Metrics (BEAM) Database to track daily tasks and performance. ", "title": "Behavior Detection Officer", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 847193615, "new": false, "current": true, "companyName": "U.S. Department of Homeland Security", "description": "Appointed as a National Information Officer. Main duties consisted of attending weekly briefings to gain knowledge on present information and \tthreats to the Reagan National Airport, Transportation Security Administration, Department of Homeland Security, and the U.S. Utilized information given during briefings to debrief Transportation Security Officers (TSO), Lead Transportation Security Officers, and Supervisor Transportation Security Officers.", "title": "Network Information Officer", "startedOn": {"month": 3, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 847197051, "new": false, "current": true, "companyName": "Transportation Security Administration (TSA)", "description": "Participated as a member on a small committee. Member duties included evaluating awards and recognition nominations for employees and \tsubmitting recommendations for awards to management for approval. ", "title": "Co-Chair, Joint Awards Committee (JAC)", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 847194148, "new": false, "current": false, "endedOn": {"month": 7, "year": 2016}, "companyName": "Transportation Security Administration (TSA)", "description": "Responsible for overseeing at a minimum of three and a maximum of thirty Transportation Security Officers (TSO) at a time, including officers in training. Served as a coach, mentor, and team leader.  Identified and dispersed tasks among officers based on skill-level and workflow. Balanced and made adjustments to workloads to meet previously set goals and agency priorities. Resolved informal officer complaints and directed formal grievances and appeals to the appropriate high authority, such as a supervisor or manager. Provided input to supervisors and managers concerning a variety of matters including, employee performance, promotions, reassignments, awards, etc. Provided administrative support preparing correspondence, schedules, and records, ordering supplies, inputting metrics and other information into various databases, as well as answering phone calls and E-mails while addressing passenger concerns. Trained team members, monitored and reported on the status and progress of work, and represented the team in communications with the supervisor or manager for the purpose of obtaining resources. Assisted management and Law Enforcement Officers (LEO) with inquiries for information or investigations. Participated in information briefings concerning sensitive security information. Developed incident information for superiors and LEOs, including writing various types of communications, reports, and documents. Collaborated with law enforcement, explosive detection canine teams, stakeholders, etc. on a daily basis.", "title": "Lead Transportation Security Officer", "startedOn": {"month": 3, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 847192915, "new": false, "current": false, "endedOn": {"month": 3, "year": 2016}, "companyName": "Transportation Security Administration (TSA)", "description": "Analyzed federal travel documents including passports, boarding passes,\n\tmilitary and airport identification and used various tools and technology\nto verify authenticity. Performed passenger bag searches and prepared items for x-ray scanning. Performed body searches on passengers to locate prohibited items and clear passengers for terminal access. Also performed searches on service animals and assistive equipment for passengers with disabilities. Conducted trace detection testing on passengers, items, and assistive mobility equipment. Completed equipment verifics, calibration and cleaning. Collaborated with airport police to check in individuals with higher clearances including armed law enforcement officials. Collaborated with explosive detection canine teams to perform security functions. Worked on a team to provide quality customer service while maintaining the safety and integrity of Ronald Reagan Washington National Airport.", "title": "Transportation Security Officer", "startedOn": {"month": 7, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:2994"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Casie", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/casie-matter-924a71126", "location": "Woodbridge, Virginia"}