{"lastName": "Nicorvo, CEM, PMP", "objectUrn": "urn:li:member:24489518", "contactInfo": {"socialHandles": [{"name": "RichNicorvoCEM", "type": "TWITTER", "dataSource": "LINKEDIN"}]}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2008}, "fieldsOfStudy": ["Crisis and Emergency Management"], "school": "urn:li:fs_salesSchool:18088", "degree": "Master of Business Administration", "schoolName": "Florida Atlantic University", "startedOn": {"year": 2006}, "eduId": 37282105}, {"endedOn": {"year": 2003}, "fieldsOfStudy": ["Communication"], "school": "urn:li:fs_salesSchool:18088", "degree": "Bachelor of Arts", "schoolName": "Florida Atlantic University", "startedOn": {"year": 1999}, "eduId": 37282106}, {"endedOn": {"year": 1993}, "fieldsOfStudy": ["Criminal Justice"], "school": "urn:li:fs_salesSchool:20168", "degree": "Associate of Science", "schoolName": "Broward College", "startedOn": {"year": 1988}, "eduId": 37282154}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAF1ri4BVdiPXrHW15VOM0OqcH4q2dXe8BM,NAME_SEARCH,undefined)", "numOfConnections": 260, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEEbvvVQhbM4Q/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=4UE7nbjp7C661ZFjtPwTtsOTVmk_wmf88-4V6uevIk8", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEEbvvVQhbM4Q/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=Uk_OLerwQxoEm9k3pPPtnZ0atNgj0kjvbaVG8Hed5yE", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEEbvvVQhbM4Q/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=pAlSy85lJRKopC6mUxFArboOCJn_SjlWH3s6DIRp7hA", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEEbvvVQhbM4Q/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=eYZHYTjWDP-_GjZw_wDoeCF6eNrb8LpcUupfGFJi-xQ", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Unit Chief at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Experienced Emergency Management Specialist with a demonstrated history of working in the law enforcement industry. Strong military and protective services professional skilled in Crisis Management, Crisis Communications, Emergency Management, Law Enforcement, and Administration.", "pendingInvitation": false, "defaultPosition": {"posId": 1050102121, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Collaborates with key Enforcement and Removal Operations (ERO) officials in formulating long-term project plans, establish goals and identify processes and resources necessary to achieve emergency management preparedness within ERO;\n\nDevelops and prepares policies that directly impact ICE's emergency management response;\n\nCoordinates ERO's emergency management issues with all stakeholders to include Federal, State, Tribal, and local governments, non-governmental organizations, and the private sector, and their response mechanisms and authorities;\n\nCommunicates and implements ERO's emergency management functions to include preparing a variety of reports, reviews, evaluations, and new studies to keep key ERO leadership informed of emergency management operations; and\n\nAssesses, inspects, and evaluates emergency management processes, plans, standard operating procedures, or guidance for compliance with established emergency management directives, regulations, policies, standards, and guidance and the impact these would have on ERO.", "location": "Washington D.C. Metro Area", "title": "Unit Chief, Incident and Special Response Unit", "startedOn": {"month": 8, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Rich Nicorvo, CEM, PMP", "positions": [{"posId": 1050102121, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Collaborates with key Enforcement and Removal Operations (ERO) officials in formulating long-term project plans, establish goals and identify processes and resources necessary to achieve emergency management preparedness within ERO;\n\nDevelops and prepares policies that directly impact ICE's emergency management response;\n\nCoordinates ERO's emergency management issues with all stakeholders to include Federal, State, Tribal, and local governments, non-governmental organizations, and the private sector, and their response mechanisms and authorities;\n\nCommunicates and implements ERO's emergency management functions to include preparing a variety of reports, reviews, evaluations, and new studies to keep key ERO leadership informed of emergency management operations; and\n\nAssesses, inspects, and evaluates emergency management processes, plans, standard operating procedures, or guidance for compliance with established emergency management directives, regulations, policies, standards, and guidance and the impact these would have on ERO.", "location": "Washington D.C. Metro Area", "title": "Unit Chief, Incident and Special Response Unit", "startedOn": {"month": 8, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 624891943, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Served as an Emergency Management Specialist for the Incident and Special Response Unit (ISRU) responsible for Enforcement and Removal Operations (ERO) wide emergency management coordination which includes planning, crisis management, continuity-of-operations, mission assurance, and resiliency activities\n\nEnsured implementation of the Occupant Emergency Plan, Continuity of Operations, and Continuity of Government and contingency planning including the use of the Continuity Evaluation Tool for ERO\n\nRecommended and implemented emergency management directives, regulations, policies, standards and guidance\n\nAssessed and evaluated emergency management processes, plans and standard operating procedures for compliance\n\nManaged components of emergency management programs and activities during a response, including Emergency Operation Center activation and operations.", "location": "Washington D.C. Metro Area", "title": "Emergency Management Specialist", "startedOn": {"month": 1, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 129457560, "new": false, "current": false, "endedOn": {"month": 1, "year": 2015}, "companyName": "Capgemini Government Solutions", "description": "Capgemini is a global consulting, information technology, outsourcing, and local services company headquartered in Paris, France, which employs over 130,000 people in more than 40 countries.\n\nTEAM LEADER FOR ALL EMERGENCY MANAGEMENT CONTRACT SUPPORT to a federal law enforcement agency in Washington, D.C.\n\nLED STRATEGIC PLANNING EFFORT resulting in the first-ever five-year strategic plan for the client.\n\nLEAD PLANNER (CONTRACTOR) FOR A NATIONAL-LEVEL PLAN. Collaborated and liaised with other Federal departments and agencies including the Office of the Secretary of Defense, Joint Chiefs, Department of Health and Human Services, Department of Justice, Customs and Border Protection, United States Coast Guard, Citizenship and Immigration Services, and Department of Homeland Security Headquarters. \n\nDEVELOPED PLAN OF ACTION AND MILESTONES and utilized the Federal Plan Development Process in updating and creating actionable plans. \n\nPREPARED BACKGROUND PAPERS AND PRESENTATIONS FOR SENIOR LEADERSHIP UP TO THE LEVEL OF EXECUTIVE ASSOCIATE DIRECTOR for representing emergency management and other programs to Congressional members and the National Security Staff.\n\nDEVELOPED INCIDENT COMMAND SYSTEM (ICS) CLASSROOM INSTRUCTION for personnel from the Action Officer level to the Executive Associate Director level.\n\nWORKED WITH TEAMS IN ALL HAZARD EXERCISES. Developed the information flow process utilized by an agency during National Level Exercise (NLE) 2011.\n\nCOORDINATED TEAM EFFORTS TO PRODUCE AND REVISE ALL HAZARD EMERGENCY MANAGEMENT AND CONTINUITY OF OPERATIONS (COOP) PLANS. Oversaw contract support for the creation of a COOP Plan and Comprehensive Emergency Management Plan.", "title": "Manager", "startedOn": {"month": 7, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:157240"}, {"posId": 87038098, "new": false, "current": false, "endedOn": {"month": 6, "year": 2010}, "companyName": "Broward College", "description": "RESPONSIBLE FOR THE MANAGEMENT OF A U.S. DEPARTMENT OF EDUCATION EMERGENCY MANAGEMENT FOR HIGHER EDUCATION (EMHE) GRANT in the amount of $985,000 consisting of EMHE grant funds and College matching funds. The program resulted in the successful implementation of a campus-wide emergency notification system, creation of threat assessment teams, completion of a Comprehensive Emergency Management Plan, and training of all essential personnel on Incident Command System. The success of the program also led to the establishment of a Director of Public Safety and Emergency Preparedness position to oversee future public safety programs.\n\nLED THE COLLEGEâ\u0080\u0099S CRISIS PLANNING EFFORT AND RESPONSE TO THE 2009 H1N1 PANDEMIC. As a result, was selected to serve on the Broward County Cities Readiness Initiative Committee, which planned for the mission of providing prophylaxis to 1.8 million residents and visitors of Broward County within 48 hours of a bio-terrorism event.\n\nPARTICIPATED IN THE CRITICAL INFRASTRUCTURE AND KEY RESOURCE ASSET PROTECTION TECHNICAL ASSISTANCE PROGRAM (CAPTAP). Utilized the Automated Critical Asset Management System (ACAMS) to assist the region in developing and implementing critical infrastructure protection programs. Updated hazard vulnerability assessment of campus buildings and structures along with corresponding mitigation plans. \n\nSERVED ON THE PLANNING TEAM FOR ALL HAZARD TABLETOP EXERCISES AND FUNCTIONAL EXERCISE. Served as an evaluator for a functional exercise at the Broward County Emergency Operations Center, a hurricane-based scenario tabletop exercise, and a terrorism-based scenario tabletop exercise. \n\nSERVED AS A TRUSTED ADVISOR ON EMERGENCY MANAGEMENT AND LAW ENFORCEMENT ISSUES to the Collegeâ\u0080\u0099s senior leadership, from campus provost level up to and including the College president.", "title": "Project Manager", "startedOn": {"month": 1, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:20864"}, {"posId": 87038085, "new": false, "current": false, "endedOn": {"month": 1, "year": 2009}, "companyName": "City of Coral Springs", "description": "Responsible for emergency management coordination for the City of Coral Springs during the absence of the city Emergency Management Coordinator.\n\nCOMMANDED THE CITY EMERGENCY MANAGEMENT FUNCTION IN THE ABSENCE OF THE EMERGENCY MANAGEMENT COORDINATOR. During Hurricane Katrina, led public safety operations during the response phase and assisted with the coordination of debris management during the recovery phase. Coordinated city emergency management operations during other severe weather incidents and special events.\n\nDEVELOPED ACTIONABLE ALL-HAZARD EMERGENCY MANAGEMENT PLANS AND CONTINUITY OF OPERATIONS PLANS. Worked with the Emergency Management Coordinator to ensure synchronization of police department plans with those of other city departments. \n\nCONTRIBUTED TO THE PLANNING AND IMPLEMENTATION OF TABLETOP AND FULL-SCALE EXERCISES. Worked with the Florida Southeast Regional Domestic Security Task Force to develop injects for various tabletop exercises and a full scale exercise.\n\nSERVED AS A TEAM LEADER ON THE FLORIDA STATE EMERGENCY RESPONSE TEAM. Responded to other jurisdictions, both in-state and out-of-state, to provide emergency management support and/or leadership. Deployments included Hurricane Charley (Punta Gorda, FL), Hurricane Dennis (Santa Rosa County, FL), Hurricane Katrina (Hancock County, MS), and the Groundhog Day Tornados in Lake County, Florida.", "title": "Deputy Emergency Management Coordinator", "startedOn": {"month": 1, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:62649"}, {"posId": 235773199, "new": false, "current": false, "endedOn": {"month": 1, "year": 2009}, "companyName": "City of Coral Springs Police Department", "description": "LEAD SPOKESPERSON FOR THE DEPARTMENT. Prepared and disseminated over 300 news releases, organized and conducted over 150 media interviews, and coordinated over 20 news conferences.\n \nDEVELOPED CRISIS COMMUNICATION STRATEGY for police administration and city senior staff members on numerous crisis incidents.", "location": "Coral Springs, Florida", "title": "Public Information Officer", "startedOn": {"month": 5, "year": 1997}, "companyUrn": "urn:li:fs_salesCompany:62649"}, {"posId": 87038084, "new": false, "current": false, "endedOn": {"month": 1, "year": 2009}, "companyName": "City of Coral Springs Police Department", "description": "Located on 25 square miles in the northwest quadrant of Broward County, Coral Springs maintains one of the lowest crime rates in Florida for cities with a population over 100,000. Over 200 Officers and 100 Civilian members of the Coral Springs Police Department support the law enforcement needs of over 130,000 residents. The Coral Springs Police Department is a full-service law enforcement agency, nationally accredited by the Commission on Accreditation for Law Enforcement Agencies and the Florida Commission for Law Enforcement Accreditation. Additionally, the City of Coral Springs is a two-time Governorâ\u0080\u0099s Sterling Award Winner and 2007 Malcolm Baldrige Award winner.\n\nCOMMANDER OF THE CRIMINAL INVESTIGATIONS COMPONENT overseeing General Investigations, Special Investigations, Crime Scene Investigations, and Dive Team.\n\nSUPERVISED LAW ENFORCEMENT AND NON-LAW ENFORCEMENT MEMBERS, INCLUDING FOUR FIRST LEVEL SUPERVISORS. Responsible for the direct development and evaluation of supervisory members. Conducted performance evaluations, presented award recognitions for exemplary work, and administered disciplinary actions when required. Interviewed candidates for employment and made hiring recommendations.\n\nGENERATED AND MAINTAINED A $5.3 MILLION OPERATING BUDGET. Led cross-functional process improvement team to reduce overtime expenditures by 26%.\n\nEMPLOYED QUARTERLY CUSTOMER SATISFACTION SURVEYS to measure component effectiveness (average rating 98% very good to excellent).", "title": "Police Captain", "startedOn": {"month": 3, "year": 1985}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Rich", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/richnicorvo", "location": "Washington D.C. Metro Area"}