{"lastName": "Shleien", "objectUrn": "urn:li:member:6319250", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Information Technology and Services", "educations": [{"endedOn": {"year": 1990}, "fieldsOfStudy": ["Management and Consumer Studies"], "school": "urn:li:fs_salesSchool:18570", "degree": "BS", "schoolName": "University of Maryland", "startedOn": {"year": 1985}, "eduId": 2704728}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAABgbJIBfq30oa3jGtjv8lf-WmKkE3tNKwc,NAME_SEARCH,undefined)", "numOfConnections": 456, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFvvXBXMSvpuw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=KmWlBzO43zlx9MQZxiB2XP5ofHwVVC-yqSqjCJadyQA", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFvvXBXMSvpuw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=vS0QmKRuQjTKUb3kJ0B4EtG3p0CIy_kZfWQbiAfTDHY", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFvvXBXMSvpuw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=IYVB6A5cGOZpX2js9roreLF0RaoTf0x5UisKYKhuaNk", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFvvXBXMSvpuw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=aXAYBPafB_DtHcD4QPkNWgOYMjWG0ffYI64Cemppk20", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "IT Specialist (INFOSEC) at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Mr. Shleien is a results driven leader who delivers complex technology products, systems, solutions and services with intuitive communication and leadership skills with a proven record of accomplishment within a matrixed team environment. Mr. Shleien collaborates directly with technical/solution product teams, product owners, architects, developers, and engineers, and manages team delivery, as well as stabilizing release-cycles. He provides cost-effective and efficient solutions utilizing advanced technology and business processes and led projects of varied levels of budget, scope, complexity, risk, and resources. Mr. Shleien is a Project Management Professional, Certified Scrum Master with over twenty yearsâ\u0080\u0099 experience in program, project, technical and knowledge management, strategic-planning, and technical and enterprise architecture design with extensive background combining systems integration and operations procedures with keen understanding of customer service and requirements. He effectively communicates across multi-layered management levels and business disciplines and is well versed in system-life-cycle methodologies, PMBoK, strategic technology infrastructure planning, and developing cost effective solutions to meet customer business requirements.\n\nAREAS OF EXPERTISE\nProduct / Program, Project Management, Business Process Re-engineering, Product / Software Life Cycle Management, System Design & Development, Customer Relationship Management,Strategic & Roadmap Planning, New Product Definition, Interdepartmental Coordination, Team Development & Leadership, Lean / Agile Methods, IT Strategy", "pendingInvitation": false, "defaultPosition": {"posId": 732062119, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "IT Specialist", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Josh Shleien", "positions": [{"posId": 732062119, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "IT Specialist", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 651467359, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "Independent Consulting", "description": "Trusted advisor providing technology guidance and implementation approaches across enterprise areas including infrastructure, applications, data and security. Support delivery teams to build solutions of various sizes and complexities.", "title": "Senior Solutions Architect", "startedOn": {"month": 1, "year": 2015}}, {"posId": 70034662, "new": false, "current": false, "endedOn": {"month": 12, "year": 2014}, "companyName": "Accelian LLC", "description": "Provide process, planning, architecture, and design guidance to projects throughout project lifecycles to ensure smooth execution and delivery of enterprise services, applications and projects. Lead technical architect with detailed understanding of DHS/ICE architecture, standards, strategic direction, and systems development methodology supporting multiple ICE components. Direct and guide multi-contractor projects and resources in technical delivery, while budgeting multi-million contracts for U.S. Department of Homeland Security Agencies.\nâ\u0097\u008f\tLed the migration of legacy systems to new technologies, and supported procurement, design, and implementation of Cloud solution architecture on DHS DTaaS, IaaS, Amazon Web Services and FedRamp VPCs. \nâ\u0097\u008f\tDesign and implementation of data conversion and data quality processes and tools to perform data verification, correction and standardization. \nâ\u0097\u008f\tDevelop and implementation of data analytics and visualization tools to provide ad-hoc reporting, trending, and analysis of program activities.\nâ\u0097\u008f\tSupport the ISSO / IAD, providing security control recommendations and mitigation of security vulnerabilities\nâ\u0097\u008f\tGuide and implementation of the Agile Scrum process for the product and development teams, provided support, direction, and implementation of SCRUM processes for releases. \nâ\u0097\u008f\tPrescribe technical design/architecture, and oversee project deliverables for RCA, evaluates historical criteria, weighted factors and criminal history\nâ\u0097\u008f\tConduct technical design, implementation architecture and infrastructure selection for the eBonds system, managing over 7K bonds per year ($22M in bonds).\nâ\u0097\u008f\tOversee system architecture, infrastructure, system assurance, and deployment for ODLS (http://locator.ice.gov)\nâ\u0097\u008f\tStreamlined and deployed RAMP, which assesses vulnerability in over 10K federal facilities. \nâ\u0097\u008f\tFFMS assessment, which led to the identification and mitigation of major architectural, system, and security vulnerabilities.", "location": "Washington D.C. Metro Area", "title": "Senior Solutions Architect", "startedOn": {"month": 5, "year": 2008}}, {"posId": 8903177, "new": false, "current": false, "endedOn": {"month": 10, "year": 2007}, "companyName": "Network Solutions", "description": "Led team of product and program managers in implementing sales & service support of Network Solutionsâ\u0080\u0099 online products and services to 1.2 million customers. Focused on streamlining fulfillment processes with Search Engine Optimization (SEO) and design products.\nâ\u0097\u008f\tDelivered technology and process solutions to improve reporting, efficiency, and sales performance.\nâ\u0097\u008f\tImplemented new business and fulfillment process to reduce backlog of SEO and design services resulting in $.5M in unclaimed revenue.\nâ\u0097\u008f\tLed implementation of Direct Sales Enterprise Sales Entry tool and invoice process adding $1M in revenue.\nâ\u0097\u008f\tLiaison with enterprise level multi-site call centers to identify customer issues and provide timely resolution.\nâ\u0097\u008f\tLaunched fulfillment support of custom web design services targeted to add $2M in revenue. \nâ\u0097\u008f\tEnhanced service validation processes and procedures increasing fulfillment times by 22%.\nâ\u0097\u008f\tImplementation of a Virtual Customer Agent system that led to an 8% increase in product renewal rates.\nâ\u0097\u008f\tLed support team for Network Solutions internal and external partner programs, who generate $10M in revenues. \nâ\u0097\u008f\tImplementation of Network Solution first ever paid support model for Virtual Private Server hosting services.\nâ\u0097\u008f\tProvided requirements and supported launch of sales lead and capture tools.\nâ\u0097\u008f\tImplemented Ecommerce Service Improvements, reducing churn by 10%.", "title": "Director, Sales and Service", "startedOn": {"month": 12, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:165168"}, {"posId": 27621356, "new": false, "current": false, "endedOn": {"month": 12, "year": 2006}, "companyName": "Network Solutions", "description": "Focused on developing and delivering on NetworkSolutions.com (online Store Front) roadmap. Shaping the interactions a customer or prospect has with Network Solutions. Guiding the design and feature functionality of NetworkSolutions.com. Management of external/internal resources with the design/UI of the Store Front. Driving the re-architecture of Account Manager, and managing overall process effectiveness within the team and to its customers. Led team of designers, producers and developers in the management and deployment of products, services, and functionality into Network Solutions eCommerce storefront.\nâ\u0097\u008f\tLed development and implementation of 20+ new products and numerous major flow redesigns and enhancements improving revenue, usability, and customer experience across the board.\nâ\u0097\u008f\tManaged and streamlined the development process across the organization to ensure the team hit their dates and produced the highest quality end product.\nâ\u0097\u008f\tProposed, initiated, and led an 8 month and $1.5M outsourcing effort to converge and redesign multiple Network Solutions sites to a single one based on user needs.\nâ\u0097\u008f\tDelivered key customer usability enhancements: â\u0080\u0098Needsâ\u0080\u0099 based purchase flow, dynamic merchandising, â\u0080\u0098sample web-siteâ\u0080\u0099 strategy, interstitial pages and the addition of Chat across the Network Solutions web site.\nâ\u0097\u008f\tAnalyzed and developed metrics to measure customer behavior and performance of the site, in order to make continuous improvements to the site, and resulting in increased revenue and decreased customer service costs.\nâ\u0097\u008f\tDeployment of top 13 Revenue initiatives in Q3 2006 which aimed to add $2M+ to the business top line.\nâ\u0097\u008f\tProvided business rules, requirement, and process for proof of concepts of a content management system.", "title": "Director, Customer Experience", "startedOn": {"month": 2, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:165168"}, {"posId": 27622270, "new": false, "current": false, "endedOn": {"month": 2, "year": 2006}, "companyName": "Network Solutions", "description": "Managed and led Product Development team for all services and initiatives developed by Network Solutions. Focus on diversifying Network Solutionsâ\u0080\u0099 revenue streams. Key contributor in the addition of 69 products and services increasing revenues to $286 million from $186 beginning in 2004.\nâ\u0097\u008f\tManaged and evaluated initiatives through concept phase, business case development, requirements, development, QA, deployment, and O&M. \nâ\u0097\u008f\tLed Network Solutionsâ\u0080\u0099 profitable entry into Search Engine Marketing offerings ($10M in 2005).\nâ\u0097\u008f\tLed corporate initiatives in technology and company acquisitions. \nâ\u0097\u008f\tLed initiative to bundle products across multiple product lines, increasing site usability, experience and revenues.\nâ\u0097\u008f\tResponsible for direction of multiple vendors, contractors, and outsourcing of development and support.", "title": "Director, Product Development (Program Management)", "startedOn": {"month": 1, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:165168"}, {"posId": 27623374, "new": false, "current": false, "endedOn": {"month": 1, "year": 2004}, "companyName": "Network Solutions", "description": "Senior Manager, Product Development (Program Management)\t1999 to 2004\nDrove cross-matrix teams responsible for full life cycle of business critical projects and products.\nâ\u0097\u008f\tResponsible for identifying, and developing capabilities to support, the needs of high valued users. \nâ\u0097\u008f\tResponsible for implementation, operations and fulfillment of initial web design service generating $1M.\nâ\u0097\u008f\tDesigned and implemented Frequent Flyer reward program, increasing revenue and customer retention by 5% and 8% respectively.\nâ\u0097\u008f\tManage the migration of the .ORG Top Level Domain (TLD) from VeriSign to PIR (Public Interest Registry). The .ORG TLD comprised 15% of VeriSignâ\u0080\u0099s 7M domain registrations.\nâ\u0097\u008f\tManaged technology update of Affiliates Program, which generated $2M, improving reporting, payment, and tracking of affiliates.\nâ\u0097\u008f\tDeveloped and launched secondary market service of domain names with cash sales of $2.5 million per year.\nâ\u0097\u008f\tLed the creation, development and management of the Alliance Marketing Program (AMP) program aimed at large online strategic partners\nâ\u0097\u008f\tProposed, designed, and implement VeriSign's Partner Portal, features and functions geared towards supporting VeriSign's wholesale partners, who generated $9.5M in revenue.\nâ\u0097\u008f\tManaged the integration of the $8M acquisition of the UK based domainnames.com, thereby becoming Verisign's Pan-European storefront and international channel. Planned and implemented marketing, development, business, and financial plans. \nâ\u0097\u008f\tImplemented, designed, and managed the development of channel renewals aging cycle, earning VeriSign $1.7M in reduced expenses and increased revenues.\nâ\u0097\u008f\tSpearheaded the development of requirements, scope, purchase flow and plan for release of co-branded VeriSignâ\u0080\u0099s international storefronts. Responsible for management of outsourced contractors involved in development, translation, and design of international storefronts $2M effort.", "title": "Sr. Manager, Product/Program Management", "startedOn": {"month": 10, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:165168"}, {"posId": 8903425, "new": false, "current": false, "endedOn": {"month": 10, "year": 1999}, "companyName": "Noblestar", "description": "Responsible for leading, developing and managing application design teams, comprised of software engineers, developers, and database administrators.\t\nâ\u0097\u008f\tLed team to create and deliver the system requirements for the Corporation for Public Broadcasting (CPB) Station Grants Management System (SGMS). SGMS gathers grant information from stations, collects the data in a central repository, performs data verification, and calculates grant formulas and individual grant amounts providing $250M in funding.\nâ\u0097\u008f\tLed team to deliver FAFSA on the WEB (fafsa.ed.gov), a web-based Financial Aid Form for Federal Student Aid for the Department of Education. Responsible for managing project goals, milestones and deliverables. Managed and supported development team. System supported well over 1 million users and $50M in student loan requests.", "title": "Practice Area Manager", "startedOn": {"month": 3, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:165206"}, {"posId": 27622909, "new": false, "current": false, "endedOn": {"month": 3, "year": 1996}, "companyName": "GSA", "description": "Specialist, New Technologies\t1990 to 1996\nCreated the agencyâ\u0080\u0099s online presence and implemented new methods of organizing and disseminating information via new technologies\nâ\u0080¢\tDesigned and launched the Consumer Information Centers (CIC) Website (pueblo.gsa.gov) The Consumer Information Center's online systems have been honored as one of the best uses of the `Information Highway` by the NII Awards and received recognition from Vice President Al Gore.\nâ\u0080¢\tDeveloped, researched and implemented new methods of organizing and disseminating information via new technologies. Implement online systems, CD-ROM development, and fax on demand system, to provide improved information services to consumers. Managed SOW, Contract, and vendor selection.\nâ\u0080¢\tImplemented, designed, maintained the Consumer Information Centers Bulletin Board System, rated by Database magazine as one of the top 10 Federal Bulletin Boards. \nâ\u0080¢\tResponsible for layout, and creation of various computer-aided desktop designs and graphics for a variety of marketing/promotional projects disseminated to over 2-3 million federal retirees and veterans.\nâ\u0080¢\tConstructed, defined and administered various database system solutions to track and maintain publication information.", "title": "New Technologies Specialist", "startedOn": {"month": 12, "year": 1990}, "companyUrn": "urn:li:fs_salesCompany:5353"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Josh", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/joshshleien", "location": "Washington D.C. Metro Area"}