{"lastName": "Hale", "objectUrn": "urn:li:member:489165425", "contactInfo": {"emails": [{"emailAddress": "joelhale1@hotmail.com", "dataSource": "LINKEDIN"}], "primaryEmail": "joelhale1@hotmail.com"}, "crmStatus": {"imported": false}, "industry": "Military", "educations": [{"endedOn": {"year": 2019}, "fieldsOfStudy": [], "school": "urn:li:fs_salesSchool:17883", "degree": "Bachelor of Homeland Security and Emergency Management", "schoolName": "National University", "startedOn": {"year": 2015}, "eduId": 491072035}, {"fieldsOfStudy": ["Military and Strategic Leadership"], "degree": "Staff Career Course", "schoolName": "United States Marine Corps", "startedOn": {"year": 2017}, "eduId": 504918516}, {"fieldsOfStudy": ["Leadership and Management Development"], "degree": "Senior Enlisted Joint Education Course", "schoolName": "United States Marine Corps", "startedOn": {"year": 2017}, "eduId": 504920822}, {"endedOn": {"year": 2003}, "fieldsOfStudy": ["General Studies"], "degree": "Diploma", "schoolName": "Duncan Polytechnical High School", "startedOn": {"year": 1999}, "eduId": 492246530}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAB0oEnEBxM7kt604z8GcoKgO-UXtlSL_Ri4,NAME_SEARCH,undefined)", "numOfConnections": 194, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEQmFpYLzIREg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=aN02vIyjwxGoyO9jCjrbRnNPrbDuRhe6x2llXQ10ryw", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEQmFpYLzIREg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=DsFl08Ss-GX1uAp4o1937vOrkM-cCfLIWOVofI6n29A", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEQmFpYLzIREg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=B9Clp4FMYOSsqNAcy0q3uS9S4O-hWR78jd4WxJiztz8", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEQmFpYLzIREg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=vWuDDD5aapizYxFHeYG4ah2KMw_0zU9kCIRo0zCbfGo", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Maintenance Technician at VSP Optics", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Successfully completed over 10 years with the United States Marine Corps with 3 combat and 2 overseas deployments showcasing my ability to work under pressure and in a high tempo environment. I process organizational and leadership skills as I continue my military career as a senior leader. I am Goal-oriented and energetic with a talent for motivating participants with enthusiasm and encouragement. Extensive educational and professional background in military leadership, security management, and contingency operations.", "pendingInvitation": false, "defaultPosition": {"posId": 1326834339, "new": true, "current": true, "companyName": "VSP Optics", "description": "ROBOTIC AUTOMATION: Experienced with hydraulic and pneumatic power, mechanical, and thermal system repair. Performed functions associated with all manufacturing operations including set-up, calibration, analysis and troubleshooting of circuits, and components and electromechanical assemblies. Diagnosed, repaired, maintained, and configured various types of computer controlled automated manufacturing and production equipment.\n\nSENSITIVE ELECTRONIC REPAIR:  Experienced in trouble-shooting electrical, electronic, pneumatic and hydraulic motor control systems, including the use of electrical diagnostic equipment and ability to read system schematics and drawings to maximize efficiency and to abide by OEM specifications. Analyzed and identified failed analog and digital electronic systems and assemblies and repaired them down to their component levels. Fabricated various types of harnesses, panels, and cables, printed circuit boards and related assemblies. Responsibilities included assembling parts or units, and positioning, aligning and fastening units to assemblies, subassemblies, or fames, using hand tools and power tools.\n\nDIAGNOSTIC TROUBLESHOOTING: Performed repairs using schematics/diagrams, multi-meter, oscilloscopes along with other tools and equipment to aid with the troubleshooting process.  Troubleshot, repaired, and tested products at component level, entered information into database, and performed monthly analysis of data to determine consistent part failures. \n", "location": "Greater San Diego Area", "title": "Electrical Maintenance Technician", "startedOn": {"month": 5, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:3053342"}, "degree": 3, "fullName": "Joseph Hale", "positions": [{"posId": 1326834339, "new": true, "current": true, "companyName": "VSP Optics", "description": "ROBOTIC AUTOMATION: Experienced with hydraulic and pneumatic power, mechanical, and thermal system repair. Performed functions associated with all manufacturing operations including set-up, calibration, analysis and troubleshooting of circuits, and components and electromechanical assemblies. Diagnosed, repaired, maintained, and configured various types of computer controlled automated manufacturing and production equipment.\n\nSENSITIVE ELECTRONIC REPAIR:  Experienced in trouble-shooting electrical, electronic, pneumatic and hydraulic motor control systems, including the use of electrical diagnostic equipment and ability to read system schematics and drawings to maximize efficiency and to abide by OEM specifications. Analyzed and identified failed analog and digital electronic systems and assemblies and repaired them down to their component levels. Fabricated various types of harnesses, panels, and cables, printed circuit boards and related assemblies. Responsibilities included assembling parts or units, and positioning, aligning and fastening units to assemblies, subassemblies, or fames, using hand tools and power tools.\n\nDIAGNOSTIC TROUBLESHOOTING: Performed repairs using schematics/diagrams, multi-meter, oscilloscopes along with other tools and equipment to aid with the troubleshooting process.  Troubleshot, repaired, and tested products at component level, entered information into database, and performed monthly analysis of data to determine consistent part failures. \n", "location": "Greater San Diego Area", "title": "Electrical Maintenance Technician", "startedOn": {"month": 5, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:3053342"}, {"posId": 1322541343, "new": false, "current": true, "companyName": "Wounded Warrior Battalion ", "description": "WOUNDED WARRIOR PROGRAM: Completed 6 months of comprehensive medical, rehabilitative recovery, reconditioning, counseling, and transition support training to regain momentum and strength while overcoming injuries. Successfully enrolled in several University undergrad degree courses while maintaining a GPA of 3.62 and balancing a busy work schedule, internship, intensive medical appointments, therapy sessions, and community relation projects.\n\nTRANSITIONAL SKILLS DEVELOPMENT: Though comprehensive classroom skill building courses learned skills in: resume writing, military to civilian skill translation, professional networking, job placement preparation, vocational opportunities, physical fitness, and meditation fundamentals to assist with transition out of military service.\n\nPERSONAL ACCOMPLISHMENTS: Developed methods to strengthen both body and mind to improve overall self-confidence, self-esteem, and rehabilitative recovery through self-reflection.  Fully participated in various leadership, individual and group athletic, and community service events. \n", "location": "Camp Pendleton, California", "title": "Recovering Service Member", "startedOn": {"month": 1, "year": 2018}}, {"posId": 1311196487, "new": true, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "MULTI-AGENCY COLLABORATION: Worked directly alongside Californiaâ\u0080\u0099s Orange County Sheriff Department within the Joint immigration detention and Maximum-Security prison of Theo Lacy Facility in Santa Ana, California providing medical, housing, security, and legal representation for all phases of non-resident alien deportation cases. \n\nCOMPUTER KNOWLEDGE: Experienced with Law Enforcement computer programs such as: ETD, EARMS, and EAGLE for processing vital legal documents for specific foreign Consulates to review during the deportation process.\n\nINTERVIEW & INVESTIGATION: Interviewed, investigated, and analyzed pertinent information from English and non-English speaking detainees to further process lawful deportation travel arrangements while overcoming the adversity of foreign language barriers. \n\nRECORD MANAGEMENT: Managed, prepared, and submitted over 20 deportation orders for the removal of both criminal and civil detained foreign nationals by reviewing case docket files, uploading sensitive and vital documents to be reviewal of various foreign consulates prior to deportation expedited removal from the United States. Reviewed detained foreign nationalâ\u0080\u0099s medical compliance records, insuring all primary medical and dental care was received while in custody prior to the submittal of deportation orders and the removal from the United States. Maintained physical and electronic record of case files, individual personal legal documents, criminal/civil history for removal and deportation cases for several Central American and Caribbean Nations. Studied and reviewed Immigration Law Codes to determine the correct legal form(s) needed and required for the determination of a criminal or civil foreign alienâ\u0080\u0099s deportation removal order documentation.", "location": "Santa Ana, California", "title": "Intern-ERO/Detained Program", "startedOn": {"month": 5, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1194068610, "new": false, "current": false, "endedOn": {"month": 5, "year": 2018}, "companyName": "United States Marine Corps", "description": "PERSONNEL MANAGEMENT - Hand selected as primary decision-maker on night shift for a drastically under-staffed maintenance department experiencing frequent turnover in technicians; resulted in improved operational effectiveness and improved safety and increased maintenance efficiency adding to mission readiness.  Directly supervised a 4-aircraft, 42-member operational detachment and provided the squadron with sufficient specialized pre-deployment training.  Conducted morning, afternoon, and evening maintenance briefs after analyzing, compiling, and arranging information on 16 aircrafts and 11 work centers. Directed pertinent preventative repair, inspections, and aircraft configurations for requirements for mission completeness.  \n\nPROGRAM MANAGEMENT - Served as the Collateral Duty of Technical Directives Compliance Program Coordinator (TDPC) insuring program compliance by researching Technical Directives (TD) on Naval Air Technical Data and Engineering Service Center (NATEC) Deck Plate for availability, verification of airframe and/or component applicability, maintained strict material control of parts and kits, and maintained detailed accountability of active and historical data of TD reports and documentation.  Received a notable mention during a periodic 1st Marine Aircraft Wing Program Inspection. Served as the Collateral Duty of Navy Oil Analysis and Consumption Monitoring Program (NOAP) Coordinator, insuring squadronâ\u0080\u0099s compliance with Naval and Joint Forcesâ\u0080\u0099 monitoring of oil usage rate and oil condition in aircraft equipment, for detection of possible impending component failures. Received a Bravo Zulu with Honorable Mention during a weeklong Commander of Naval Air Forces (CNAF) Inspection due to having zero deficiencies and outstanding program documentation.\n\nINVENTORY CONTROL - Coordinated and maintained vast inventories of required materials and components for 16 aircrafts totaling over $15 million to meet production and flight schedules operations.", "location": "Greater San Diego Area", "title": "Aircraft Maintenance and Production Manager ", "startedOn": {"month": 4, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:11175823"}, {"posId": 1194073103, "new": false, "current": false, "endedOn": {"month": 4, "year": 2017}, "companyName": "United States Marine Corps", "description": "QUALITY ASSURANCE AUDITS - Evaluated several aviation and support equipment maintenance, safety, and NAMP programs by performing periodic Computerized Self Evaluation Checklist (CSEC) audits which includes: Special, Work Center, Quality Assurance, and Annual Audits; insuring immediate compliance of standards while detecting unsatisfactory conditions through trend analysis and developing methods for correcting those deficiencies in a safe and timely manner. \n\nQUALITY  ASSURANCE STANDARDIZATION - Coordinated periodic mock emergency action drills for programs under Naval Aviation Maintenance Program Standard Operating Procedures (NAMPSOPs) as simulated fuel spills, hazmat contamination, loss of power/contingency operations, Foreign Object Damage (FOD), tool control procedures, and Electric Static Discharge (ESD) procedures.  Provided standardization and knowledge of mishap recognition, prevention, and emergency actions to decrease the likelihood of a situation occurring.  As a Corporal to Staff Sergeant of Marines, supervised quality assurance standards of general aircraft maintenance by reviewing work progress by establishing and maintaining a high level of professionalism amongst the team though personal examples and strict adherence to Maintenance Instructional Manuals (MIMs) and the 4790 NAMP publication.\n\nTRAINING - Directly responsible for the training and certification of 20+ Marines in the intense curriculum for the additional Military Occupation Specialty (MOS) and designation of Collateral Duty Quality Assurance Representative (CDQAR). Conducted yearly periotic assessments insuring those with the designation are continuously following standardized policies and procedures governed by the Naval Aviation Maintenance Program (NAMP) of the Department of the Navyâ\u0080\u0099s Commander Naval Air Forces (CNAF). \n", "location": "Greater San Diego Area", "title": "Aircraft Maintenance Quality Assurance Inspector", "startedOn": {"month": 3, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:11175823"}, {"posId": 1208515217, "new": false, "current": false, "endedOn": {"month": 10, "year": 2016}, "companyName": "United States Marine Corps", "description": "PERSONNEL ADVANCEMENT TRAINING - Served as First-Line Supervisor and Senior Lead Instructor for two 125-hour small unit leadership instruction courses for more than 60 military members preparing for promotion advancement and leadership improvement.  Culminated each Small Unit Leadership course with an extensive 12-hour practical exam enabling students to utilize lessons learned, team building, problem solving both as a team and individual, simulated casualties, land navigation without electronics, simulated enemy contact, radio communication, and the administration of medical aid. Developed and integrated new and updated improvements to course curriculum, providing lessons plans based upon the demographics and learning challenges of each class to maximize the academic achievement of all students. \n\nDOCUMENTATION/RECORD KEEPING  - Maintained an electronic record keeping system designed to efficiently document the scores of each exam, student grades, inspection results, physical fitness outcomes to better assess the learning curve of all 30 students during each of the 2 academic courses. The record system also documented my performance evaluations of each of the courseâ\u0080\u0099s 3 instructors. \n\nMILITARY STANDARDS AHEARANCE - Conducted periotic in-course inspections of service and utility uniforms abiding by USMC military uniform regulations. These inspections demanded and reinforced the adherence of strict discipline, confidence, honor, and self-respect needed as a small unit leader and Non-commissioned Officer of Marines. Administered 24 detailed exams, quizzes, and physical fitness tests to ensure students are versed in the course material and within physical fitness standards of the United States Marine Corps.\n", "location": "Kailua Hawaii", "title": "Senior Lead Instructor for Enlisted Professional Military Education", "startedOn": {"month": 6, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:11175823"}, {"posId": 1194070897, "new": false, "current": false, "endedOn": {"month": 3, "year": 2011}, "companyName": "United States Marine Corps", "description": "AIRCRAFT MAINTENANCE - Serviced and lubricated aircraft and subsystems to ensure aircraft met inspection and maintenance compliance requirements. Performed scheduled and periodic maintenance inspections, assisted in major aircraft maintenance evolutions, conducted limited system operational checks for proper operational specifications. Troubleshot and repaired aircraft subsystems using special diagnostic tools and equipment as required as specified in maintenance publications.\n\nTEAM LEADERSHIP & SUPERVISON -  As a junior Marine (Lance Corporal) supervised Power Systems Department by monitoring tasking of daily routine and emergency maintenance workorders, personnel accountability, and material supply inventory.  As a junior ranking Marine led a team of 12 to contribute critical knowledge and expertise in the successful breakdown of two aircrafts for embarkation and transportation from OEF to the United States, resulted in project completion of 2 weeks ahead of schedule.\n\nTRAINING & MENTORING - As the Training and Licensing Coordinator, successfully managed 80 Marines' syllabi, ultimately resulting in the completion of more than 74 syllabi and the timely issuance of appropriate licenses. Employed conflict intervention and resolution skills with techniques that deescalated confrontations; provided improved communication and collaboration skills while working with members of other military branches resulting in greater relations and mission success. \n\nRECORD KEEPING - Directly managed Safety, Hazmat, and Embarkation programs by providing training, periodic audits, and extensive record keeping for 800 Marines and Sailors. \n", "location": "Greater San Diego Area", "title": "Aircraft Power Systems Mechanic", "startedOn": {"month": 1, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:11175823"}], "pictureInfo": {}, "relatedColleagueCompanyId": 3053342, "savedLead": false, "firstName": "Joseph", "numOfSharedConnections": 0, "memberBadges": {"premium": true, "openLink": true, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/joseph-hale", "location": "Greater San Diego Area"}