{"objectUrn": "urn:li:member:99109691", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAXoSzsBQYn7MOXTivEkTYCOBiDQ8Ue9iBA,NAME_SEARCH,undefined)", "numOfConnections": 29, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGO8wrU7tJKPg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=1Z_K1Tsg-SwJlyUHKpsWYpexBsI9f2ikdT7UYuUO9hs", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGO8wrU7tJKPg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=ufGuJ6QLudlYtaARIGfvaJC955JX6W1WxqNLtyRuL6c", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGO8wrU7tJKPg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=rXGOn7cy2ezQXu3S62e51h76qiZLoBtxsHpgX5QmxIU", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGO8wrU7tJKPg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=I7WLm2Ln-jDgL1omu3QhKUvg-RTzAm5P2Ce7aq5_d-w", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Program Analyst at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "PROGRAM COORDINATOR / ADMINISTRATOR with progressive experience providing analysis, program and project planning and management.  Solid record of performance managing analytical studies, key initiatives, and high-profile performance improvement projects. Technical expert and analyst on complex program issues. Very strong critical thinking, problem solving, research and liaison skills. Recognized for outstanding communication skills, flexibility, keen political savvy, and leadership abilities.  ", "pendingInvitation": false, "defaultPosition": {"posId": 1228176841, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington D.C. Metro Area", "title": "Program Analyst", "startedOn": {"month": 3, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 1228176841, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington D.C. Metro Area", "title": "Program Analyst", "startedOn": {"month": 3, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 910029855, "new": false, "current": false, "endedOn": {"month": 3, "year": 2017}, "companyName": "Us Naval Research Laboratory", "location": "Washington D.C. Metro Area", "title": "Travel Specialist", "startedOn": {"month": 8, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:8046854"}, {"posId": 157676944, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "DOD/Department of Army", "description": "Serves as Administrative Officer to the Director of the Permanent Executive Secretariat for the Conference of American Armies (PESCAA). Providing full performance executive level support of all administrative services. Provides protocol services, program management and administrative support utilizing a variety of methods and processes; creating documents for posting on the organizations SharePoint portal; reviewing, updating, and, as necessary, developing complex administrative office procedures that affect the orderly and efficient flow of work involving transactions with both internal and external organizations. Interact and deal effectively with all management levels within DoD and other federal agencies.\n\nPROTOCOL LIASON: Serve as the Protocol Liaison performing the full range of administrative, procedural, and miscellaneous protocol duties and responsibilities for the Director. Independently plans programs, event ceremonies, and official and social functions involving distinguished foreign and domestic visitors. Provides policy guidance and other advisory services to the varied organizations within the local military community, and tenant units.  Plans and provides on-site guidance during various military and civilian ceremonies for visiting dignitaries, military members and other distinguished visitors. Plans and monitors the visits of distinguished persons or groups representing national and/or international governmental agencies, community of professional organizations, private industries or universities whenever the Directorate Staff is involved or as directed by ARSOUTH. Manages the Distinguished Visitor (DV) initiatives ensuring billeting and transportation requirements are met for distinguished visitors. Serves as the Directors representative during the planning of special projects and events in coordination with ARSOUTH and the various organizations including tenant units within the local military community. ", "location": "San Antonio, TX", "title": "Administrative Officer", "startedOn": {"month": 8, "year": 2014}}, {"posId": 637545407, "new": false, "current": false, "endedOn": {"month": 8, "year": 2014}, "companyName": "DOD/IMCOM-Army Installation Management Command", "description": "Serves as the Executive Assistant to the Director in support of administrative services, responsible for providing executive level administrative support, provides protocol services, program management and office automation support utilizing a variety of methods and processes; creating documents for posting on the organizations SharePoint portal; reviewing, updating, and, as necessary, developing complex administrative office procedures that affect the orderly and efficient flow of work involving transactions with both internal and external organizations; Manages the administrative processes and ensures that procedures meet IMCOM needs and they are consistently understood and followed by the staff.   Maintains the Directorate Chief and the Deputy Director Calendar.  Makes all travel arrangements for the Directorate Chief and the Deputy Director. Proficient in Defense Travel System (DTS).  Provides support for mandatory training.  Assists in maintaining Daily Accountability of all Personnel.  Analyze emerging proposals affecting installations and provide guidance to divisions and installations. Evaluate and coordinate proposals. Schedule and finalize   coordination/connectivity requirements for all meetings, VTCs, and Teleconferences. Working knowledge of applicable administrative Army, and IMCOM regulations, policies and procedures.  Analyze and explore opportunities to improve processes.  Serves as the subject matter expert on systems such as Defense Travel System (DTS), Defense Finance and Accounting System (DFAS), Contracting Officer Technical Representative (COTR) duties, Performance Work Statement (PWS) and Services Contract Approval (SCA) development and approval, Government Purchase Card (GPC), Defense Civilian Personnel Data System (DCPDS), General Fund Enterprise Business System (GFEBS), and Defense Training Management System (DTMS).\n\n", "location": "San Antonio, TX", "title": "Executive Assistant", "startedOn": {"month": 1, "year": 2014}}, {"posId": 637542582, "new": false, "current": false, "endedOn": {"month": 1, "year": 2014}, "companyName": "FEMA/FIMA Federal Insurance and Mitigation Administration", "description": "PROPERTY MANAGEMENT/ARCHIVAL: Plans and coordinates special requirements for hard to finds supplies or property and coordinates extremely difficult office moves. Maintains spreadsheets and logs current supplies and initiates the process for ordering additional supplies. Maintains request for specialty orders and determines need for maintaining such supplies. Develops and maintains accurate systems in tracking of equipment and property to include new, old, lost/stolen and excessed equipment both in an at permanent duty station and during emergency disaster deployment.  Maintains hand receipts of government furnished equipment. Conducts physical inventories on equipment and resolves issues concerning tracking government furnished equipment with staff and contractors throughout the organization. Maintains database of equipment in the LIMBS system. Assigns new computers, printers, telecommunications devices, air cards, network printers, etc.  Excesses old and damaged equipment prepares for removal of such equipment. Logs and submits lost report in accordance with federal regulation for all lost and stolen government property.  Collaborate with authorizing official in developing annual budget requirements and planning expenditures. ", "location": "Arlington, VA", "title": "Program Specialist/ Property Manager", "startedOn": {"month": 5, "year": 2013}}, {"posId": 637545092, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "Department of Veterans Affairs", "description": "Program Support Specialist to Director of VA Office of Information Technology Resource Management (ITRM). Provides direct administrative support to the Director and Deputy Director through the coordination of staff assignments, operate and manage to include control and coordination of staff actions. Analyze incoming requirements and correspondence and determine those needing immediate attention. Evaluate the need for requirements for coordination of responses within OIT or with external elements and ensures coordination occurs. Resolve disputes with regard to the assignment, preparation and administrative processing of actions assigned to OIT. Return misrouted actions or actions for which the OIT does not have oversight. Task Directorate levels for information papers in preparation of congressional testimony. Manage the organization's suspense system for all suspense's, both internally and externally established. Oversee the tracking of suspense's through automated system. Meet with action officers to establish timelines for completion of requirements. Personally responds to actions with short suspense (often less than 24 hours). Consolidate information from all Directorates. Inform action officers of delays, adjustments in suspense's and priorities or other major changes in each action as they occur. Advise new personnel on specialized procedures and terminology of the office, as well as preparation, content, and assembly of staff actions. Train new personnel on proper administrative procedures. Provision of liaison services, and   monitoring and reporting on the status of projects; Managing the executives' calendars, including scheduling appointments and meetings; Planning and coordinating special program assignments and projects on behalf of management; Handling inquiries from callers and visitors with tact and diplomacy to identify the issue at hand and refer the requester to the appropriate party; and preparing a variety of written documents for executives. ", "location": "Washington, DC", "title": "PROGRAM SUPPORT SPECIALIST", "startedOn": {"month": 3, "year": 2013}}, {"posId": 637540994, "new": false, "current": false, "endedOn": {"month": 3, "year": 2013}, "companyName": "Department of Commerce/NOAA", "description": "Executive Assistant to Division, Deputy Division and Branch Chiefâ\u0080\u0099s in the Satellite Products and Services Division of NESDIS. Provides direct administrative support to the Division Chief, Deputy Division Chief and Branch Chiefâ\u0080\u0099s through the coordination of staff assignments, provision of liaison services, and   monitoring and reporting on the status of projects; Managing the executives' calendars, including scheduling appointments and meetings; Planning and coordinating special program assignments and projects on behalf of management; Handling inquiries from callers and visitors with tact and diplomacy to identify the issue at hand and refer the requester to the appropriate party; and Preparing a variety of written documents for executives . Ability to gather and analyze facts, draws conclusions, and devises practical solutions to problems. Knowledge of management principles, pertinent administrative regulations, knowledge staffing guidelines and federal employment policies. Ability to deal with a variety of individuals to include agency managers and employees. Coordinate the annual and mid-year performance appraisal process for the division to ensure that managers and supervisors follow the time frames and procedures. Review and process requests for training and compare request for out-service training against available in-service training. \n\n", "location": "College Park, MD", "title": "Executive Administrative Assistant", "startedOn": {"month": 2, "year": 2010}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/mattie-johnson-ross-18b23729", "location": "Washington D.C. Metro Area"}