{"lastName": "Aarons", "objectUrn": "urn:li:member:297775538", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1988}, "fieldsOfStudy": ["Criminal Justice"], "school": "urn:li:fs_salesSchool:18570", "degree": "Bachelor of Arts (B.A.)", "schoolName": "University of Maryland College Park", "startedOn": {"year": 1983}, "eduId": 249324670}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABG_sbIBYMrBoM4xrH1bMyYC9MlsPko5AYY,NAME_SEARCH,undefined)", "numOfConnections": 610, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGP_3oWBwYqVg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=1ipCvljjzqS6nVQWAegxByCxE44d08s6sRVhPvCR24A", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGP_3oWBwYqVg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=n7k2-QY0gA6u2RsliLd3lfNI41eZAKdq-1Hy7MbULKM", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGP_3oWBwYqVg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=C9Sc7R6PPyWjAs6OxEKBSHwW1mW4TDFa772BllKlcmI", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGP_3oWBwYqVg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=XHfa2l6ZL_OMe3ATty1ze0IFvsWavWZBSKEQDGL1xak", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Operations Chief - International Organized Crime Intelligence and Operations Center / Homeland Security Investigations", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "31 years of federal law enforcement experience in the Departments of Treasury and Homeland Security. Extensive experience in the management of personnel and budgets in multi-agency and multi-national coordination environments. Strong background in conducting and managing investigations targeting a wide range of criminal violations, to include money laundering, narcotics, commercial fraud, child exploitation, and the Internet. Interaction with DOD, intelligence community, and national security counsel on transnational organized crime threat. Experienced communicator in oral and written environments.", "pendingInvitation": false, "defaultPosition": {"posId": 1214383140, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "IOC-2 serves as the primary deconfliction and coordination mechanism for U.S. law enforcement counter-organized crime efforts.  Manage the Operations Division consisting of 20 agents, analysts, and contractors from domestic and international agencies.  Support high-level field investigations, including money laundering, credit card/ATM skimming, darkweb marketplaces, digital currency, human smuggling/trafficking, visa fraud, and identity theft.  Exploit financial data to support the identification of illicit assets moving through the banking industry and identify assets for seizure targeting.  Management and oversight over multiple budgets totaling more than $1 million.  Develop/foster domestic and international partnerships to facilitate intelligence and lead sharing.\n", "location": "Chantilly, VA", "title": "Operations Chief - International Organized Crime Intelligence and Operations Center", "startedOn": {"month": 10, "year": 2017}}, "degree": 3, "fullName": "Roger L. Aarons", "positions": [{"posId": 1214383140, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "IOC-2 serves as the primary deconfliction and coordination mechanism for U.S. law enforcement counter-organized crime efforts.  Manage the Operations Division consisting of 20 agents, analysts, and contractors from domestic and international agencies.  Support high-level field investigations, including money laundering, credit card/ATM skimming, darkweb marketplaces, digital currency, human smuggling/trafficking, visa fraud, and identity theft.  Exploit financial data to support the identification of illicit assets moving through the banking industry and identify assets for seizure targeting.  Management and oversight over multiple budgets totaling more than $1 million.  Develop/foster domestic and international partnerships to facilitate intelligence and lead sharing.\n", "location": "Chantilly, VA", "title": "Operations Chief - International Organized Crime Intelligence and Operations Center", "startedOn": {"month": 10, "year": 2017}}, {"posId": 738003580, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Service as the primary liaison to the US Transportation Security Administration (TSA) to facilitate inter-agency coordination between HSI and TSA components on cross-agency matters, to include development and coordination of joint operational, training, and oversight initiatives.", "location": "Washington D.C. Metro Area", "title": "Homeland Security Investigations Liaison to TSA", "startedOn": {"month": 11, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1038218933, "new": false, "current": false, "endedOn": {"month": 10, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "The Traveler Redress Inquiry Program (TRIP) serves as a mechanism through which global travelers can file a request for review when encountering travel-related difficulties associated with efforts to enter, depart, or transit the U.S.  Oversaw the processing of TRIP referrals to ICE for the review of potential investigative interests in identified travelers.  Oversaw the coordination of TRIP referrals with federal investigative law enforcement counterpart agencies for the review of potential investigative interests in identified travelers.\tProvided effective management to successfully process approximately 3,000 TRIP cases annually.  Continually reviewed ICE TRIP process to assess effectiveness and implement procedural changes as needed to facilitate the processing of TRIP cases in a more practicable manner.\n", "location": "Washington D.C. Metro Area", "title": "Unit Chief - ICE Traveler Redress Inquiry Program", "startedOn": {"month": 2, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 604809604, "new": false, "current": false, "endedOn": {"month": 2, "year": 2016}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Oversaw more than 40 multi-agency representatives and contractors comprising the Operations, Intelligence, and Legal Divisions.  Responsible for guiding the efforts of IOC-2 in support of mission to target the disruption and dismantlement of transnational organized crime (TOC) groups posing the greatest threat to the United States.  Managed daily operations of the Operations Division, and provided oversight as to the long-term goals and efforts of all divisions.  Responsible for managing the expenditure of the IOC-2 multi-million dollar operating budget, including contractor, facility, and operational support allocations.  Represented IOC-2 in high-level meetings with senior managers from the Department of Justice, National Security Council, Department of Defense, and Intelligence Community.", "location": "Virginia", "title": "Director, International Organized Crime Intelligence and Operations Center", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 604817091, "new": false, "current": false, "endedOn": {"month": 4, "year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Assigned to US Customs and Border Protection (CBP) Headquarters to facilitate inter-agency coordination between HSI and CBP components on cross-agency matters, to include development and coordination of joint operational, training, and oversight initiatives. Interacted with CBP management to determine the level of cross-agency involvement in identified efforts, and provided HSI perspective as appropriate.", "location": "Washington, DC", "title": "Homeland Security Investigations Liaison to CBP", "startedOn": {"month": 11, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 612593427, "new": false, "current": false, "endedOn": {"month": 11, "year": 2011}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Responsible for oversight and coordination of eight Special Agent in Charge field offices.  Supervised Operations Managers who oversaw the daily review, reporting, and support of field activities.  Briefed senior management on significant field activity in a timely and accurate manner.  \nProvided direction to field offices to ensure operation within established procedures, policies and directives in furtherance of the HSI mission.  Facilitated requests for assistance, funding and information from the Northeast Region offices, acting as a conduit to senior management and other Headquarters divisions.  \n\nRepresented HSI on a DHS Preventing and Combating Serious Crime working group to develop an information sharing mechanism between the U.S. government and international law enforcement partners.  Represented HSI on the Disciplinary and Adverse Action Panel, reviewing employee misconduct cases to propose appropriate disciplinary action.", "location": "Washington, DC", "title": "Operations Chief, Homeland Security Investigations", "startedOn": {"month": 8, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 612598254, "new": false, "current": false, "endedOn": {"month": 8, "year": 2010}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Initiated and developed the Field Support Unit to consist of 12 HSI personnel and 12 liaisons from IPR Center partner agencies.  Created the Intake and Investigations Sections within the Unit.  Developed protocols and procedures to govern and track the receipt, deconfliction, and dissemination of leads received by the IPR Center.  Established a mechanism by which partner agencies reviewed active leads and investigative overlap identified during the vetting process.  Established a procedure for augmenting existing investigations and developing leads for dissemination to field offices.  Managed criminal investigations conducted within the Field Support Unit.", "location": "Crystal City, VA", "title": "Unit Chief - National Intellectual Property Rights Coordination Center", "startedOn": {"month": 9, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 612700040, "new": false, "current": false, "endedOn": {"month": 8, "year": 2008}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Served in a senior management position within the multi-agency DEA Special Operations Division (SOD).  Supervised ICE personnel and provided operational oversight, workload assignment and management, time and attendance review, and performance evaluations.  Managed HSI's operating  budget, with approving authority for operational support and travel expenditures.  Responsible for all levels of reporting and interaction between SOD and ICE/HSI senior management to facilitate the mission.  Coordinated with other SOD member agencies in furtherance of ICE's mission and investigative equities.  Served in the corollary position of SOD Assistant Special Agent in Charge over the Money Laundering Section.  Supervised six additional multi-agency personnel in furtherance of the SOD counter-money laundering mission to coordinate national and global money laundering trends and enforcement actions.", "location": "Chantilly, VA", "title": "Unit Chief, Homeland Security Investigations, Special Operations Unit", "startedOn": {"month": 6, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 730240391, "new": false, "current": false, "endedOn": {"month": 6, "year": 2007}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Served as a program manager at the DEA Special Operations Division.  Provided investigative deconfliction, coordination, lead development, and analytical support to ICE field investigative offices.", "title": "Special Agent", "startedOn": {"month": 3, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 793714184, "new": false, "current": false, "endedOn": {"month": 2, "year": 2003}, "companyName": "U.S. Department of the Treasury", "description": "Conducted/supported ongoing criminal investigations into internet-based child exploitation activity.  Analyzed digital evidence to locate/identify child exploitation violators and issue leads for investigative action.  Served as Project Manager over USCS global efforts to target financial-based criminal activity.  Supported development and modernizing of USCS anti-money laundering procedures and policies.  \nServed as lead Special Agent with the United States Customs Service (USCS) MDMA/Ecstasy Task force.  Provided policy and procedural oversight for USCS efforts to counter the increasing threat posed by the global manufacturing, smuggling, and distribution of MDMA.  Provided training and coordination for global counter-MDMA efforts at Interpol and other international law enforcement organizations.  ", "location": "Washington D.C. Metro Area", "title": "Senior Special Agent", "startedOn": {"month": 5, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:5064"}, {"posId": 730242252, "new": false, "current": false, "endedOn": {"month": 4, "year": 1999}, "companyName": "U.S. Department of the Treasury", "description": "Served as a Special Agent with the United States Customs Service in the Southwest border environment.  Developed complex criminal investigations involving smuggling and money laundering activity.  Executed approximately 750 arrests, more than 250 as primary case agent.  Processed evidence in accordance with established policies and directives.  Conducted more than 1,000 interviews of suspects, cooperating defendants, witnesses, and associates.  Executed approximately 100 search warrants, identifying and processing prosecution evidence.  Prepared approximately 1,000 accurate and concise reports of investigation documenting relevant arrest, interview, search, and/or enforcement action activity.  Served as an expert witness in both federal and state criminal court systems on more than 100 occasions.", "location": "San Diego, CA", "title": "Special Agent", "startedOn": {"month": 8, "year": 1988}, "companyUrn": "urn:li:fs_salesCompany:5064"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Roger L.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/rlaarons", "location": "Washington D.C. Metro Area"}