{"lastName": "C.", "objectUrn": "urn:li:member:589559575", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"fieldsOfStudy": ["Public Administration"], "school": "urn:li:fs_salesSchool:18706", "schoolName": "Park University", "eduId": 435936889}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAACMj9xcB1KYREcX2y4AvWLvHdf5exB5jT0M,NAME_SEARCH,undefined)", "numOfConnections": 131, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEEOuaOkDNHKA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=KSI4QI9XTGXI9kj5C3BEF_Qflu7XR8CmM7mOshGOenE", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEEOuaOkDNHKA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=LRuDP60M3hL38AP7m2RSoOqB3DKxQTuEZwt3DntEPqE", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEEOuaOkDNHKA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=-NCchp3Q-wpmpXPeOp5cxkKA-d7MqROtaBwGM1DWNxI", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEEOuaOkDNHKA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=rP9rXenzwzSJD0NT3PQvK5Nzp1GMBaU_1WtHAPG7eOQ", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "USICE Agent / MDARNG Senior NCO - Instructor / DCJS-PSS PPS, PI", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I possess over ten years of law enforcement leadership and supervisory experience, gained through military and federal service.  I am a goal oriented individual, always seeking to obtain the next level of success both in my professional and personal life.  I enjoy seeing others grow and succeed, and facilitating other's success brings personal reward.  ", "pendingInvitation": false, "defaultPosition": {"posId": 1180165512, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I am currently serving as an expert on program and administrative policies and requirements.  I direct, coordinate, and control the execution of agency wide program activities by providing expert interpretation and application of law, regulations, and policy.  This is accomplished through developing investigative plans and conducting extensive field interviews of subjects and witnesses.  Additionally, I prepare written investigative reports in sufficient detail and accuracy to support possible administrative action by planning and conducting internal investigations into allegations of employee misconduct.  ", "location": "Washington D.C. Metro Area", "title": "USICE Agent (HQ)", "startedOn": {"month": 12, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Gerardo C.", "positions": [{"posId": 1180165512, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I am currently serving as an expert on program and administrative policies and requirements.  I direct, coordinate, and control the execution of agency wide program activities by providing expert interpretation and application of law, regulations, and policy.  This is accomplished through developing investigative plans and conducting extensive field interviews of subjects and witnesses.  Additionally, I prepare written investigative reports in sufficient detail and accuracy to support possible administrative action by planning and conducting internal investigations into allegations of employee misconduct.  ", "location": "Washington D.C. Metro Area", "title": "USICE Agent (HQ)", "startedOn": {"month": 12, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1037374307, "new": false, "current": true, "companyName": "Army National Guard", "description": "I provide small group technical development as a Instructor for the Basic Military Police Course.  This includes subject matter instruction on Military Law, Patrol Tactics and Techniques, Investigative Interviewing, Crime Scene Preservation, Battlefield Forensics, Firearms Handling and Shooting Techniques.  As a Non-Commissioned Officer, I ensure the welfare and wellbeing of subordinate Soldiers and maintain discipline and order by enforcing strict adherence to all military regulations and protocols. I set goals and priority time lines for team tasks to ensure completeness. I conduct team member performance evaluation, ratings, and counseling reports, noting soldier's strengths and weaknesses.", "location": "Baltimore, Maryland Area", "title": "NCO/Instructor - 70th Regiment (Regional Training Institute) Military Police Schoolhouse", "startedOn": {"month": 4, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:1226"}, {"posId": 1037393714, "new": false, "current": false, "endedOn": {"month": 12, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I am charged with ensuring the readiness and deployment status of the tactical team to include command and control of the team at all times during the deployment phase of a tactical operation.  Above all, I am charged with ensuring that all actions taken by the team are in accordance with all applicable laws, rules, regulations, directives, policies, and procedures.", "location": "San Antonio, Texas Area", "title": "Special Response Team Tactical Commander", "startedOn": {"month": 5, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1037374009, "new": false, "current": false, "endedOn": {"month": 12, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I am responsible for administrative and human resource management of staff, to include setting and adjusting short-term priorities and goals preparing schedules for completion of work within a multi-unit organization, and assigning work based on priorities.  I find ways to improve productivity and increase the quality of the work to ensure efficiency in the workplace.  I develop and maintain relationships with both internal and external stakeholders.  I draft responses for headquarters review on interagency and intra-agency inquiries based on federal laws, rules, regulations, policies and procedures.  I support the implementation of directives through dissemination of information regarding the impact of changes to policies, procedures, and organizational structure, and ensuring the implementation of the changes.  This includes the interpretation and application of policy and immigration law to all cases in administrative and enforcement actions.  I review case processing by subordinates to ensure adherence to immigration law and ICE policy, and provide guidance and feedback to subordinates in their processing of cases.  ", "location": "San Antonio, Texas Area", "title": "USICE Supervisory Agent", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1037560947, "new": false, "current": false, "endedOn": {"month": 5, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Served as a member of a team charged with the responsibility of carrying out the service of high-risk criminal warrants under hazardous conditions, escort dangerous criminal aliens, and assist local law enforcement agencies during critical incidents. Additionally, I have participated in protective security operations for foreign dignitaries during their visit to the United States. As a team, we are highly training in the service of criminal warrants, specializing in the use of diversionary devices and close quarter clearing techniques.", "location": "San Antonio, Texas Area", "title": "Special Response Team Operator", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1037562432, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I performed various segments of work related to immigration investigation, custody, identification and location, arrest, prosecution and deportation.  This included assisting with the apprehension of individuals that are accused of violating immigration or related laws; assisting with preparing investigative reports in sufficient detail and accuracy to support possible prosecution and/or administrative action; performing law enforcement support duties such as taking fingerprints and photographs; conducting routine interviews; using various law enforcement methods and techniques to respond to a variety of immigration inquiries and complaints; and documenting, transporting, deporting, and/or escorting criminal and non-criminal aliens.  Additionally, this included initiating both criminal and civil prosecutions and deporting aliens to foreign countries as well as performing various aspects of custodial operations related to civil immigration enforcement.\n", "location": "San Antonio, Texas Area", "title": "USICE Agent", "startedOn": {"month": 5, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1037380018, "new": false, "current": false, "endedOn": {"month": 5, "year": 2009}, "companyName": "Bexar County Sheriff Office", "description": "My primary duties as a Classification Officer, working in a third generation detention facility, included conducting interview upon offender's initial entry into the adult detention facility in order to\nmaximize pubic safety.  This was accomplished through the identification of individual offenders, by their criminal history or current behavior, who are likely to attempt escape from the facility, and who are prone toward violent or aggressive behavior towards staff, other inmates or themselves.\n\nAs a Deputy assigned to the Detention Division, I supervised and secured approximately 75 inmates in accordance with established policies, regulations and procedures by observing conduct and behavior of inmates to prevent disturbances and escapes.", "location": "San Antonio, Texas Area", "title": "Deputy - Classification Officer", "startedOn": {"month": 6, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:9153837"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Gerardo", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/gerardo-c-387538145", "location": "Washington D.C. Metro Area"}