{"lastName": "Grygo", "objectUrn": "urn:li:member:64890359", "contactInfo": {"websites": [{"category": "COMPANY", "dataSource": "LINKEDIN", "url": "http://www.ice.gov"}]}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2017}, "fieldsOfStudy": ["Cybersecurity"], "school": "urn:li:fs_salesSchool:18732", "degree": "Master of Science - MS", "schoolName": "Webster University", "startedOn": {"year": 2015}, "eduId": 380360862}, {"endedOn": {"year": 2013}, "fieldsOfStudy": ["International Relations"], "school": "urn:li:fs_salesSchool:18732", "degree": "Master of Business Administration (MBA)", "schoolName": "Webster University", "startedOn": {"year": 2011}, "eduId": 64149076}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["Social Psychology"], "school": "urn:li:fs_salesSchool:18706", "degree": "BS, Cum Laude", "schoolName": "Park University", "startedOn": {"year": 2007}, "eduId": 45871474}, {"endedOn": {"year": 2009}, "degree": "CI/HUMINT Operations Management Course (G2X)", "schoolName": "US Army Intelligence School, Fort Huachuca, AZ", "eduId": 63058543}, {"endedOn": {"year": 2003}, "schoolName": "Defense Strategic Debriefing Course, Fort Huachuca, AZ", "eduId": 58329441}, {"endedOn": {"year": 2003}, "degree": "Counterintelligence agent", "schoolName": "NMITC, Dam Neck, VA", "eduId": 63058760}, {"endedOn": {"year": 2000}, "fieldsOfStudy": ["Russian Language Studies"], "schoolName": "Linden & Denz, St. Petersburg, Russia", "startedOn": {"year": 2000}, "eduId": 111572879}, {"degree": "Interrogator", "schoolName": "NMITC, Dam Neck, VA", "startedOn": {"year": 1999}, "eduId": 63058754}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAPeJfcBbYqdu3qCUJZaDIGWX5f_yMuSQ6Q,NAME_SEARCH,undefined)", "numOfConnections": 530, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEqFEDeUjwofw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=UUEDJMIhdbG11zIRt40Q-q4xo64gUAS9fgNMvlT3CvA", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEqFEDeUjwofw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=AI_73SJQo4eQoDskVyYU3I9nXLBNL6_MS_1BHDlwfB8", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEqFEDeUjwofw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=qU25CefTRwirOtPphjMHCOIN2nEqZDTReXB7R3SzFi4", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEqFEDeUjwofw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=diwohWbA-hMosrgL253zK_PRqoYcYojRSKmKHAXSeK8", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Insightful manager and analyst with cybersecurity and international experience. Leader of culturally diverse teams", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Internationally accomplished executive with solid record of performance leading global development and integration of security strategies, to minimizes loses and liabilities. Experienced leader with proven track record leading ethnically and culturally diverse teams in challenging environments. Proficient in English, German, Russian, and Polish. Worked on six out of the seven continents.\n\nSpecialties: Cybersecurity, Counterintelligence (Insider Threat), Law Enforcement Analysis, Critical Infrastructure Protection, Open Source Intelligence, Supply Chain Risk Management & Threat Analysis.\n- Skilled investigator, debriefer, interviewer, and negotiator with Active SCI clearance and counterintelligence polygraph.\n- Proficient in Windows, Mac and Linux Operating environments, various office suites, and specialized law enforcement and intelligence databases.", "pendingInvitation": false, "defaultPosition": {"posId": 425658095, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington, DC", "title": "Senior Intelligence Research Specialist", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Michal Grygo", "positions": [{"posId": 425658095, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington, DC", "title": "Senior Intelligence Research Specialist", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 261908872, "new": false, "current": false, "endedOn": {"month": 4, "year": 2013}, "companyName": "JR Mannes", "description": "â\u0080¢ Written and coauthored major Risk Assessments and reports containing information involving sensitive, highly technical or abstract issues of considerable importance or consequence to the Secretary of DHS and cabinet level customers.\nâ\u0080¢ Conducted employee counterintelligence interviews and surveys designed to identify systemic or institutional vulnerabilities, with potential to contribute to the loss or compromise of critical assets or operations.\nâ\u0080¢ Conducted high-profile Threat Assessment and authored written reports of findings and analysis. Directly supported the Defense Critical Infrastructure Program (DCIP) efforts.\nâ\u0080¢ Conducted all source analysis by utilizing analytical techniques and research databases such as TAC, HOT-R, M3, WISE, WISE-ISM, TECS, LexisNexis, Digger, etc.\nâ\u0080¢ Facilitated collaboration between CIA, DoS, DIA, FBI, OICI and other members of the IC as well as Federal, State and Local Law Enforcement organizations; providing timely sharing of counterintelligence-related information and assistance.\nâ\u0080¢ Conducted in-depth research and data gathering activities; evaluating and interpreting collected data to identify foreign adversaries with the capability and intent to adversely affect critical assets of the US government. \nâ\u0080¢ Conferred with scientists, engineers, regulators, and others to plan and review projects and to provide technical assistance and intellectual property protection strategies. \nâ\u0080¢ Coordinated operations with counterparts from other government agencies in order to promote mutual cooperation and information sharing and efficiency.  \nâ\u0080¢ Assessed complex intelligence issues and improved collection and dissemination practices within the organization and partner organizations. \nâ\u0080¢  Prepared complex reports addressing multiple factors impacting counterintelligence operations.", "location": "Washington DC", "title": "DHS / Senior Counterintelligence Risk Researcher", "startedOn": {"month": 12, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1257602"}, {"posId": 181553004, "current": false, "endedOn": {"year": 2012}, "companyName": "J.R. Mannes Defense Services Corp.", "description": "â\u0080¢ Conducted DIA mandated travel briefs and debriefs for personnel traveling abroad.  \nâ\u0080¢ Evaluated and advised on Counterintelligence activities; identified DIAâ\u0080\u0099s vulnerabilities to foreign intelligence and security services deception and disinformation operations, and made recommendations to counter these threats.\nâ\u0080¢ Conducted CI threat vulnerability assessments and studies on the facilities designated as Critical under the Defense Critical Infrastructure Program (DCIP). \nâ\u0080¢ Identified significant Counterintelligence trends and proposed new or revised analytical efforts that alert leadership to developments.\nâ\u0080¢ Researched, analyzed and wrote Counterintelligence reviews.\nâ\u0080¢ Inputted wide variety of sources into coherent assessments; identified significant intelligence gaps, and coordinated collection requirements to meet current and anticipated intelligence needs. \nâ\u0080¢ Applied seasoned judgment and ingenuity to interpretation of information and provided recommendations or made decisions that affect Counterintelligence and security operations. \nâ\u0080¢ Prepared and presented formal and informal briefings to senior-level officials and groups. Identified lead for potential exploitation of known and suspected Foreign Intelligence Elements (FIE). \nâ\u0080¢ Interfaced with the Intelligence Community on transnational terrorism issues; developed and strengthened substantive ties with other government organizations, participated in conferences, meetings, joint exercises, and working groups. \nâ\u0080¢ Developed and maintained liaison with counterparts within the Agency, other national intelligence agencies, and components of U.S. commands to coordinate intelligence assessments.", "title": "DIA / Senior Analyst", "startedOn": {"year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1257602"}, {"posId": 111562493, "current": false, "endedOn": {"year": 2011}, "companyName": "US Marine Corps", "description": "â\u0080¢ Reviewed and/or independently performed risk analyses of all projected actions of the operation.\nâ\u0080¢ Participated in, and performed risk versus gain analyses and assessments of sensitive HUMINT and Counterintelligence activities based upon information potential, operational security concerns, and legal requirements. \nâ\u0080¢ Used cultural, military, political, and interrogation information to conduct CI operations and adjust operational focus as needed to identify and prioritize sources. \nâ\u0080¢ Prepared intelligence reports on information gathered, and prepared operational reports to document interrogation operations. \nâ\u0080¢ Identified strategic CI objectives at both the Combatant Command and Joint Staff levels; recommended viable courses of action to satisfy consumer requests for information and assistance.  \nâ\u0080¢ Identified issues relating to Counterintelligence collection plans policy and proposed and/or coordinated new or revised policy. Provided subject matter expertise and staff assistance required to incorporate CI input into operational and contingency planning process. \nâ\u0080¢ Lead or served as a senior HUMINT and Counterintelligence representative in working groups.", "title": "Company Chief, Senior CI Advisor", "startedOn": {"year": 2007}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 132589471, "current": false, "endedOn": {"year": 2007}, "companyName": "Defense Intelligence Agency", "description": "â\u0080¢ Deployed to Iraq and, Bosnia and Herzegovina, in support of Defense Intelligence Agency collection mission.\nâ\u0080¢ While deployed conducted over 200 interrogation and debriefings resulting in multiple raids and capture of high value targets.\nâ\u0080¢ Responsible for conducting substantive intelligence information liaison on behalf of the Agency, hosted and participates in conferences, meetings, exercises, and working groups.  \nâ\u0080¢ Represented Agency at official functions with foreign governments, and skillfully handled matters of etiquette and protocol for high-level delegations, diplomatic and information exchanges. \nâ\u0080¢ Enhanced, developed and maintained excellent relationships with host nation agencies and local business through extensive liaison, and aggressive networking, and used these relationships to develop new opportunities for intelligence gathering. \nâ\u0080¢ Reviewed customer evaluations of intelligence collection products from the field and provides direction/re-direction as necessary in accordance with DoD and National level requirements. \nâ\u0080¢ Managed relationships and communications within and external to the U.S. government to ensure national goals and strategies were supported. Ensured the proper coordination and deconfliction of numerous and complex or sensitive operational activities with the appropriate organizations and elements. \nâ\u0080¢ Maintained currency on validated collection and community requirements and priorities as established by national-level agencies and supported units and in accordance with the collectors' operating directives. \nâ\u0080¢ Worked in concert with collection management personnel to establish and evaluate operating directives. \nâ\u0080¢ Created and implemented security standards, policies, and procedures", "title": "Liaison/Reports Officer", "startedOn": {"year": 2004}, "companyUrn": "urn:li:fs_salesCompany:10268"}, {"posId": 132590351, "current": false, "endedOn": {"year": 2004}, "companyName": "US Marine Corps", "description": "â\u0080¢ Supervised, planed, organized, coordinated, and executed interrogation collection operations in response to tasked national and DoD priority requirements. \nâ\u0080¢ Provided guidance, recommendations, and maintained currency on validated collection requirements and priorities as established by national-level agencies and supported units. \nâ\u0080¢ Interpreted and evaluated information from multiple sources, and made recommendations based on findings. \nâ\u0080¢ Applied or adapted existing collection tradecraft, tools, and methods to develop new approaches to collection strategies. \nâ\u0080¢ Led discreet inquiries related to activities from known or suspected foreign intelligence and security service officers and agents. \nâ\u0080¢ Trained, built, mentored, and developed culturally and ethnically diverse teams. \nâ\u0080¢ Developed highly effective relationships with customers at all levels in order to develop mutually acceptable expectations. \nâ\u0080¢ Delivered information involving sensitive, highly technical or abstract problems or issues of considerable importance or consequence to internal and external stakeholders. \nâ\u0080¢ Identified significant trends within assigned area and proposed new projects to alert decision-makers to new developments.", "title": "HUMINT Intelligence collector and analyst - Iraq", "startedOn": {"year": 2003}, "companyUrn": "urn:li:fs_salesCompany:2039"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Michal", "numOfSharedConnections": 0, "memberBadges": {"premium": true, "openLink": true, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/michalgrygo", "location": "Washington D.C. Metro Area"}