{"objectUrn": "urn:li:member:360295983", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2013}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:32087", "degree": "Bachelor of Science (B.S.)", "schoolName": "Trident University International", "startedOn": {"year": 2011}, "eduId": 254193895}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABV5ri8BGj19QgW6c-F2iST8as1bUAUMSjM,NAME_SEARCH,undefined)", "numOfConnections": 95, "showTotalConnectionsPage": false, "headline": "Enforcement and Removal Assistant at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Over 24 years of proven successful management, leadership, and administration meeting the most challenging organizational goals and objectives with an energetic realistic approach. Highly adapt at managing employees in high stress, fast paced working environments. \n\nâ\u0080¢ Producing higher performance standards and enhancing productivity with decreased budgets.\nâ\u0080¢ Controlling growth management, by increasing productivity with current/ updated technical software programs. \nâ\u0080¢ Developing and implementing highly successful strategic plans (short and long term) that improved manpower management systems, maintenance management and professional / personal growth.\n\nExperience and Qualities include:\nOrganizational Leadership Strategic Planning Project Management\nChange/Crisis Management Problem Identification and Resolution Staff Development \nProgram Creation and Enhancement Motivation and Team Building Quality Assurance\nQuality Control Instructing and Public Speaking Conflict Resolution\nRecruiting, Staffing, and Training Networking and Public Relations Interagency Relations", "pendingInvitation": false, "defaultPosition": {"posId": 764772507, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "  Expertly analyzed over 1500 detained and non-detained cases; prioritized, identified and corrected errors and made exact decision in documentation and forwarding case to proper case agents to continue with administrative and removal proceeding with zero discrepancies.  \n\n-  Expertly worked cohesively and provided administrative and guidance support to managers, supervisors or staff members by assisting in the day-to-day management of the office's activities.   Identified and analyze short falls in tracking detainee documentation; implemented and created trackerâ\u0080\u0099s increased mission effectiveness.    \n\n-  Provided direct and continued assistance to U.S. Immigration and Customs Enforcement (ICE) personnel, and officials of other Federal agencies, in identifying individuals who pose a threat to national security and public safety.  Summarized and tabulate detainee information from various reports, utilizing a variety of databases and automated systems.  to include CIS, Claims, TECS, NCIC, and EARM.\n\n-  Expertly communicated orally with Deportation Officers to provide support and perform the following segments of work related to immigration investigation, custody, identification and location, prosecution and deportation of Aliens.  Expertly analyzed, identified and corrected errors and prepared over 700 removal cases with zero discrepancies.  Administratively, initiated both criminal and civil prosecutions and deport aliens to foreign countries as well as performing various aspects of custodial operations related to civil immigration enforcement.\n\n- Generated and verify detainer reports, encounters, charging documents, studies, data quality and create and revise spreadsheets, charts, graphs, and presentations; and exercises quality control over bond paperwork requiring no supervision.   Researched, interpret and apply appropriate statutes, regulations and documenting to charging documents and databases to ensure appropriate documents are processed.  ", "location": "Greater San Diego Area", "title": "Enforcement and Removal Assistant", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 764772507, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "  Expertly analyzed over 1500 detained and non-detained cases; prioritized, identified and corrected errors and made exact decision in documentation and forwarding case to proper case agents to continue with administrative and removal proceeding with zero discrepancies.  \n\n-  Expertly worked cohesively and provided administrative and guidance support to managers, supervisors or staff members by assisting in the day-to-day management of the office's activities.   Identified and analyze short falls in tracking detainee documentation; implemented and created trackerâ\u0080\u0099s increased mission effectiveness.    \n\n-  Provided direct and continued assistance to U.S. Immigration and Customs Enforcement (ICE) personnel, and officials of other Federal agencies, in identifying individuals who pose a threat to national security and public safety.  Summarized and tabulate detainee information from various reports, utilizing a variety of databases and automated systems.  to include CIS, Claims, TECS, NCIC, and EARM.\n\n-  Expertly communicated orally with Deportation Officers to provide support and perform the following segments of work related to immigration investigation, custody, identification and location, prosecution and deportation of Aliens.  Expertly analyzed, identified and corrected errors and prepared over 700 removal cases with zero discrepancies.  Administratively, initiated both criminal and civil prosecutions and deport aliens to foreign countries as well as performing various aspects of custodial operations related to civil immigration enforcement.\n\n- Generated and verify detainer reports, encounters, charging documents, studies, data quality and create and revise spreadsheets, charts, graphs, and presentations; and exercises quality control over bond paperwork requiring no supervision.   Researched, interpret and apply appropriate statutes, regulations and documenting to charging documents and databases to ensure appropriate documents are processed.  ", "location": "Greater San Diego Area", "title": "Enforcement and Removal Assistant", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 615351429, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "US NAVY", "description": "As Anti-terrorism Training Supervisor Instructor, I meticulously organized, coordinated and scheduled 6 Ship's Reactionary Force Basic (SRFB) Academies with multiple departments.  In addition, I effectively supervised and work cohesively with four Anti-terrorism Training Team Instructors to conduct the Academies. SRFB training as follows; Use of Deadly Force, Oleoresin Capsicum Deployment (OC Spray), Small Arms Handling Procedures, Proper Watch Standing, Handcuffing, Close Range Subject Controls, Mechanical Advance Control Holds, Vehicle Inspections, Tactical Movements and proper Room Entry procedures; resulting in the qualification over 200 personnel with zero mishaps increasing mission capability.   Identified discrepancies within the course; revamped the course curriculum by adding and removing outdated and unnecessary training which increased personnel training capabilities, reduced cost measures, balance priorities and conflicting demands by several departments within the Command.  \n\n- Expertly analyzed and conducted audits of Shipboards' Anti-terrorism programs; reviewing documentations of training programs, Inventory of Anti-terrorism equipment and small-arms qualifications.   Interviewed and gathered evidence and effectively communicated orally and in writing to executive managers to recommend various solutions in tracking, documentation, qualification schedules and inventory management significantly enhancing their program exceeding Department of Defense requirements.\n\n- Conducted Anti-terrorism and Force protection training and certification to 18 crews consisting of 550 personnel.  Provided guidance and best practices to safely manage all incidents which was lauded by their Chain of Command.   \n\n- Shift Supervisor for over 25 employees in providing safety and security to Command.   ", "location": "Naval Station San Diego California", "title": "Anti-Terrorism Training Supervisor", "startedOn": {"month": 11, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 615355127, "new": false, "current": false, "endedOn": {"month": 11, "year": 2013}, "companyName": "US NAVY", "description": "â\u0080¢\tAssigned to Naval Base Guam, Police Department as the Operations Manager; effectively managed and provided technical supervision of over 232 military and civilian employees; ensuring all were trained in various facets of Anti-terrorism, Force Protection, Law Enforcement and Investigations ensuring compliance with DoD regulations in providing the highest service to over 10,000 military and civilian personnel. Provided appropriate guidance and technical advice to executive level managers.\n\nâ\u0080¢\tEvaluated the performance of subordinate military and civilian employees, recommended awards, approved leave and reviewed position descriptions for accuracy.\n \nâ\u0080¢\tMade exact decisions on training needs and problems for both civilian and military personnel, consulting with training specialist when needed. Found and have implemented ways to eliminate or reduce significant bottlenecks and barriers to efficiency, promoted team building and improved business practices. Defined training goals and objectives and communicated them to ensure the overall quality of the Security Department training program.\n \nâ\u0080¢\tAdministered policy direction and supervision of personnel with full accountability for the effectiveness of all systems and operations, providing guidance to subordinates concerning the nature and purpose of major work tasks and applicable regulations, via the chain of command. \n\nâ\u0080¢\tPlanned and developed goals and objectives of the Department based on needs determined from studies and established guidelines. Reviewed and prepared station law enforcement and physical security directives and regulations pertaining to overall protection of life and property.", "location": "Santa Rita Guam", "title": "Police Department Operations Manager", "startedOn": {"month": 7, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 615352740, "new": false, "current": false, "endedOn": {"month": 7, "year": 2010}, "companyName": "US Navy", "description": "â\u0080¢\tAssigned to Naval Hospital Pensacola, Florida.  Managed the daily and professional development of 40 military human resource managers, providing customer service to over 1200 U.S. Navy personnel assigned to military commands increasing advancement and retention. \n\nâ\u0080¢\tPerformed recruitment duties, including understaffing, mediating disputes, termination of employees, and administering disciplinary procedures.\n\nâ\u0080¢\tResponsible for the collection and interpretation of daily, monthly, and quarterly retention/professional development reports to identify manning shortfalls and training needs. \n\nâ\u0080¢\tExpert trainer with 150 hours of group presentations of retention, career development, human resource initiatives, issues, and programs.\n\nâ\u0080¢\tProvided updates and advised senior management on company performance goals. \n\nâ\u0080¢\tProvided appropriate guidance and technical advice to the Commanding Officer and during crisis, which related to law enforcement, physical security and anti-terrorism.  \n\nâ\u0080¢\tAnalyzed and evaluated security operations to identify risk or opportunities for improvement.\nâ\u0080¢\tCollected and analyzed security data to determine security needs, security programs goals and program accomplishments increasing safety and security to the Hospital.  \n\nâ\u0080¢\tParticipated with subordinates and supervisors on all matters regarding the Hospitals' law enforcement, physical security and anti-terrorism programs to include the formulation of policy, accountability of command property, preparation of security department instructions, standing orders and special orders, directing the utilization of personnel and resources, and conducting statistical presentations. \n\nâ\u0080¢\tExpertly utilized one or more automated databases associated with a specific security function to the recognizing, locating, and inserting pertinent data information, support office and security operations.  In addition, creating and updating automated entries in support of human resource career programs for over 1200 personnel.", "title": "Human Resource Officer and Anti-Terrorism Officer", "startedOn": {"month": 5, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 702420792, "new": false, "current": false, "endedOn": {"month": 5, "year": 2008}, "companyName": "US Navy", "description": "â\u0080¢\tAssigned to Naval Base Guam, Security Department.  Effectively managed the maintenance and the upkeep of 8 Patrol Boats.  Trained and qualified 34 personnel in maritime laws and regulations, Rules of the Road and Harbor Police Boat operations.  Managed $1.3M repair and procurement budget without discrepancy.  Recognized by higher headquarters program directors as the Navy program to emulate.\n\nâ\u0080¢\tSelected as Patrol Operations supervisor where I effectively managed and was responsible for over 184 Military and DoD Police Officer.  Provided technical supervision all work and personnel assigned to the Operation Division who perform physical security, anti-terrorism, force protection, security operations and law enforcement duties.\n\nâ\u0080¢\tProvided sound guidance to a staff of 15 military and civilianâ\u0080\u0099s supervisor regarding daily operations and administrative matters for an extremely demanding Department. \n\nâ\u0080¢\tReviewed, corrected, approved and submitted approximately 150 Incident Complaints reports ranging from Driving Under the Influence to Aggravated Assaults to Base Legal Department. \n\nâ\u0080¢\tProvided mentorship to both military and civilian regarding their personal and professional growth resulting enhancing moral, retentions and promotions.  \n\nâ\u0080¢\tDeveloped and submitted a variety of general information based, and formal technical reports to senior management staff within required periods.\n\nâ\u0080¢\tVolunteered to deploy to Guantanamo Bay, Cuba for 218 days as a Correctional Officer Supervisor.  Led, managed, and provided sound guidance to 70 Sailors, in all job fields, in delivering safe and humane care and custody of more than 170 detained enemy combatants (inmates).", "location": "Santa Rita, Guam", "title": "Harbor Patrol Supervisor, Police Department Supervisor and Correctional Officer Supervisor", "startedOn": {"month": 1, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 702454920, "new": false, "current": false, "endedOn": {"month": 1, "year": 2005}, "companyName": "US NAVY", "description": "- As Watch Commander, I effectively supervised 50 Military and DoD Police Officers to provide Law Enforcement, Physical Security, Anti-terrorism and Force Protection duties.\n\n- Ensured all assigned Police Officers within shift received proper training and equipment to performed their duties.\n\n- Responded and assumed Incident Commander of calls-for-services such as Bomb Threat to death scenes.  In addition, I provided sound guidance to Patrol Officers in properly handling over 70 calls for service and coordinated support and or assistance with other law enforcement agencies official in accordance within policies and regulation as applies.  \n\n- Authored, reviewed, corrected, approved and submitted over 100 Incident Complaint Reports ranging from Driving Under the Influence to Death incidents.\n\n- Evaluated the performance of subordinate civilian and military employees, recommended awards,\napproved leave request. \n\n- Provided appropriate guidance and technical advice to executive and command level managers  during crisis which related to law enforcement, physical security and anti-terrorism. \n\n- Reviewed and ensured proper identification, documentation, collection, preservation, and transportation of physical evidence with no discrepancy.", "location": "Naval Station Mayport, Florida", "title": "Police Department Shift Supervisor (Watch Commander)", "startedOn": {"month": 12, "year": 2001}, "companyUrn": "urn:li:fs_salesCompany:1335"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/gary-dedios-7537b4a0", "location": "Greater San Diego Area"}