{"lastName": "Aitken", "objectUrn": "urn:li:member:81474685", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1991}, "fieldsOfStudy": ["Criminal Justice/Law Enforcement Administration"], "school": "urn:li:fs_salesSchool:17828", "degree": "Bachelorâ\u0080\u0099s Degree", "schoolName": "California State University-Long Beach", "startedOn": {"year": 1989}, "eduId": 307928759}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAATbNH0B6NJ05LN_x57pt5ZL9nt1CVxvHQo,NAME_SEARCH,undefined)", "numOfConnections": 334, "showTotalConnectionsPage": false, "headline": "Field Office Director at Immigration and Customs Enforcement", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I have over 26 years of federal law enforcement experience. I am highly skilled in leading and executing complex and multi-disciplinary law enforcement projects at all organizational levels to include building a corporate culture that strives for results, serves customers, and builds successful teams and coalitions within and outside the organization.  I have been successful in my career due to my effective communication skills and liaison abilities with a multitude of law enforcement agencies and governmental institutions.\n", "pendingInvitation": false, "defaultPosition": {"posId": 740783378, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As the Field Office Director for Immigration and Customs Enforcement (ICE), Enforcement and Removal Operations (ERO) in San Francisco, CA, I am responsible for promoting public safety and national security by maintaining direct oversight of critical ICE programs and operations to identify, locate, arrest, detain, and remove criminal aliens from the United States. The San Francisco Field Office Area of Responsibility (AOR) which covers 49 of the 58 counties in California and eight sub-offices located in Bakersfield, Stockton, Sacramento, Fresno, San Jose, Hawaii, Guam and Saipan. \n\nI am responsible for establishing and maintaining effective working relationships with various high-level individuals, including Members of Congress and their staff, other legislative and executive agencies, executives of major corporations, and distinguished members of the public. I maintain close and cooperative working relationships with senior agency officials, government agencies, and other institutions with related interests, in order to advance the programs and objectives of ICE and ERO. On a daily basis, I work closely and collaboratively with other law enforcement officials at the highest levels of Federal, State, and local governments, as well as intelligence organizations, international law enforcement entities and foreign governments.\n", "location": "San Francisco", "title": "Field Office Director", "startedOn": {"month": 3, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Timothy Aitken", "positions": [{"posId": 740783378, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As the Field Office Director for Immigration and Customs Enforcement (ICE), Enforcement and Removal Operations (ERO) in San Francisco, CA, I am responsible for promoting public safety and national security by maintaining direct oversight of critical ICE programs and operations to identify, locate, arrest, detain, and remove criminal aliens from the United States. The San Francisco Field Office Area of Responsibility (AOR) which covers 49 of the 58 counties in California and eight sub-offices located in Bakersfield, Stockton, Sacramento, Fresno, San Jose, Hawaii, Guam and Saipan. \n\nI am responsible for establishing and maintaining effective working relationships with various high-level individuals, including Members of Congress and their staff, other legislative and executive agencies, executives of major corporations, and distinguished members of the public. I maintain close and cooperative working relationships with senior agency officials, government agencies, and other institutions with related interests, in order to advance the programs and objectives of ICE and ERO. On a daily basis, I work closely and collaboratively with other law enforcement officials at the highest levels of Federal, State, and local governments, as well as intelligence organizations, international law enforcement entities and foreign governments.\n", "location": "San Francisco", "title": "Field Office Director", "startedOn": {"month": 3, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 740382349, "new": false, "current": false, "endedOn": {"month": 2, "year": 2009}, "companyName": "Immigration and Customs Enforcement", "description": "Responsible for the daily operations and direction of the Detention and Removal with the Field Office Area of Responsibility. This included direct oversight of the San Francisco Field Office, Honolulu Office, and the following sub-offices: Salt Lake City, Reno, Bakersfield, Fresno, Sacramento, Stockton, San Jose, Honolulu, Guam and Saipan. \n\nEstablished and fostered productive working relationships with the other ICE law enforcement components as well as other local, state and federal agencies to direct, coordinate, and execute several high profile operations of national impact such as Operation Predator and the National Fugitive Operations Program.\n\nManaged law enforcement activities through subordinate supervisors who supervised enforcement and non-enforcement employees involved in performing activities such as fugitive operations, detention case management, foreign removals, and transportation of detainees, food service, fleet management and Institutional Removal Program", "location": "San Francisco", "title": "Deputy Field Office Director", "startedOn": {"month": 3, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 740781913, "new": false, "current": false, "endedOn": {"month": 3, "year": 2003}, "companyName": "U.S.Immigration and Naturalization Service", "description": "Responsible for the day-to-day operations and direction of the Detention and Removal activities within the district. Provided technical and management oversight and supervision for over 95 employees including nine supervisors. Responsible for coordinating Detention and Removal activities with other district offices and the regional office. Managed resources by monitoring and analyzing all personnel, financial, and resources needed to ensure that daily operations accomplished the goals and the mission of the Service. Issued Notices to Appear, subpoenas for immigration violations, warrants of removal, and other removal related documents.  Adjudicated Stay of Deportation cases and exercised prosecutorial discretion when appropriate. \n\n \n", "location": "San Francisco", "title": "Deputy Assistant District Director for Detention and Deportation", "startedOn": {"month": 8, "year": 2000}}, {"posId": 740784897, "new": false, "current": false, "endedOn": {"month": 8, "year": 2000}, "companyName": "U.S. Immigration and Naturalization Service", "description": "Responsible for the operation and management of the San Pedro Processing Center, which operated twenty-four hours a day, seven days a week. \n\nPlanned, coordinated and directed the various departments all functions and activities of the Detention Branch, Deportation Branch, Administrative Support Unit, Food Service, Public Health Service and Facility Engineering\n. \nResponsible for the safety and security of 265 employees and over 500 detainees. Responsible for ensuring that all officers operated within their respective scope of authority under the Immigration and Nationality Act and Service regulations and policy. \n \nResponsible for the management of all detention functions within the Service Processing Center (SPC). Possessed a comprehensive knowledge of the Service's Detention Standards, applicable laws, court decisions, and regulations pertaining to the detention of undocumented aliens.  \n", "location": "San Pedro Processing Center, San Pedro, CA", "title": "Officer In Charge", "startedOn": {"month": 1, "year": 2000}}, {"posId": 740786409, "new": false, "current": false, "endedOn": {"month": 1, "year": 2000}, "companyName": "U.S. Immigration and Naturalization Service", "description": "\nResponsible for the management of the Los Angeles Staging Facility. This included the direct supervision of six Deportation Officers, five docket clerks, one Chief Detention Enforcement Officer, two Detention Operation Supervisors, and one Public Health Service Nurse. \n\nSupervised 70 full time Service employees and five contract security personnel. \n\nPerformed budget execution and the projection of long term budgetary, procurement, and staffing needs for the Staging Facility. The Los Angeles Staging Facility had an average daily population of approximately 200 detainees. \n\nEnsured the enforcement of all relevant statutes and regulations pertaining to the enforcement of the Immigration and Nationality Act. \n", "location": "Los Angeles", "title": "Supervisory Detention and Deportation Officer", "startedOn": {"month": 1, "year": 1998}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Timothy", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/timothy-aitken-85135123", "location": "San Francisco Bay Area"}