{"lastName": "Fellenz", "objectUrn": "urn:li:member:48216027", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2011}, "fieldsOfStudy": ["Political Science. History"], "degree": "B.A.", "schoolName": "Northwestern University", "startedOn": {"year": 2007}, "eduId": 34442471}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAALft9sB5KxEQiP3Ni25K4HKRzPfD8ygzYQ,NAME_SEARCH,undefined)", "numOfConnections": 361, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFwzrSh4QyAJQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=EPK8lYaTb35uOzW7WiDwGkUMtAlpbYpl3pYlC10ECBY", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFwzrSh4QyAJQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=SifrY6Ob5DfeQu73gCCi_og6Kxz-94bbDyeTFfJdrYk", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFwzrSh4QyAJQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=atbZVZZOFo39AH3Ld4im6zzVipG3B2Be9NwLK674ZzA", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFwzrSh4QyAJQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=T78XEo6c2XQilFULpNWNM4E9Hp5RTMVbPfN20gLFZVk", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Immigration and Customs Enforcement", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "After graduating from Northwestern University's Weinberg College of Arts and Sciences with a degree in Political Science and History, I went to work serving the American people with the Department of Homeland Security. Although I had never before lived west of the Mississippi, I accepted an assignment to the Port of San Ysidro, California, for Customs and Border Protection with only a sense of adventure and a desire to protect and improve our country. I spent two years on the front line of America's Border Security apparatus, apprehending people attempting to illegally or improperly enter the United States, and interdicting drugs, agricultural pests, and other harmful items as they crossed the border.\n\nI was then afforded the opportunity to serve in a different role in our wide reaching mission to secure America's Homeland. I moved back across the country to northern Vermont and came on board with Immigration and Customs Enforcement. I incorporated my experience on the border into my new role with the Targeting Operations Division within ICE/Enforcement and Removal Operations. Serving in the Communications Section, I responded to various requests from law enforcement agencies inquiring into a subject's immigration status in the United States and referring criminal aliens or subjects of concern to immigration authorities. Concurrently, as an ICE Headquarters component, I was involved in various aspects of ICE cases and policy development.\n\nAs of February 2017, I accepted an opportunity to return to the field and actively engage in law enforcement operations. I am currently in training for this position through June, at which point I will be posted to the St. Paul Field Office in Minnesota.", "pendingInvitation": false, "defaultPosition": {"posId": 941742027, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Greater Minneapolis-St. Paul Area", "title": "Deportation Officer", "startedOn": {"month": 2, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Peter Fellenz", "positions": [{"posId": 941742027, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Greater Minneapolis-St. Paul Area", "title": "Deportation Officer", "startedOn": {"month": 2, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 568703214, "new": false, "current": false, "endedOn": {"month": 1, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "The Law Enforcement Support Center is a national enforcement operations facility administered by U.S. Immigration and Customs Enforcement (ICE), the largest investigative agency in the Department of Homeland Security (DHS). The center is a single national point of contact that provides timely immigration status, identity information, and real-time assistance to local, state, and federal law enforcement agencies on aliens suspected, arrested, or convicted of criminal activity. The center protects and defends the United States by sharing timely and relevant ICE information with our law enforcement partners around the world.", "location": "Williston, VT", "title": "Law Enforcement Specialist - Communications Section", "startedOn": {"month": 7, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 270844913, "new": false, "current": false, "endedOn": {"month": 7, "year": 2014}, "companyName": "U.S. Customs and Border Protection", "description": "CBP's priority mission is to prevent terrorists and terrorist weapons from entering the United States and ensuring the security of our nation at America's borders and ports of entry. We must maintain this line of defense while allowing legitimate travel and trade that is vital to our economy and way of life.\n\nCBP is responsible for apprehending individuals attempting to enter the United States illegally; stemming the flow of illegal drugs and other contraband; protecting our agricultural and economic interests from harmful pests and diseases; protecting American businesses from theft of their intellectual property; and regulating and facilitating international trade, collecting import duties, and enforcing U.S. trade laws.", "location": "San Diego, CA", "title": "CBP Officer", "startedOn": {"month": 3, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:2997"}, {"posId": 239940345, "new": false, "current": false, "endedOn": {"month": 3, "year": 2012}, "companyName": "The Fellenz Family Farm", "description": "Create accounting systems to allow for detailed real-time reporting and analysis, granting greater managerial control over business processes and enhancing decision-making abilities.\nDevelop strategies for growth into new markets by minimizing and understanding risks, maximizing potential, and ensuring coherent implementation of business plans into sound tactical management.", "location": "Phelps, NY", "title": "Business Consultant", "startedOn": {"month": 10, "year": 2011}}, {"posId": 78672785, "new": false, "current": false, "endedOn": {"month": 6, "year": 2011}, "companyName": "Kellogg School of Management", "description": "Provided technical support to MBA students â\u0080\u0093 attained advanced troubleshooting skills on a diverse set of systems and delivered high-quality customer service.\nTrained consultants as they were on-boarded, served as a mentor and senior consultant advising my colleagues on technical and policy questions.\nContributed to technical and policy documentation for both internal and external audiences.\nAssisted in developing technical policies and standards to best serve student IT needs.", "location": "Evanston, IL", "title": "IT Consultant", "startedOn": {"month": 10, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:3195"}, {"posId": 159889537, "new": false, "current": false, "endedOn": {"month": 5, "year": 2011}, "companyName": "NUsolar", "description": "The solar powered racing team at Northwestern University is an undergraduate student group which designs, builds, and operates custom solar-powered racing vehicles.  The team is dedicated to improving the education of our members through experiential and project-based learning in a real-world setting, and to increase public awareness of alternative energy, advanced engineering, and green technology.\n\nDeveloped and maintained project plans to ensure optimal operational efficiency of all project areas, ensuring integration of engineering, operations, and business strategies.\nSupervised and managed day-to-day operations, made real time decisions to guarantee effective functioning.\nEnsured compliance with all rules and regulations through regular consultations with university administrators, faculty advisors, and event directors.", "location": "Evanston, IL", "title": "Project Manager", "startedOn": {"month": 6, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:1460608"}, {"posId": 221060378, "new": false, "current": false, "endedOn": {"month": 3, "year": 2011}, "companyName": "NUsolar", "description": "Responsible for managing public image of the project by crafting unified branding and marketing materials and ensuring effective implementation and consistent messaging.\nCoordinated all public appearances to ensure maximum benefit and exposure for the project team â\u0080\u0093 for both sponsorship and public education considerations.\nManaged media relations with university and off-campus outlets, had responsibility for approving press materials and publications for public consumption.", "location": "Evanston, IL", "title": "Public Relations and Outreach Coordinator", "startedOn": {"month": 4, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:1460608"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Peter", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/peterfellenz", "location": "Greater Minneapolis-St. Paul Area"}