{"lastName": "Nugent", "objectUrn": "urn:li:member:583112364", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"fieldsOfStudy": ["Ph.D. Program, Research Methodology Coursework"], "school": "urn:li:fs_salesSchool:18422", "schoolName": "Louisiana State University", "eduId": 437312114}, {"fieldsOfStudy": ["Curriculum | Instructional | Ed. Technology"], "school": "urn:li:fs_salesSchool:18435", "degree": "Master of Education - MEd", "schoolName": "Southeastern Louisiana University", "eduId": 437312121}, {"fieldsOfStudy": ["Major: Political Science, Minor: History"], "school": "urn:li:fs_salesSchool:18445", "degree": "Bachelor of Arts - BA", "schoolName": "University of New Orleans", "eduId": 437313141}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAACLBlqwBmH_jKtvaFI9nwQiusIyzgL4-yxA,NAME_SEARCH,undefined)", "numOfConnections": 79, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGTkSBHw5uMFQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=ii8wLFJmsXhaeSxRW_VJV7-8Ugd8x-hDI7oUX7MfZjY", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGTkSBHw5uMFQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=ABR83f6ylEY41gOdtocasiv_uLLAZ8hIkgUS-NYVh4k", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGTkSBHw5uMFQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=Vp-qxFfZYlr3dwTsnssdcNzpholHE8eBMpoUrrHDEFc", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGTkSBHw5uMFQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=RnahPnHJ-iu0dDJL_OQutctysZg6zfMbE2lUaU-uKbs", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Supervisory Detention and Deportation Officer at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Offers extensive experience in program management, program implementation, administration, team leadership, training, deportation proceedings, policy design, court testimony, fugitive/suspect apprehension, case management, application processing, human resources, EEO, performance evaluation, research, analysis, investigations, technical expertise, conference representation, relationship building, government operations, border patrol, briefings, precedent decisions, immigration, illegal aliens, law enforcement, removal activities, operations management, qualitative/quantitative analysis, assessment, homeland security, government operations, customs, ICE, ERO, field office management, detention, federal agency collaboration, report generation, problem solving, project management and communication. Outstanding abilities in customer service, professionalism, and fostering teamwork. Demonstrated success as an independent achiever.", "pendingInvitation": false, "defaultPosition": {"posId": 1019659719, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Deliver exemplary team leadership and training based on knowledge and skills. Perform segregation reviews and review grievances. Serve as the LGBTI and sex offender liaison for the Phoenix Field Office. Approve, reject or amend subordinate case work, and evaluate for quality and thoroughness in addition to providing feedback. Establish measurable team goals and mentor staff toward successful completion. Identify training needs. Perform human resource management and administrative functions. Further the goals of Equal Employment Opportunity (EEO) by taking positive steps to assure the accomplishment of EEO objectives, and by adhering to nondiscriminatory employment practices in regard to race, color, religion, sex, national origin, age or handicap. \n\nSupervise Criminal Alien Program, Law Enforcement Agency Response, detained docket, bonds, paroles, post-order custody review, travel and compliance staff.\n\nConduct case management training for al single-career track and border patrol transfers.\n\nServe as supervisor of the Victim/Witness notification program.\n\nServe as Team Lead for ERO 2.0 efficiency operation.\n\t\nCollaborate with the contractor safety officer to ensure a safe environment for staff, visitors and detainees. Deliver clear and concise communication to ensure comprehension by a diverse audience. Established positive working relationships with all stakeholders. Serve as a technical expert and liaison in developing and maintaining relationships with various stakeholders in the federal government. \n\nInvestigated and completed management referrals on Prison Rape Elimination Act, use of force and sensitive matters. Deliver expertise in reviewing and recommending judgments on applications for Stays of Deportation, ascertaining all decisions based upon the appropriate exercise of discretion within policy guidelines, meeting the requirement of prior precedent decisions, and being defensible upon appeal to courts. ", "location": "Phoenix, AZ ", "title": "Supervisory Detention and Deportation Officer", "startedOn": {"month": 2, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Samuel Nugent", "positions": [{"posId": 1019659719, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Deliver exemplary team leadership and training based on knowledge and skills. Perform segregation reviews and review grievances. Serve as the LGBTI and sex offender liaison for the Phoenix Field Office. Approve, reject or amend subordinate case work, and evaluate for quality and thoroughness in addition to providing feedback. Establish measurable team goals and mentor staff toward successful completion. Identify training needs. Perform human resource management and administrative functions. Further the goals of Equal Employment Opportunity (EEO) by taking positive steps to assure the accomplishment of EEO objectives, and by adhering to nondiscriminatory employment practices in regard to race, color, religion, sex, national origin, age or handicap. \n\nSupervise Criminal Alien Program, Law Enforcement Agency Response, detained docket, bonds, paroles, post-order custody review, travel and compliance staff.\n\nConduct case management training for al single-career track and border patrol transfers.\n\nServe as supervisor of the Victim/Witness notification program.\n\nServe as Team Lead for ERO 2.0 efficiency operation.\n\t\nCollaborate with the contractor safety officer to ensure a safe environment for staff, visitors and detainees. Deliver clear and concise communication to ensure comprehension by a diverse audience. Established positive working relationships with all stakeholders. Serve as a technical expert and liaison in developing and maintaining relationships with various stakeholders in the federal government. \n\nInvestigated and completed management referrals on Prison Rape Elimination Act, use of force and sensitive matters. Deliver expertise in reviewing and recommending judgments on applications for Stays of Deportation, ascertaining all decisions based upon the appropriate exercise of discretion within policy guidelines, meeting the requirement of prior precedent decisions, and being defensible upon appeal to courts. ", "location": "Phoenix, AZ ", "title": "Supervisory Detention and Deportation Officer", "startedOn": {"month": 2, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1036489914, "new": false, "current": false, "endedOn": {"month": 2, "year": 2015}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Successfully implemented agency-wide programs, providing oversight to ensure compliance. Supervised information disclosure portfolios (U.S. Government Accountability Office, Office of Inspector General, Civil Rights Civil Liberties, Freedom of Information Act, litigation, records management, congressional relations, communications, OPR audits, self-inspection and Joint Intake Center referrals). Set the tone for optimal customer service.\n\nRepresented ICE at FEMA headquarters during the juvenile crisis, coordinating with dozens of agencies and components, and briefing senior White House staff. \n\nProvided valuable contributions within the Alien Sex Offender Tracking Group, establishing relationships with Department of Justice Office of Justice Programs and the Office of Sex Offender Sentencing, Monitoring Apprehending, Registering and Tracking Office, resulting in improved technological processes for ICE sex offender notifications.\n\nDeveloped a new program to track, investigate and report of hundreds of Office of Inspector General complaints not meeting the threshold of a management referral. \n\t\nDelivered outstanding leadership to subordinate staff. Directed knowledge management, including inSight and SharePoint collaboration. Evaluated and interviewed candidates for positions up to the GS-14 level. \n\nReceived a promotion to Unit Chief over the Executive Information and Reporting Unit in Feb 2013. \n\nDetailed to Harlingen, Texas to supervise 20+ officers and staff working around the clock in multiple locations in support of the Unaccompanied Alien Child crisis in the Rio Grande Valley, establishing strong relationships and improved travel processes within ICE/ERO, Customs and Border Protection and Health and Human Services. \n\nSupervised up to 25 team members as warranted, documenting and proposing disciplinary actions on subordinates as necessary and following up with corrective action. ", "location": "Washington D.C. Metro Area", "title": "Section | Unit Chief, Executive Information and Reporting Unit", "startedOn": {"month": 10, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1036493857, "current": false, "endedOn": {"year": 2013}, "companyName": "US Navy Reserve", "description": "Served as the Operations Officer for a 33-person reserve unit supporting the National Naval Medical Center, and planned, approved and directed operational training.\n\nLed security teams in Bahrain and Morocco on shore and at sea aboard the USNS Comfort.\n\nSupported humanitarian operations in Panama, Costa Rica and Haiti.\n\nDeveloped and updated a $100K+ monthly unit budget.\n\nDeployed for one year in support of Operation Iraqi Freedom, supervising guard force in a theatre internment facility holding nearly 5K Sunni and Shia detainees.", "location": "Washington, Naval Yard | Bethesda Medical Center, MD", "title": "Petty Officer First Class", "startedOn": {"year": 2005}, "companyUrn": "urn:li:fs_salesCompany:1333"}, {"posId": 1036492522, "new": false, "current": false, "endedOn": {"month": 10, "year": 2011}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Developed and managed the national rollout of the ICE Expedited Removal Program. \n\nEstablished liaison between ICE Privacy and Records and ERO.\n\nLed SharePoint implementation and mentored senior staff on increasing productivity and coordination.\n\nConducted file reviews and briefings on detained cases in response to litigation.\n\nLiaised between contract policy staff and field and headquarters government staff.\n\nReviewed and updated policy documents and organization on contract software, including improving organizational structure and search results.\n\nProvided outstanding service in the Taskings and Correspondence Unit. \n\nRepresented ICE/ERO at the National Sheriffâ\u0080\u0099s Association annual conference.\n\nServed as the primary ERO representative to ODPP and ICE Policy during the compilation and writing of the 2011 Performance Based National Detention Standards.\n\nRepresented ERO on cross-divisional policy and guidance. \n\nCompleted detail to ICE Policy to represent ERO interests and mentor with senior policy analysts.\n\nRepresented ERO at meetings with CBP and USCIS policy and forms representatives.\n\nDelivered clear written and verbal communication to a diverse audience. Authored, edited and reviewed ICE policies introduced during tenure. \n\nDrafted and edited responses to Congressional, Non-Governmental Organizations and media inquiries.", "location": "Washington D.C. Metro Area", "title": "Detention and Deportation Officer", "startedOn": {"month": 12, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1036492613, "new": false, "current": false, "endedOn": {"month": 12, "year": 2008}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Successfully engaged in Criminal Alien Program, suspect prosecution and fugitive operations as the team leader. Arrested priority aliens as dictated by federal law, regulations and policies. Swore out criminal warrants before federal magistrates. Testified before federal grand juries.\n\nConducted surveillance and street arrests.\n\nArrested removable aliens at court houses.\n\nReleased eligible aliens on Orders of Release on Recognizance or Orders of Supervision.\n\nReceived aliens upon check-in, ran database record checks, applied for and obtained travel documents for removal.\n\nEscorted aliens in vehicles and aircraft both within the United States and abroad.\n\nEstablished the Fraud Detection and National Security liaison program in collaboration with United States Citizenship and Immigration Services, resulting in multiple new removal proceedings involving criminal aliens. \n\nIssued and canceled cash and surety bonds.\n\nInterviewed aliens arrested by local law enforcement and determined alienage and removability.\n\nCompleted casework required for removal proceedings.\n\nProvided evaluation and supervision of 30 team members. Trained team members in new detention management and removal software rollouts. \n\nCompleted Deportation Officer Training Program and Fugitive Operations Training Program.\n\nAssigned and reviewed case processing and legal documents completed by Immigration Enforcement Agents.\n\nLiaised with local Office of Chief Counsel on complex immigration cases.", "location": "Tucson, Arizona Area", "title": "Deportation Officer", "startedOn": {"month": 3, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:533534"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Samuel", "numOfSharedConnections": 0, "memberBadges": {"premium": true, "openLink": true, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/samuel-nugent", "location": "Phoenix, Arizona"}