{"lastName": "Finck, MA, BS ", "objectUrn": "urn:li:member:61376814", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2019}, "fieldsOfStudy": ["Global Security, Protective Services, Terrorism, Counterterrorism Operations, and Senior Leadership "], "school": "urn:li:fs_salesSchool:19388", "degree": "Doctor of Strategic Security - Henley-Putnam School of Strategic Security ", "schoolName": "National American University", "startedOn": {"year": 2016}, "eduId": 324890750}, {"endedOn": {"year": 2018}, "fieldsOfStudy": ["Leadership"], "school": "urn:li:fs_salesSchool:19576", "degree": "Certificate", "schoolName": "George Mason University", "startedOn": {"year": 2017}, "eduId": 420744894}, {"endedOn": {"year": 2012}, "fieldsOfStudy": ["American School of Professional Psychology - Forensic Psychology"], "school": "urn:li:fs_salesSchool:17767", "degree": "Master of Arts", "schoolName": "Argosy University", "startedOn": {"year": 2010}, "eduId": 78107795}, {"endedOn": {"year": 2009}, "fieldsOfStudy": ["Criminal Justice Administration"], "school": "urn:li:fs_salesSchool:17727", "degree": "Bachelor of Science", "schoolName": "Columbia Southern University", "startedOn": {"year": 2007}, "eduId": 78107269}, {"endedOn": {"year": 1999}, "fieldsOfStudy": ["Executive and Dignitary Protection"], "degree": "Certified Protection Specialist", "schoolName": "Executive Security International", "startedOn": {"year": 1999}, "eduId": 96624787}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAOoiS4BrWCQrXoNK9XNiS3OLl89jpBwQjQ,NAME_SEARCH,undefined)", "numOfConnections": 300, "showTotalConnectionsPage": false, "headline": "Inspections and Compliance Specialist at U.S. Immigration and Customs Enforcement (ICE) and Doctoral Student", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Proven dedicated career minded professional with over three decades of law enforcement, investigative, physical security, military, crime prevention, human resources, program management, professional training management, mechanical maintenance supervision, individual combat skills training and trainer, and experience at all levels of leadership; moreover, mentorship experience as well as executive, dignitary, and personal protection training and operational employment. \n\nHigh level education and a degree in forensic psychology and a lower level degree in criminal justice administration. All academic requirements completed for a Doctorate Degree in Strategic Security.  Dissertation in progress.  Over 3,000 hours of professional law enforcement training including specialized training in crisis and hostage negotiation, fraud investigation, criminal anti-terrorism police intelligence management, protective services, executive protection and protective intelligence, child abuse prevention and investigative techniques, advanced crime scene investigative techniques, health care fraud investigation, physical security and crime prevention,  interview and interrogation, and civil aviation security.\n\nI am a motivated team player eager to contribute to dynamic and diverse customer service, administrative support, supervisory training and experience, management practices, law enforcement, undercover, investigative skills and experience, security operations, team building, and leadership, knowledge of Federal law enforcement, prosecution of suspects, to support the objective of an organization that rewards reliability, integrity, dedication, and ethics with opportunities.\n\n", "pendingInvitation": false, "defaultPosition": {"posId": 1227028797, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Evaluated ICE detention facilities' compliance with ICE policies and national detention standards for facilities that house ICE detainees; conducted on-site inspections of domestic ICE detention facilities; conducted inspections of state and local law enforcement programs to ensure compliance with immigration enforcement authorities; and performed compliance inspections; conduct entrance briefings with participating inspection site leadership to explain the purpose of the inspection, the main objectives and the inspection time frame, as well as exit briefings to discuss any findings at the close of the inspection; and participated in the inspection team's collective discussion of lessons learned from the inspection, notable areas of concern, deficiencies, and recommendations; provided an overall perception of the program; provided input to a written close-out summary of the inspection team's preliminary findings immediately following the close of an inspection and produced comprehensive written compliance inspection reports within reporting timelines and standards.\n\nEnsured that ICE detainees civil rights and civil liberties were protected; moreover, addressed any life safety and health issues which were discovered immediately.  Provided best practices suggestions to senior ICE, Enforcement and Removal Operations (ERO) personnel, such as Field Office Directors, Deputy Field Office Directors, Assistant Field Office Directors, Supervisory Deportation Officers, and Deportation Officers.  Coordinated with local law enforcement and contracted detention facilities to obtain testimonial and documentary evidence.  Obtained and evaluated physical, testimonial, and documentary evidence in support of reported compliance.   \n\nSubstantive  trauma informed interviews conducted with ICE detainees to determine their perception of civil rights and civil liberties issues.  Created and presented trauma informed interviewing instruction to both new and experienced Inspectors.  \n", "location": "Washington D.C. Metro Area", "title": "Office of Professional Responsibility, Inspections and Compliance Specialist - GS 1801", "startedOn": {"month": 3, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Joseph  M. Finck, MA, BS", "positions": [{"posId": 1227028797, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Evaluated ICE detention facilities' compliance with ICE policies and national detention standards for facilities that house ICE detainees; conducted on-site inspections of domestic ICE detention facilities; conducted inspections of state and local law enforcement programs to ensure compliance with immigration enforcement authorities; and performed compliance inspections; conduct entrance briefings with participating inspection site leadership to explain the purpose of the inspection, the main objectives and the inspection time frame, as well as exit briefings to discuss any findings at the close of the inspection; and participated in the inspection team's collective discussion of lessons learned from the inspection, notable areas of concern, deficiencies, and recommendations; provided an overall perception of the program; provided input to a written close-out summary of the inspection team's preliminary findings immediately following the close of an inspection and produced comprehensive written compliance inspection reports within reporting timelines and standards.\n\nEnsured that ICE detainees civil rights and civil liberties were protected; moreover, addressed any life safety and health issues which were discovered immediately.  Provided best practices suggestions to senior ICE, Enforcement and Removal Operations (ERO) personnel, such as Field Office Directors, Deputy Field Office Directors, Assistant Field Office Directors, Supervisory Deportation Officers, and Deportation Officers.  Coordinated with local law enforcement and contracted detention facilities to obtain testimonial and documentary evidence.  Obtained and evaluated physical, testimonial, and documentary evidence in support of reported compliance.   \n\nSubstantive  trauma informed interviews conducted with ICE detainees to determine their perception of civil rights and civil liberties issues.  Created and presented trauma informed interviewing instruction to both new and experienced Inspectors.  \n", "location": "Washington D.C. Metro Area", "title": "Office of Professional Responsibility, Inspections and Compliance Specialist - GS 1801", "startedOn": {"month": 3, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 857761322, "new": false, "current": false, "endedOn": {"month": 3, "year": 2018}, "companyName": "U.S. Department of Homeland Security", "description": "Employed with America's premier Government counter terrorism Agency with duty administering critical and complex compliance and enforcement programs designed to protect the Nation's public from piracy, terrorism, and other acts of sabotage to air transportation. Independently conduct, monitor, supervise, manage, and, lead assessments, comprehensive inspections and investigations of passenger air carriers  to determine security posture. Ensure that regulated entities are in compliance with applicable civil aviation security programs, Federal laws and regulations. Conduct covert testing of security systems and personnel to ensure appropriate security posture and prevent acts of terrorism and air piracy. Provide comprehensive written analyses of inspections and physical security assessments to determine the adequacy of corrective actions required and to improve security posture or to restore compliance. Identify, collect, protect, and preserve evidence used to support enforcement actions and investigations. Make determinations when enforcement action should be initiated, prepare comprehensive and detailed enforcement investigation reports, and recommend to legal counsel the type and level of penalty commensurate with the nature and severity of the violation. Provide testimony and participate in enforcement proceedings, hearings, and trials. Review for completeness, accuracy, and thoroughness; moreover, approve as appropriate Inspection, incident, and enforcement investigative reports.  Designated grieving official. Provide a coach, train, teach, and mentor approach to Inspectors for professional development and administer the on-the-job training program as a field trainer.  Provide information and assistance in the administration of regulation, law, and programs.  Coordinate with Federal, state, and local law enforcement.  Completed developmental assignment as Deputy Assistant Federal Security Director.  Acted as Assistant Federal Security Director - Inspections.  \n\n", "location": "Dallas/Fort Worth, Texas Area", "title": "Senior / Lead Inspector / Senior / Lead Agent - Civil Aviation Security - SV 1801", "startedOn": {"month": 9, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 438381228, "new": false, "current": false, "endedOn": {"month": 9, "year": 2016}, "companyName": "U.S. Department of Homeland Security", "description": "Employed with America's premier Government counter terrorism Agency with duty administering critical and complex compliance and enforcement programs designed to protect the Nation's public from piracy, terrorism, and other acts of sabotage to air transportation. Independently conduct, monitor, and, as required, lead assessments, comprehensive inspections and investigations of passenger air carriers that transport passengers, and indirect air carriers (IAC) to determine security posture. Ensure that regulated entities are in compliance with applicable civil aviation security policies, regulations, and agreements. Identify and resolve potential problem areas or deviations from prescribed standards. Provide feedback on the overall adequacy, effectiveness, and efficiency of security posture and TSA-approved airline security programs. Conduct covert testing of security systems to ensure appropriate security posture and prevent acts of terrorism and air piracy. Provide comprehensive written analyses of inspections and assessments and determine the adequacy of corrective actions required to improve security posture or to restore compliance. Identify, collect, protect, and preserve evidence used to support enforcement actions and investigations. Make determinations when enforcement action should be initiated, prepare comprehensive and detailed enforcement investigation reports, and recommend to legal counsel the type of action and level of penalty commensurate with the nature and severity of the violation. Provide testimony and participate in enforcement proceedings and trials. Review and analyze assessment reports and testing results with special attention to identifying unusual trends or air carrier actions which appear to have potential for developing a systemic security problem. Develop circulars and letters of instruction to regulated entities.  Provide outreach, information, and assistance in the administration of regulation, law, and programs.", "title": "Inspector / Agent - Civil Aviation Security - SV 1801", "startedOn": {"month": 9, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 624168621, "new": false, "current": false, "endedOn": {"month": 2, "year": 2016}, "companyName": "Florida Technical College", "description": "Facilitated collegiate level instruction at the Associate and Bachelor degree level to students in Criminal Justice topics.  Prepared lesson plans, evaluation methods, designed course materials and course support materials utilizing Microsoft Office products.  Developed course curriculum and sylabus.  Delivered objective feedback through evaluation methods, projects, and research papers.  Maintained attendance rosters, lead and facilitated courses, labs, and special assignments.   Utilized Blackboard Grade Center to input grades and manage attendance.  \nPresented high level theories of the criminal justice system, law enforcement, corrections, and investigation methodologies, report writing, leadership, victimology, crimnology, Terrorism and Aviation Security, physical security assessments, canine program utilization and training, police patrol procedures, law enforcement communications, stress reduction, management, and burnout avoidance, special victims investigation methodology, and Homeland Security with practical application tips and trends.  Facilitated guest speakers, field trips, and practical exposure to various criminal justice professions.  Designed challenging evaluation methods.  Interviewed and recommended criminal justice professionals for adjunct professor positions, supervised night criminal justice courses and professors.  ", "location": "Orlando, Florida Area", "title": "Professor - Criminal Justice Studies", "startedOn": {"month": 1, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:59201"}, {"posId": 206576772, "new": false, "current": false, "endedOn": {"month": 5, "year": 2014}, "companyName": "United States Army", "description": "2011 - 2014 Senior Human Resources Sergeant / Senior Instructor Writer (42A)\n2004 - 2011 Criminal Investigation Command (USACIDC) Special Agent (31D)\n2002 - 2004 Human Resources Sergeant (71L / 75H / 42A)\n1999 - 2002 Infantry and Indirect Fire Infantry Soldier and Noncommissioned Officer (11B / 11C)\n\nOther Occupational Specialties Held:\nSenior NCO advisor to the Commander.  Senior NCO leader at the company level.  Supervised and led over 40 personnel in human resources, supply and logistics, training, operations, security, and communications.  Completed complex felony investigations of crimes such as death, assault, sexual assault, larceny, fraud, and drug violations.  Provided personal protection to high level Department of Defense personnel.   Completed personal vulnerability assessments of high level Department of Defense personnel.  Also conducted and completed a personal vulnerability assessment of a foreign General officer in a combat zone, resulting in improved security.  Conducted complex multi-jurisdictional investigations.  Managed, led, and participated in high profile investigations of a sensitive nature. Conducted overt and covert assessments of military infrastructure and operational security procedures.  Received laudatory comments for leadership in combat at a superior level.  Attended and graduated from the United States Army Military Police School  protective services course, advanced fraud investigator course, crisis and hostage negotiation, criminal anti-terrorism police intelligence management course, basic CID Special Agent noncommissioned officer course, conventional physical security and crime prevention course, the Apprentice CID Special Agent Course, Anti-terrorism Officer Course, and the advanced crime scene investigation course.  Was also assigned as Unit logistics manager and completed Unit Supply NCO Course as well as Property Book Unit Supply Enhanced (PBUSE) training.  Managed over $400,00.00 of assets.", "title": "Retired", "startedOn": {"month": 4, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 422391530, "new": false, "current": false, "endedOn": {"month": 9, "year": 2013}, "companyName": "Florida Department of Children and Families", "description": "Conducted complex and comprehensive investigations of child abuse and neglect allegations. Completed detailed reports of investigation which addressed allegations investigated and outcomes. Recommended services for families. Conducted sensitive interviews of victims, witnesses, and alleged perpetrators. Coordinated with Florida State's Attorneys, local, County, and State Law Enforcement Officers, State Probation Officers, Medical and Psychological Professionals, and others to gain information pertaining to allegations or in providing assistance or legal intervention for families. Completed detailed reports of investigation.  Provided expert testimony in courts and expert consulting with other investigators pertaining to sexual assaults and sexual abuse.  Received laudatory comments from Field Consultants, Senior Investigators, and Investigator Supervisors for interviewing skills, information gathering abilities, and the quality and content of written reports of investigation.\n\nCompleted challenging Child Protective Investigator course and Florida state exam in support of attaining certification.", "location": "Central Florida", "title": "Investigator", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:254995"}, {"posId": 210750444, "new": false, "current": false, "endedOn": {"month": 2, "year": 2013}, "companyName": "UnitedHealth Group", "description": "Senior Investigator, Special Investigations Unit, assigned to behavioral health insurance fraud investigations.  Conducting complex investigations into fraudulent activities by insured persons, insurance providers, and also internal investigations.  Completed complex and detailed reports of investigations.  Coordinated efforts between corporate and public agencies to attain prosecution of offenses which were discovered.  Participated in recoupment of illicit funds.  Developed training pertaining to interviewing, documentation, establishment of relationship, the mental health parity law, and surveillance.  Prepared, wrote, suggested, and was a member of the committee which approved all Standard Operating Procedures and Policy Guidance for all personnel assigned to the Special Investigations Unit.  Managed and lead the surveillance program and developed it from paper to full scope operations.", "title": "Senior Investigator, Special Investigations Unit", "startedOn": {"month": 8, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1720"}, {"posId": 100863032, "new": false, "current": false, "endedOn": {"month": 12, "year": 2010}, "companyName": "United States Department of Defense", "description": "Federal Agent assigned to newly formed Special Victims Unit.  Investigated felony crimes such as sexual assault, rape, child assault, child sexual assault, child death, human trafficing, child pornography, and assisted in other complex investigations as needed and requested.  Provided specialized training for the interview of child and sexual assault victims.  Provided expert testimony in Federal court, Federal grand juries, US Military Courts Martials, and others.  Served as a member of a large task force which investigated and brought to justice a serial rapist.  Was an intregal part of a team of investigators who apprehended a serial pedophile and conducted highly successful sensitive interviews with child victims.  Was lauded by supervisors for interviewing skills; moreover, provided an example of victim statements which is now utilized as the standard for what  information should be gained in a victim interview at a Federal Law Enforcement training center.  Provided guidance, intuitive interaction, instruction, and ensured all personnel conducting sensitive victim interviews understood and evaluated counter-intutive behavior of victims.  Additionally, I provided expert advice and testimony pertaining to counter-intuative behavior in victims for prosecutors and others involved in the criminal justice process.", "location": "Fort Bragg, NC, Austin, TX", "title": "Senior Special Agent GS 1811, Security Professional GS 0085", "startedOn": {"month": 4, "year": 2002}, "companyUrn": "urn:li:fs_salesCompany:7510"}, {"posId": 292304793, "new": false, "current": false, "endedOn": {"month": 5, "year": 2002}, "companyName": "Inter-Con Security Systems, Inc.", "description": "Assigned as Deputy Program Manager for United States Department of State Contract to the American Embassy in Liberia.  Served in Liberia with honor and distinction in a highly austere environment during the civil war.  Performed direct supervision to day to day security operations for United States Embassy during the civil war in Liberia, West Africa.  Created and trained highly lauded Emergency Response Team (ERT)  for urgent incidents and high risk security operations.  Supervised, led, and managed over 400 employees.  Responsible for human resources actions, awards, promotions, and disciplinary actions.  Was also responsibile for creation and revision of policies and procedures to ensure compliance with local laws and United States Government contractually obligated statement of work.  Supervised and managed all operational aspects, logistics, and logistical support services; moreover, all administrative and personnel actions.  Provided executive and dignitary protection in highly volatile environment resulting in no incidents.  Conducted and cooperated in the conduction of full scope physical and personnel security vulnerability assessments.", "location": "Liberia, West Africa", "title": "Deputy Program Manager", "startedOn": {"month": 4, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:83130"}, {"posId": 292307632, "new": false, "current": false, "endedOn": {"month": 4, "year": 2000}, "companyName": "Texas Department of Insurance", "description": "Conducted complex and challenging origin and cause investigations of fires, arsons, and post blast scenes.  In conjunction with these investigations, I also conducted insurance fraud investigations, murder and unknown death investigations, and other felony violent and property crimes investigations.  Completed complex, detailed, technical reports of investigation, which contained expert opinions.  Conducted intense interviews which lead to viable information for the investigations and obtained a high number of meangful and valid confessions to crimes, as well as felony convictions.  Provided expert testimony in courts.  Requested and obtained arrest and search warrants and executed same.  Provided liaison with other state law enforcement, Federal law enforcement, and local law enforcement and fire agencies.  Provided leadership and guidance when conducting investigations and while serving on various task forces.  Provided training in law enforcement skills at basic, intermediate, and advanced levels.", "location": "Austin, TX", "title": "Deputy State Fire Marshal / Investigator II / State Police Investigator", "startedOn": {"month": 4, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:2946"}, {"posId": 326722974, "new": false, "current": false, "endedOn": {"month": 4, "year": 1999}, "companyName": "Inter-Con Security Systems, Inc.", "description": "Provided comprehensive security management and leadership to Security forces assigned and contracted to protect the United States Embassies in Benin, Togo, and Ghana, West Africa.  Managed the budget, provider policy and procedural guidance, provided expert assessments and advise as well as consulting on physical, personal, and infrastructure security.  Conducted port and airport security vulnerability assessments and completed comprehensive reports of findings.  Provided daily supervision and leadership to over 300 personnel in austere environment.  Working days, weeks, and months without electricity or running potable water and completing all tasks as assigned and in a timely fashion.  Conducted investigations into wrong doing by personnel, completed reports, and provided disciplinary action in accordance with United States Government contract, policy, procedure, and local laws.", "location": "Cotonou, Benin; Lome, Togo, and Accra Ghana, West Africa", "title": "Program Manager", "startedOn": {"month": 8, "year": 1997}, "companyUrn": "urn:li:fs_salesCompany:83130"}, {"posId": 784911765, "new": false, "current": false, "endedOn": {"month": 4, "year": 1999}, "companyName": "Lower Colorado River Authority", "description": "Served as reserve law enforcement officer for Lower Colorado River Authority.  Patrol of rural areas, completion of offense reports for violations of State Law, Environmental Law, and Game Law.  Rescue operations for persons in distress in lakes and other public waterways.  Provided instructor support for law enforcement training programs, specialized training programs, and other duties as assigned.  ", "title": "Ranger - Police Officer", "startedOn": {"month": 8, "year": 1997}, "companyUrn": "urn:li:fs_salesCompany:10411"}, {"posId": 784907931, "new": false, "current": false, "endedOn": {"month": 8, "year": 1997}, "companyName": "Burnet, TX Police Department - 33rd Judicial District Narcotics Enforcement Team (NET)", "description": "Served as reserve member of the 33rd Judicial District Narcotics Enforcement Team while commissioned by the Burnet Police Department, Burnet, TX.  \n\nAssisted with service of search and arrest warrants, investigated allegations of narcotics distribution, sales, and use.  Drug interdiction patrol in high narcotic traffic areas, on scene arrests, and completion of complex detailed reports of investigation.  ", "title": "Investigator", "startedOn": {"month": 12, "year": 1996}}, {"posId": 314370551, "new": false, "current": false, "endedOn": {"month": 8, "year": 1997}, "companyName": "Capital Area Planning Council - Regional Law Enforcement Academy", "description": "Managed, supervised, and lead basic police academy classes, law enforcement officer in-service training, advanced law enforcement officer training, and law enforcement officer instructor programs.\nDeveloped and implemented a physical fitness program which did not exist previously.  \nMaintain an amazing 100% pass rate on the Texas Commission on Law Enforcement Officer Standards and Education basic peace officer exam.\nPrepared new lesson plans, evaluated instructors, students, and administrative personnel.  Provided liaison and training, as requested by the Sheriff's in 15 Counties, State Law Enforcement Agencies, and over 100 municipal law enforcement agencies.", "title": "Chief Law Enforcement Officer Instructor", "startedOn": {"month": 11, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:325608"}, {"posId": 321803032, "new": false, "current": false, "endedOn": {"month": 11, "year": 1996}, "companyName": "Killeen District Police", "description": "Provided full spectrum law enforcement services and support in a multijurisdictional and politically charged environment.  Investigated complex cases of violent crimes such as murder, sexual assault, robbery, arson, aggravated assault, assault, burglary of a building, burglary of automobiles and others.  Prepared detailed, complete, and comprehensive reports of investigation.  Made on view arrests, obtained arrest warrants and search warrants; moreover, executed same.  Prepared arrest reports.  Provided expert testimony in court.  Prepared and presented grand jury testimony.  Investigated complex motor vehicle accidents.  Provided complex instruction on topics such as use of force, defensive tactics, ASP Tactical Baton, OC aerosol sprays,  emergency driving, tactical building search, civil rights, constitutional law, weapon proficiency, report writing, hostage negotiation, and others.  Provided instruction at the Central Texas Regional Law Enforcement Academy in numerous topics, including juvenile law, juvenile procedures, and broad spectrum use of force related training.  Provided expert instruction for Texas State University (then Southwest Texas State University), Institute of Criminal Justice Studies pertaining to gangs, juvenile law and procedures, investigations of cases involving youthful victims and offenders, and others.", "title": "Police Officer / Investigator / Supervisor / Instructor", "startedOn": {"month": 9, "year": 1992}, "companyUrn": "urn:li:fs_salesCompany:30279"}, {"posId": 355838439, "new": false, "current": false, "endedOn": {"month": 9, "year": 1992}, "companyName": "City of Morgan's Point Resort", "description": "Provided world class law enforcement services including patrol of residential, commercial, and business areas; traffic enforcement of the Texas Motor Vehicle Laws; criminal enforcement of the Texas Penal Code; complex report writing of investigated offenses; on view arrests; investigation of complex crimes such as death, assault, aggravated assault, sexual assault, fraud, forgery, theft, robbery, drug crimes, white collar crimes, and others; investigation of motor vehicle accidents; provided testimony before Grand Juries, District Courts, County Courts, and Municipal Courts; preparation of affidavits; obtaining search and arrest warrants; crime prevention activities; and other duties as assigned.", "location": "Morgan's Point Resort, Texas", "title": "Police Officer / Detective", "startedOn": {"month": 12, "year": 1988}}, {"posId": 326725505, "new": false, "current": false, "endedOn": {"month": 7, "year": 1989}, "companyName": "United States Marine Corps", "description": "United States Marine", "title": "United States Marine", "startedOn": {"month": 4, "year": 1983}, "companyUrn": "urn:li:fs_salesCompany:2039"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Joseph  M.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/joseph-m-finck-ma-bs-ba667a18", "location": "Washington D.C. Metro Area"}