{"lastName": "Shoamotamedi", "objectUrn": "urn:li:member:281612661", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Research", "educations": [{"endedOn": {"year": 2015}, "fieldsOfStudy": ["Acquisition"], "school": "urn:li:fs_salesSchool:150004", "schoolName": "Defense Acquisition University", "startedOn": {"year": 2014}, "eduId": 258375855}, {"endedOn": {"year": 1990}, "fieldsOfStudy": ["Master's Degree (MS), Applied Mathematics"], "school": "urn:li:fs_salesSchool:18832", "schoolName": "University of Nebraska at Omaha", "startedOn": {"year": 1986}, "eduId": 174973657}, {"endedOn": {"year": 1986}, "fieldsOfStudy": ["Mathematics"], "school": "urn:li:fs_salesSchool:18818", "degree": "Bachelor of Arts (BA)", "schoolName": "Bellevue University", "startedOn": {"year": 1981}, "eduId": 174973540}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABDJEXUBZIFert02YEntbMQCjMPe0LYNJbE,NAME_SEARCH,undefined)", "numOfConnections": 211, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHyg_1CR_UKFg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=v2cG03fMN75tM4-jgkl_KU5LUIj-ymw4ZytF0WiElgo", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHyg_1CR_UKFg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=AKKbIZzqI-VseiyBjn6Bmv4Bl-WQ8DjrDfZVakHYDfU", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHyg_1CR_UKFg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=IjIeG8drmhElcPmUuipMc3RgQrmTtHsFpSBEzasL7aI", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHyg_1CR_UKFg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=o2Hkf3uZidGez0KiuuRzVgzY_uI8Dw3laReIPGgw7BU", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Operations Research Analyst at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "A retired military officer with 24 years of progressive assignments within the U.S. Army, interacting with government personnel, multi-national forces, and private corporations.  Result-driven professional with leadership and analytical experience.  Excellent problem-solving skills and flexibility to adapt to working under various conditions.  Proven ability to manage large, diversely staffed organizations and to manage projects from conception through execution.  Able to reduce complex situations and problems into logical and manageable problems sets.  ", "pendingInvitation": false, "defaultPosition": {"posId": 718928514, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Serves as a Research Operations Analyst responsible for the planning and execution of assignments aimed at assessing and improving the effectiveness and efficiency of work methods and procedures used in immigration enforcement.  Identifies and defines strategic, operational and budgetary issues that impact division and immigration enforcement effectiveness, efficiency and mission accomplishment; collects, organizes, and studies information, operations and processes from a variety of sources, such as publications, computer databases and field personnel; collaborates with management, decision-makers, and Subject Matter Experts to clarify issues and objectives, and proposes process improvements; and performs analytical work that involves designing, developing and adapting mathematical, statistical, econometric and other methods and techniques.", "title": "Operations Research Analyst", "startedOn": {"month": 10, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Kia Shoamotamedi", "positions": [{"posId": 718928514, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Serves as a Research Operations Analyst responsible for the planning and execution of assignments aimed at assessing and improving the effectiveness and efficiency of work methods and procedures used in immigration enforcement.  Identifies and defines strategic, operational and budgetary issues that impact division and immigration enforcement effectiveness, efficiency and mission accomplishment; collects, organizes, and studies information, operations and processes from a variety of sources, such as publications, computer databases and field personnel; collaborates with management, decision-makers, and Subject Matter Experts to clarify issues and objectives, and proposes process improvements; and performs analytical work that involves designing, developing and adapting mathematical, statistical, econometric and other methods and techniques.", "title": "Operations Research Analyst", "startedOn": {"month": 10, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 433745727, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "US Army", "description": "Analyzed Army databases and various information forums to identify emerging Army issues / trends to inform the Inspector General and Army Senior Leaders of potential inspection topics. Focused on Army Regulations and Policies to ensure 100% compliance. Supervised and conducted mandatory training to management and supervisory officials as required for program changes and to ensure Army regulatory compliance. Performed quantitative and qualitative analysis to assist senior leaders in decision making and problem solving of complex operational issues. \n\nPerformed data management and quantitative and qualitative analysis for Army level inspections that were directed by the Secretary of the Army; presented findings and recommendations on complex issues and problems impacting programs thus improving unit readiness, training, operation, and accountability; Performed analytical studies and projects.\n\nCollected Senior Army Leader guidance, Commands, and Staff Principles' topic suggestions, and cross-referenced them against the previous Army Campaign Plan's major objectives to develop a prioritized list of systemic inspection topics for the Secretary of the Army consideration.\n\nServed as the Executive Officer for the Senior Executive Service - Principal Director to the Inspector General and maintained 100% accountability and timeliness of reports and due outs. Used business analytical and evaluative methods and techniques to the measurement and improvement of program effectiveness and organizational productivity at the Inspector General Agency.\n\nPrepared reports, talking points, decision memoranda and briefed supervisors, management, and staff on workforce management issues and the means to improve those processes. \n\nDeveloped necessary tools and analyzed survey data, with responsibility for interpreting and assessing the findings.\n\nAssisted the Inspection teams and staff with data analysis and identified operational best practices.", "location": "U.S. Inspector General Agency", "title": "Operations Research Analyst", "startedOn": {"year": 2012}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 589916090, "current": false, "endedOn": {"year": 2012}, "companyName": "USJFCOM (Joint Staff, J7)", "description": "Represented the Joint and Coalition Warfighting at International Security Assistance Force Joint Command in Kabul, Afghanistan; assisted with the assessment, production, and dissemination of the Commandâ\u0080\u0099s monthly Lessons Learned journal focusing on sharing information on â\u0080\u009cBest Practicesâ\u0080\u009d throughout the Theater. \n\nServed as the Liaison Officer between the Joint and Coalition Warfighting and the multi-national community; captured and documented 130 operational-level joint lessons learned and best practices during training, exercises, experiments, and ongoing operations which increased operational readiness of the coalition units.\n\nLead officer in theater for the V Corps interface prior to their Mission Rehearsal Exercises and deployment, ensuring 28 agencies were integrated into a successful exercise and timely transition with I Corps. Managed the entire conference requirement via SIPRNET among multiple sites (Germany, Afghanistan, and U.S.) while ensuring 100% connectivity.\n\nAnalyzed, coordinated, and attended all of the conferences and provided a daily update to the host. Provided an After Action Review, recommendation, and guidance to improve the planning and execution of any future conferences.\n\nCollected data points in support of the â\u0080\u009cCivilian Casualtyâ\u0080\u009d Study and provided statistical analysis and critical assessments to the Army leadership resulting in reduction of Civilian Casualties (caused by international forces) in Afghanistan Theater of operations.\n\nServed as technical analyst and advisor to senior leadership advising and consulting on a variety of technical recurring problems that involved applying operational research applications.\n\nExtracted and summarized program data to prepare reports.\n\nAnalyzed and summarized project data and presented reports to Division chief.", "location": "Forward Assessment Team, Afghanistan", "title": "Operations Research Analyst", "startedOn": {"year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 662495708, "current": false, "endedOn": {"year": 2011}, "companyName": "USJFCOM (Joint Staff, J7)", "description": "Prepared study teams for deployment to Afghanistan and provided reach-back capability and assessment support for those teams.       \n\nCollaborated with military and civilian intelligence agencies on â\u0080\u009cEmerging Threats:  Talibanâ\u0080\u009d study and assisted the team in formulating key critical findings and identifying potential future regional threats.\n\nIncorporated and synthesized the insights from over 160 interviews and documents into the â\u0080\u009cTransition to Stability Operations-Iraqâ\u0080\u009d study which was recognized by the United States Forces-Iraq Commander as a the blue print for future military operations.\n\nParticipated in planning conferences and provided information pertaining to program specialties (deployment of personnel to Afghanistan, providing the necessary life support and the reach-back capabilities). \n\nConducted studies and recommended changes and improvements in administrative policies and regulations while supporting the war fighters in combat theaters.\n\nDeveloped new and modified program policies, regulations, goals, and objectives in accordance to Army leadership guidance.\n\nExtracted and summarized program data to prepare reports.\n\nAnalyzed and summarized project data and presented reports to Division chief.", "location": "Suffolk, VA", "title": "Operations Research Analyst", "startedOn": {"year": 2010}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 662497947, "current": false, "endedOn": {"year": 2010}, "companyName": "US Army", "description": "Established a productive working relationship with the U.S. Embassy Iraq Economics Lines of Operations by monitoring a full range of economic relations between the State Department and Iraq; guided them in their quarterly assessments of trade and investment policies. \n\nServed as the Liaison Officer between the Joint and Coalition Warfighting and the New Embassy Compound Economics Department.  Coordinated monthly and quarterly conferences between the State Department and the Iraqi officials. \n\nRecognized by the Commanding General for providing the best Campaign Plan Economics Lines of Operations assessment essential to Iraqâ\u0080\u0099s long-term financial success; The assessment provided the senior officials with key recommendations on how to improve daily operation and the ability to measure progresses and to determine compliance with policies, plans, and regulations.\n\nProvided the Commanding General the key monthly updates to the Drivers of Instability assessment, which were critical for establishing clear and realistic objectives that entailed security, economic opportunities, and fighting corruption.  Developed and implemented measurement strategies and provided recommendations to critical problems.\n\nEvaluated monthly operational data to analyze the trends and monitored effectiveness, efficiency, and adherence to reporting requirements.\n\nConducted comprehensive studies on the effectiveness and efficiency of programs and operations and recommend changes and improvements for those programs. Coordinated, documented, and tracked all data pertaining to those specific studies and program cases.\n\nAnalyzed new and proposed regulations, and other authoritative guidance to determine impact on program operations and develop implementation plans as necessary.\n\nConducted studies, trend analysis and evaluation on substantive operating projects and programs that required applying knowledge of qualitative and quantitative analysis of operating programs.", "location": "Forward Assessment Team, Iraq", "title": "Operations Research Analyst", "startedOn": {"year": 2009}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 589920706, "current": false, "endedOn": {"year": 2009}, "companyName": "TRADOC", "description": "Instituted policies, techniques, and procedures for unit readiness reporting; provided oversight and training to the command headquarters and 33 Schools and Centers of Excellence throughout the Army that improved Army unitsâ\u0080\u0099 monthly evaluative methods and their assessment techniques. \n\nLead project officer for the Army web-based readiness reporting system.  Coordinated training for 62 organizations, provided guidance, monitored their successful transitions from a legacy system to a secured server.\n\nManaged 2,300 Army-wide Readiness Reports and produced a monthly Readiness briefing and a statistical analysis for the Deputy Commanding General, Training and Doctrine Command that provided a real-time Common Operating Picture.\n\nAssisted in the development and sustainment of the Defense Readiness Reporting System Army (DRRS-A) and Army Readiness Management System (ARMS) to ensure accurate and timely readiness reporting and analysis.\n\nAssisted in the formulation and oversight of Army Regulations directing Department of the Army policy for force readiness in accordance with Secretary of Army requirements.\n\nIdentified process, system, and training shortfalls by applying defect prevention principles and root cause problem resolution techniques and recommended corrective actions.\n\nApplied statistical analysis techniques to measure progress, efficiency, and trends impacting the effectiveness of the organization to meet the organizational goals and objectives.\n\n", "location": "Fort Monroe, VA", "title": "Operations Research Analyst", "startedOn": {"year": 2007}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 589921608, "new": false, "current": false, "endedOn": {"year": 2007}, "companyName": "US Army", "description": "Chief Force Modernization officer responsible for preparing the 19,000 Division Soldiers for deployment to Afghanistan. Coordinated, synchronized, and integrated the new material solutions to ensure units were fully modernized and combat ready. Collaborated with cross-functional battlefield experts focusing on identifying emerging technologies. \n\nProvided the logistical support for members of the Armyâ\u0080\u0099s 10th Mountain Division Soldiers upon their arrival to Afghanistan which allowed them to have a seamless transition with the outgoing unit.\n\nManaged and fielded over $700 million dollars worth of equipment ranging from critical force protection equipment, electronics Counter Improvised Explosive Devices, to tactical communications and heavy construction equipment.\n\nAssisted in developing policies and assessed potential impacts regarding the allocation and use of logistical resources.\n\nDirected, developed and performed logistics management operations in support of Task Force 76 Afghanistan that involved planning, coordinating, and evaluating the logistical actions required to support daily missions, training and fielding of new weapon systems.\n\nPlanned, managed and coordinated the total cradle-to-grave life cycle logistics support for assigned systems or subsystems, integrating separate functions of supply, maintenance, procurement and quality assurance into logistics activities required to sustain system fielding.\n \nPerformed independent systems evaluations and developed recommendations for system improvements based on a thorough and comprehensive study and analysis. This resulted in the fielding of the Mine-Resistant Ambush Protected (MRAP) wheeled vehicle in Iraq and Afghanistan.\n\nGathered data and facts and developed conclusions relative to matters having significant impacts on the security and the protection of the friendly forces. Exercised technical leadership to obtain agreement on required actions (Operations Need Statements).", "location": "10th Mountain Division & Afghanistan", "title": "Force Management Officer, Operations System Analyst", "startedOn": {"month": 1, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 633790359, "current": false, "endedOn": {"year": 2004}, "companyName": "US Army", "description": "Advised Group and Battalion Commanders on all logistical, maintenance, and budget matters in support of two simultaneous combat operations and theater Combatant Commanders.  Oversaw the logistics operation which supported over 500 Soldiers deployed to 12 different countries and managed $5.4 million dollars property book.  Prior to the start of the combat operations, deployed to Kuwait to supervise logistics preparations of the combat elements.  Led the main effort to build a logistical support base for the Psychological Operations Task Force in Iraq.  Established key support relationships with the U.S. Embassy and the local communities which ensured critical supplies and equipment, and rapid movement of time-sensitive products across Iraq. ", "location": "Fort Bragg, NC", "title": "Senior Logistics Officer (S-4)", "startedOn": {"year": 2002}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 662497199, "current": false, "endedOn": {"year": 2002}, "companyName": "U.S. Army Recruiting Command", "description": "Provided leadership, training, and guidance to 7 recruiting stations that were geographically located across 6,035 square miles.  Responsible for an annual mission in excess of 800 enlistments while promoted Army values and ensured the health, welfare, and safety of Soldiers and their families.  Increased college enlistment by 142% and the Officer selection by 260% for the year and improved public awareness of the Army while the company participated in the annual Navy and Air Force air shows.  Maintained an open and supportive command climate.", "location": "Fort Walton Beach, FL", "title": "Company Commander", "startedOn": {"year": 2000}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 662496194, "current": false, "endedOn": {"year": 2000}, "companyName": "US Army", "description": "Maintained Direct Support Operations and repair parts to support the Brigade and Battalion headquarters and 10 Air Defense firing batteries.  Assisted the Battalion Commanders in planning, coordinating, and supervising all maintenance actions within the Brigade.  Monitored and controlled supply warehouse of $9 million dollars and was responsible for the unit property book in excess of $20 million dollars.  Coordinated logistical issues to prepare the Brigade headquarters and subordinate units for worldwide deployment.  Advised the Brigade commander on the management of supply, property, accountability, material maintenance, transportation, engineering, and financial management.", "location": "Fort Bliss, TX", "title": "Senior Logistics Officer (S-4) & Company Commander", "startedOn": {"year": 1997}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 662495389, "current": false, "endedOn": {"year": 1996}, "companyName": "US Army", "description": "Directed and monitored the personnel management of 546 officers and Soldiers; ensured timely preparation and submission of battalion suspenses, and accuracy of administrative information.  Executed the battalion organizational maintenance program and served as the primary advisor to the Battalion commander and executive officer on maintenance information, requisition procedures, and calibration.  Provided maintenance and logistical support automotive, armament, communication electronics, engineer maintenance in support of over 100 Army units operating in the Central and South America.", "location": "Panama", "title": "Battalion Adjutant (S-1), Logistics Officer (S-4), Maintenenance Officer", "startedOn": {"year": 1993}, "companyUrn": "urn:li:fs_salesCompany:1223"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Kia", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/kiashoamotamedi", "location": "Aldie, Virginia"}