{"lastName": "Byrd", "objectUrn": "urn:li:member:215762829", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2013}, "fieldsOfStudy": ["Human Resources Management and Services"], "degree": "Bachelor of Science in", "schoolName": "Columbia Southern University", "startedOn": {"year": 2008}, "eduId": 144969609}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["Business Management"], "degree": "Associate of Applied Science", "schoolName": "Columbia Southern University", "startedOn": {"year": 2008}, "eduId": 144969736}, {"endedOn": {"year": 2007}, "fieldsOfStudy": ["Military and Strategic Leadership"], "schoolName": "USAF Senior Noncommissioned Officer Academy", "startedOn": {"year": 2007}, "eduId": 145003236}, {"endedOn": {"year": 2006}, "fieldsOfStudy": ["Organizational Leadership"], "schoolName": "USAF First Sergeant Academy Additional Duty Seminar", "startedOn": {"year": 2006}, "eduId": 145004197}, {"endedOn": {"year": 2004}, "fieldsOfStudy": ["Criminal Justice"], "degree": "Associate of Arts (A.A.)", "schoolName": "Community College of the Air Force", "startedOn": {"year": 1987}, "eduId": 144969884}, {"endedOn": {"year": 1998}, "fieldsOfStudy": ["Military and Strategic Leadership"], "schoolName": "Noncommissioned Officer Academy", "startedOn": {"year": 1998}, "eduId": 145004514}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAzcR40BuzMFvHfZt8tOGCGtiyUBP9D9BWI,NAME_SEARCH,undefined)", "numOfConnections": 350, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQE-tvYlgLWGaA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=AYo4HOoV79ffLfSPnvplsbIWneRYLdGYPOjrmeSAWig", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQE-tvYlgLWGaA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=he4I21YdwGdqbGSXoRoUR7rxcAv5NR3Q1yAC7mNUlus", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQE-tvYlgLWGaA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=Mpv9lF2OTmQPqjImBXrj8u-gtdyXPcjl9ZwUkP7IzqY", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQE-tvYlgLWGaA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=n6kEjHxcOUr0J7ycrOgBoGDWjNOYn277bTnvIWEuY1c", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Security Manager, US Citizenship and Immigration Services", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "-Exceptional ability to assess situations objectively from a risk and safety perspective and to determine the best course of action. Apply in-depth security training and experience to mitigate risks and implement solutions.\n-Fully utilize a variety of security techniques and enforcement methods through the application of both general and technical knowledge of security and safety policies, procedures, weapons, and communications.\n-Skillfully manage competing priorities in a calm, focused, and professional manner, respond to emergency, crisis, and stressful situations appropriately, and operate effectively in routine and hostile environments.", "pendingInvitation": false, "defaultPosition": {"posId": 1225669583, "new": false, "current": true, "companyName": "USCIS", "description": "-Provideds regional security program management for multiple security disciplines including information security, communication security, operations security, physical security and administrative security \r\n-Advises four Directors; serves on working groups and committees to develop policies and improve local security processes\r-Security training instructor and assists with continuity of operations and occupant emergency programs\r-Provides accountability guidance for secure equipment, secure forms, and national security information (NSI)\r-Plans, organizes, coordinates, and conducts site surveys, evaluations, and reviews to identify physical security conditions to determine if corrective actions are necessary\r\n  --Conducts periodic announced and unannounced security reviews at facilities within assigned area of responsibility to maintain an optimum level of security support\r\n-Security expert and project manager for security requirements during new/existing construction efforts as well as new facility project planning and design coordination with appropriate stakeholders\n-Liaisons with federal, state & local law enforcement & emergency management officials \r\n-Assists with continuity of operations and occupant emergency programs\r\n-Determines contract guard requirements, solicits contract funding and provides on site oversight of 14 guards", "location": "San Francisco Bay Area", "title": "Security Manager", "startedOn": {"month": 3, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:22344726"}, "degree": 3, "fullName": "David Byrd", "positions": [{"posId": 1225669583, "new": false, "current": true, "companyName": "USCIS", "description": "-Provideds regional security program management for multiple security disciplines including information security, communication security, operations security, physical security and administrative security \r\n-Advises four Directors; serves on working groups and committees to develop policies and improve local security processes\r-Security training instructor and assists with continuity of operations and occupant emergency programs\r-Provides accountability guidance for secure equipment, secure forms, and national security information (NSI)\r-Plans, organizes, coordinates, and conducts site surveys, evaluations, and reviews to identify physical security conditions to determine if corrective actions are necessary\r\n  --Conducts periodic announced and unannounced security reviews at facilities within assigned area of responsibility to maintain an optimum level of security support\r\n-Security expert and project manager for security requirements during new/existing construction efforts as well as new facility project planning and design coordination with appropriate stakeholders\n-Liaisons with federal, state & local law enforcement & emergency management officials \r\n-Assists with continuity of operations and occupant emergency programs\r\n-Determines contract guard requirements, solicits contract funding and provides on site oversight of 14 guards", "location": "San Francisco Bay Area", "title": "Security Manager", "startedOn": {"month": 3, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:22344726"}, {"posId": 1131846662, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "-Oversaw regional program to protect personnel and assets within (50) facilities domestically & internationally\r\n-Planned, develope d, implemented, and managed policies and procedures encompassing access control, visitor management, and other security specialties associated with industrial, information, communication, personnel, operations security and sensitive compartmented information programs\r\n-Managed security system projects from initiation to closure, designs security layout & writes scope of works\r\n-Conducted market surveys, analyzes data and makes recommendations to determine future sites\r\n-Representative/liaison with stakeholders to determine technical and functional physical security requirements\r\n-Coordinated and conducted site security assessments", "location": "Oakland, California", "title": "Senior Physical Security Manager", "startedOn": {"month": 10, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 777616691, "new": false, "current": false, "endedOn": {"month": 10, "year": 2017}, "companyName": "USCIS", "description": "-Provided regional security program management for multiple security disciplines including information security, communication security, operations security, physical security and administrative security \r\n-Advised four Directors; serves on working groups and committees to develop policies and improve local security processes\r-Security training instructor and assists with continuity of operations and occupant emergency programs\r-Provided accountability guidance for secure equipment, secure forms, and national security information (NSI)\r-Planned, organized, coordinated, and conducted site surveys, evaluations, and reviews to identify physical security conditions to determine if corrective actions are necessary\r\n  --Conducted periodic announced and unannounced security reviews at facilities within assigned area of responsibility to maintain an optimum level of security support\r\n-Security expert and project manager for security requirements during new/existing construction efforts as well as new facility project planning and design coordination with appropriate stakeholders", "location": "San Francisco Bay Area", "title": "Field Security Manager", "startedOn": {"month": 2, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:22344726"}, {"posId": 717066709, "new": false, "current": false, "endedOn": {"month": 2, "year": 2016}, "companyName": "Longevity Consulting", "description": "-Physical Security Consultant to the Headquarters, United States Army Corp of Engineers (USACE)\n --Conducted detailed onsite physical security inspections and audits of DoD facilities nationwide, including assessing site-level physical security plans, programs, equipment, systems, and operations against exhaustive DoD physical security policies, regulations, and requirements. \n --Developed robust security assessment reports that provide an extensive narrative analysis of gaps, identify deficiencies, and recommend security mitigation countermeasures and associated cost estimates to address identified shortfalls. \n --Performed intense document reviews of existing site level physical security program plans, identification of gaps relative to DoD regulations, and development of detailed physical security policy, procedure, and planning documents.", "title": "Principal Physical Security Consultant", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:1332838"}, {"posId": 703870104, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "Systems Planning and Analysis, Inc", "description": "-Antiterrorism (AT) Subject Matter Expert (contractor) for United States Army Corp of Engineers (USACE)\n --Provided risk informed recommendations to Security Manager, clearly identifying mitigation (policy or project) measures, projected risk reduction and associated cost. \n --Reviewed, validated & updated strategy/plans, developed requirements, policies/procedures \n --Conducted AT-related self and higher headquarters assessments, risk assessments, to include criticality and vulnerability assessment, risk analysis, and program reviews.\n --Coordinated, monitored and facilitated Antiterrorism training/seminars and exercise program.\n --Developed and implemented random protective measures and drills.\n --Intergraded with FBIâ\u0080\u0099s intelligence fusion cell; resulted in actionable intelligence to better protect work force.\n --Organized 1st Command in USACE to conduct a terrorist incident alerting system exercise. Commended as a Best Practice.\n --Expertise led to two government employees receiving consecutive Antiterrorism Honor Roll Awards.", "location": "San Francisco, California", "title": "Senior Security Operations Analyst", "startedOn": {"month": 7, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:13309"}, {"posId": 467035885, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "Systems Planning and Analysis, Inc", "description": "-Regional physical security expert to the South Pacific Division, United States Army Corp of Engineers (USACE)\n --Advised Regional Director and four subordinate units on the security of $1.45B military and civil works assets and 2,322 civilian and military engineers, scientists, project managers and technical experts.\n --Analyzed security issues impacting critical infrastructure and government offices across 10 states.\n --Recommended mitigation policies and/or projects to prevent unauthorized access to government resources and personnel protecting against terrorism, criminal activities, espionage and other risks.\n --Liaisons with Federal, state & local law enforcement/security agencies as required for daily operations.\n --Reviewed plans for proposed or new projects to assure the presence of adequate planning for security.\n --Performed risk analysis, identified, recommended & documented mission essential/vulnerable/restricted areas.\n --Established Divisionâ\u0080\u0099s first Facility Security Committee; transitioned 150 standalone facilities from Uniformed Facilities Criteria to Interagency Security Committee Standards. \n-Team Leader, Physical Security inspections and AT/FP Vulnerability & Risk Assessments\n --Assessed assets vulnerability to espionage, sabotage, terrorism, damage, misuse, and theft.\n --Coordinated inspection with Facility Managers, conducts interviews, walk-thru for observation, writes reports, and provides in/out-brief presentations. \n --Documented inspections and survey data, analyzes risk and identifies associated mitigation project cost.\nIdentified/cleared 50 backlogged vulnerability/PS inspections at critical infrastructure & government offices\n --Region-wide recommendations accepted and funded $500K+ to reduce risk and mitigate vulnerabilities.", "location": "San Francisco, Ca", "title": "Senior Security Operations Analyst", "startedOn": {"month": 9, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:13309"}, {"posId": 703869389, "new": false, "current": false, "endedOn": {"month": 9, "year": 2013}, "companyName": "USAF RETIRED", "description": "-Among the top 2.5 percent of the Air Force's total active duty enlisted force to achieve the E-8 rank.\n-Expert at merging subordinates talents, skills, and resources with other teams' functions to effectively accomplish task.", "title": "Senior Master Sergeant", "startedOn": {"month": 8, "year": 1987}, "companyUrn": "urn:li:fs_salesCompany:1400617"}, {"posId": 336172229, "new": false, "current": false, "endedOn": {"month": 8, "year": 2013}, "companyName": "Directorate of Security Forces HQ United States Air Force", "description": "-Provided risk management and policy development for the deployment of 34,000 USAF Security Forces. \n-Managed Directorates task management tool, coordinate congressional responses and overseas defense travel system.\n-Directly accountable for demonstrating a high degree of initiative, sound judgment, and problem solving abilities to plan, prioritize, and coordinate the development, implementation, and administration of security forces plans. Charged with a multitude of projects, duties, and responsibilities including physical, asset, and executive safety and security, emergency preparedness, training and instruction, investigations, analysis, and strategic planning.\n-Collaborated with and support cross-functional teams and departments to identify, track, and develop mitigation strategies for both actual and emerging physical and personnel threats and risks to the operation.\n-Examined operations and provided procedural recommendations, formulated policy, and created and implemented new strategies. Worked successfully with senior executive leadership to continuously improve security operations.\n-Recognized by leadership for anticipating problems and presenting effective solutions and recommendations, team building and motivation, exceeding expectations, and consistently delivering outstanding results.", "location": "Directorate of Security Forces, Pentagon, Washington DC", "title": "Manager, Contingency Operations", "startedOn": {"month": 10, "year": 2010}}, {"posId": 408484889, "new": false, "current": false, "endedOn": {"month": 7, "year": 2012}, "companyName": "United States Air Force Security Forces", "description": "Advised management/supervisors in identifying and retaining a high-quality and diverse workforce. \nDeveloped/administered awards programs, advised on matters concerning conduct, performance, and dispute resolution.", "location": "Multiple locations", "title": "Human Resource Manager", "startedOn": {"month": 1, "year": 2002}, "companyUrn": "urn:li:fs_salesCompany:2415927"}, {"posId": 362764505, "new": false, "current": false, "endedOn": {"month": 10, "year": 2010}, "companyName": "Joint Task Force 435", "description": "-Reported directly to Director as advisor, provided team leadership, motivation, and direction for 39-person staff responsible for 700+ guard force, coordinated security response to emergencies and other unusual situations involving detainee operations; collaborated with leadership team and security staff to skillfully resolve matters.\n-Develop, implement, and oversee comprehensive security operations and training. Create security policies and procedures as well as conduct various investigations and risk assessment and mitigation. \n-Oversaw 12 contract/4 military executive protection agents; planned security details for 2 military/1 civilian State Department senior executive and their 120-person joint military/civilian staff.\n-Conducted force protection vulnerability assessment on prisons resulting in over $223 thousand in upgrades.", "location": "Kabul, Afghanistan", "title": "Senior Operations Manager (Deployment)", "startedOn": {"month": 2, "year": 2010}}, {"posId": 362706999, "new": false, "current": false, "endedOn": {"month": 2, "year": 2010}, "companyName": "Headquarters Air Combat Command/A7S", "description": "Directly responsible for the assessment, coordination, and facilitation of physical security programs for 15 USAF bases to protect 3.6 million acres of federal property and $500B in Department of Defense resources.\n-Traveled abroad to conduct detailed site surveys, created security plan for drones valued at $267 million, and conducted force protection site surveys on prisons resulting in over $223 thousand in upgrades.\n-Conducted thorough inspections on mobility, communication, and support equipment and materials assigned to security forces. Suggested and implemented multiple physical security enhancements and improvements.", "location": "Langley AFB, VA", "title": "Program Manager Integrated Defense", "startedOn": {"month": 8, "year": 2008}}, {"posId": 362709577, "new": false, "current": false, "endedOn": {"month": 7, "year": 2008}, "companyName": "569th United States Forces Police Squadron", "description": "-Supervised a 65-person multi-disciplined team, developing vehicle registration, law enforcement, and security policies and procedures, and processing and analyzing crime reports for largest military community outside of the US. Devised protective plans for the largest Air Force police services mission and security operations.\n-Planned/managed the sections budget to include the spend plan; justified/prioritized new funding requirements\n-Charged with a multitude of projects, duties, and responsibilities including physical, asset, and executive safety and security, emergency preparedness, training and instruction, investigations, analysis, and strategic planning.\n-Led transformation project; eliminated 11K man-hours per year to register vehicles, saved government $33K.", "location": "Vogelweh AB, GE", "title": "Superintendent, Plans/Programs", "startedOn": {"month": 5, "year": 2007}}, {"posId": 362710692, "new": false, "current": false, "endedOn": {"month": 5, "year": 2007}, "companyName": "U.S. Central Command", "description": "Deployed overseas to manage a joint service team of 28 Protective Security Specialists. Analyzed intelligence reports and planned, convoy and static security operations in high risk situations.", "location": "As Sayilyah, Qatar", "title": "Protective Services Detail Team Manager (Deployment)", "startedOn": {"month": 10, "year": 2006}}, {"posId": 362779619, "new": false, "current": false, "endedOn": {"month": 10, "year": 2006}, "companyName": "569th United States Forces Police Squadron", "description": "-Controlled and directed a 393-person police and security force responsible for securing $1.2 billion in Air Force resources and protecting 53,000 Americans across 1,150 square miles.\n-Assigned work, set priorities, and reviewed and evaluated work and performance of subordinates; coached and developed employees; recommended corrective or disciplinary actions. \n-Collaborate with and support cross-functional teams and other federal agencies to identify, track, and develop mitigation strategies for both actual and emerging physical and personnel threats and risks to the operation.", "title": "Operations Security Manager", "startedOn": {"month": 7, "year": 2005}}, {"posId": 362808283, "new": false, "current": false, "endedOn": {"month": 7, "year": 2005}, "companyName": "3 Security Forces Squadron", "description": "-Managed 4 sections (Police Services, Confinement, Visitor Control, Reports & Analysis) supervised 25 people. \n-Provided oversight/law enforcement guidance to a 200-person force, developed & implemented crime prevention and traffic enforcement plans, analyzed crime statistics/trends serving a population of 26,000. \n-Identified traffic/safety concerns; devised traffic enforcement plan, invigorated police force & focused efforts to reduce violations by 24%; exceeded goal by 4%. Communityâ\u0080\u0099s safety remarkably improved expeditiously.", "location": "Elmendorf AFB, AK", "title": "Superintendent, Police Services, First Sergeant, Electronic Security System Manager", "startedOn": {"month": 6, "year": 2001}}], "pictureInfo": {}, "relatedColleagueCompanyId": 22344726, "savedLead": false, "firstName": "David", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/david-byrd-8b931260", "location": "San Francisco Bay Area"}