{"lastName": "Eagan, CPA, PMP, CGFM", "objectUrn": "urn:li:member:71350897", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Accounting", "educations": [{"endedOn": {"year": 1994}, "fieldsOfStudy": ["Accounting w/Concentration in Taxation"], "school": "urn:li:fs_salesSchool:18130", "degree": "MAcc", "schoolName": "University of South Florida", "startedOn": {"year": 1993}, "eduId": 51428501}, {"endedOn": {"year": 2005}, "fieldsOfStudy": ["Quality Systems Management"], "degree": "Master of Science", "schoolName": "National Graduate University", "startedOn": {"year": 2004}, "eduId": 51428589}, {"endedOn": {"year": 1993}, "fieldsOfStudy": ["Accounting"], "school": "urn:li:fs_salesSchool:18130", "degree": "BS", "schoolName": "University of South Florida", "startedOn": {"year": 1991}, "eduId": 51428426}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAARAunEB3P-pmd9p6grlfIMlbuk3X0oHxmA,NAME_SEARCH,undefined)", "numOfConnections": 325, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEyJa5FjjYDeg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=czOWLlo2mpQZCbYRIxkmLYr6SXfIYrz9hLDzEGnWUYo", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEyJa5FjjYDeg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=1cWs1gMIVWU9HePZ2b_7X03sts-Wh2O-OpVl8nIA3j0", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEyJa5FjjYDeg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=ACSAhiLqTufbunlsoMw0Wan-9KtVIrcRf8jhZXOZNZA", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEyJa5FjjYDeg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=rKgaBy99cUf0qNVCh6JsApqkaLvd99rW_sv6z19duL4", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Budget Analyst & Section Chief, Investments and Financial Management at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Seeking partnership with a company that can utilize my variety of unique skill sets in leadership, operational planning, executive management, full business development, accounting, budget, internal controls, computers, software, systems, verbal and written communications, taxation, and business management.  Ready to roll up my sleeves and dive into work with passion and excitement in an organization that wants to make a substantial affect in its market.  Let me add to your company's success by bringing critical  accounting, project management, financial and executive skills to help your organization move to the next level.", "pendingInvitation": false, "defaultPosition": {"posId": 158217486, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢\tOversee complete spectrum of financial management operations spanning $400M budget analysis and administration, portfolio management, financial statement preparation, funds management, internal controls, and creation of project cost worksheets and detailed spend plans.\nâ\u0080¢\tPrepare monthly, quarterly, and year-end financial reports with metrics comparing planned-to-actual obligations, and leverage results to plan following yearâ\u0080\u0099s budget. \nâ\u0080¢\tEstablish and standardize internal controls for funds certification, travel approvals, and purchase cards.\nâ\u0080¢\tMaintain up-to-date cash position templates to accurately determine burn rates on over 75 active contracts involving equipment and services.  \nâ\u0080¢\tClarify requirements for development of new web-based financial and acquisition management tool, and assist technical project manager by contributing strong expertise in Scrum and Agile methodology. ", "location": "Washington DC", "title": "Budget Analyst & Section Chief, Investments and Financial Management", "startedOn": {"month": 12, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Dan Eagan, CPA, PMP, CGFM", "positions": [{"posId": 158217486, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢\tOversee complete spectrum of financial management operations spanning $400M budget analysis and administration, portfolio management, financial statement preparation, funds management, internal controls, and creation of project cost worksheets and detailed spend plans.\nâ\u0080¢\tPrepare monthly, quarterly, and year-end financial reports with metrics comparing planned-to-actual obligations, and leverage results to plan following yearâ\u0080\u0099s budget. \nâ\u0080¢\tEstablish and standardize internal controls for funds certification, travel approvals, and purchase cards.\nâ\u0080¢\tMaintain up-to-date cash position templates to accurately determine burn rates on over 75 active contracts involving equipment and services.  \nâ\u0080¢\tClarify requirements for development of new web-based financial and acquisition management tool, and assist technical project manager by contributing strong expertise in Scrum and Agile methodology. ", "location": "Washington DC", "title": "Budget Analyst & Section Chief, Investments and Financial Management", "startedOn": {"month": 12, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 465242008, "new": false, "current": false, "endedOn": {"month": 7, "year": 2014}, "companyName": "USN Coastal Riverine Squadron EIGHT", "description": "â\u0080¢\tHelmed training and operations planning for unit of over 500 personnel located in five States. \nâ\u0080¢\tManaged all aspects of Coast Guard human capital including diversity, goal setting, performance management and evaluations.\n", "location": "Newport, RI", "title": "Plans Chief & Senior Reserve Officer, Commander, USCGR", "startedOn": {"month": 1, "year": 2011}}, {"posId": 115910231, "new": false, "current": false, "endedOn": {"month": 12, "year": 2010}, "companyName": "Enterprise Information Services", "description": "â\u0080¢\tDelivered project and financial management services for Coast Guard patrol boat mission effectiveness project and medium endurance cutter mission effectiveness initiative. \nâ\u0080¢\tAdvised management on accounting principles required by accounting standard boards, controlled $475M budget, and authored policy and procedures to implement new processes.\nâ\u0080¢\tEvaluated financial systems to ensure rigorous compliance with federal laws and regulations.\nâ\u0080¢\tCompiled financial reports and general ledger for key stakeholders to enhance planning activities. \nâ\u0080¢\tSupported short and long-range planning and recommended process improvements to senior management to increase program efficiency.\nâ\u0080¢\tAdeptly prepared acquisition plans, acquisition program baselines, resource impact assessments, life cycle cost estimates, analysis of alternatives, resource proposals, business cases, and project plans.\nâ\u0080¢\tIntroduced new reporting for capitalization and asset valuation to meet requirements of auditors and expedite process to completion which substantially improved Coast Guard audit compliance.", "location": "Washington, DC", "title": "Business Financial Manager", "startedOn": {"month": 1, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:55097"}, {"posId": 163547385, "new": false, "current": false, "endedOn": {"month": 3, "year": 2009}, "companyName": "U.S. Coast Guard, Deployable Operations Group", "description": "â\u0080¢\tSupervised three personnel and delivered expertise in project management, policy development, technical writing, and liaising with other government agencies.\nâ\u0080¢\tLeveraged sound knowledge of federal budget process to write requirements for funding deficiencies.", "location": "Arlington, VA", "title": "Branch Chief, Plans, Policy & Procedures", "startedOn": {"month": 7, "year": 2007}}, {"posId": 163548585, "new": false, "current": false, "endedOn": {"month": 6, "year": 2007}, "companyName": "Policy & Planning Directorate, U.S Coast Guard Headquarters", "description": "â\u0080¢\tSpearheaded financial operations encompassing budget formulation and execution, policy & procedure development, internal controls, funds management, and accounting system administration.\nâ\u0080¢\tFunctioned as contracting officer technical representative (COTR) for large consulting contract.\nâ\u0080¢\tProduced management reports, provided prudent spending recommendations and decisions, determined proper funding sources, and effectively assigned accounting strings to payroll system.\nâ\u0080¢\tAs Workforce Manager, oversaw human capital for new Directorate of 60 personnel including writing job descriptions, hiring, organizational charts, arranging training, and setting up financial systems.\nâ\u0080¢\tOrchestrated major office move with no gap in services and requiring expeditious set-up of 30 workstations and related office equipment.", "location": "Washington, DC", "title": "Financial Operations & Workforce Manager", "startedOn": {"month": 7, "year": 2004}}, {"posId": 163549014, "new": false, "current": false, "endedOn": {"month": 6, "year": 2004}, "companyName": "U.S. Coast Guard, Reserve Policy & Programs", "description": "â\u0080¢\tManagement Analyst for the US Coast Guard national reserve force\nâ\u0080¢\tDeveloped and directed implementation of policies and programs that ensured adequate numbers, rates & ratings of personnel to meet operational commitments\nâ\u0080¢\tExamined raw data, conducted queries and analyses, and identified challenges in support programs and initiatives set forth by the USCG Commandant. \nâ\u0080¢\tAnalyzed personnel data records of over 73,000 active, reserve, retired and discharged Coast Guard personnel; used experience as CPA to assist reserve financial manager with specialized management reports.\nâ\u0080¢\tLocated errors and mismatches between different data bases and instigated major changes in data collection to correct reporting of readiness to Pentagon for National Defense personnel accounting.", "location": "Washington, DC", "title": "Management Analyst", "startedOn": {"month": 2, "year": 2003}}, {"posId": 163549676, "new": false, "current": false, "endedOn": {"month": 2, "year": 2003}, "companyName": "Port Security Unit 307, U.S. Coast Guard Reserves", "description": "â\u0080¢\tSystematically executed operational plans in support of Operation Enduring Freedom during six-month mobilization to Guantanamo Bay, Cuba.\nâ\u0080¢\tDirected transport of boats and equipment from Florida to Boston Harbor following 9/11 tragedy.\nâ\u0080¢\tIdentified gaps in force protection to improve security in role as Anti-Terrorism/Force Protection officer.\nâ\u0080¢\tAs Intelligence Officer, critically determined vulnerabilities and devised strategies to mitigate risks. ", "location": "Tampa/St. Petersburg, Florida Area", "title": "Operations Manager", "startedOn": {"month": 2, "year": 1999}}, {"posId": 163550287, "new": false, "current": false, "endedOn": {"month": 6, "year": 2002}, "companyName": "Entertainment Management Resource Group", "description": "â\u0080¢\tEstablished, launched, and operated practice to handle financial needs for touring and merchandising corporations, publishing partnerships, and recording companies.\nâ\u0080¢\tSpearheaded new business development to secure three platinum recording artists in first year.\nâ\u0080¢\tReviewed recording, publishing, and merchandising contracts to identify fund sources, estimated amounts and timing, and identified royalty payouts between publishers, writers, and performers. \nâ\u0080¢\tSet up bank accounts to collect clientsâ\u0080\u0099 royalties, advances, and tour and merchandise income.\nâ\u0080¢\tGenerated monthly income and expense statements, distributed income to artists according to contracts, managed investments, coordinated payroll, prepared touring budgets, and trained road crews in cash management, accounting, and reporting procedures.\nâ\u0080¢\tCooperated with vendors to provide buses, practice venues, equipment, transportation and crews for touring, and advised tour/road managers in logistics, per diems, petty cash, hotel advances, and cash deposits. \nâ\u0080¢\tPaid quarterly taxes for payroll and income, filed annual federal and multi-state tax returns for corporations, partnership, and sole proprietorships, and advised artists in financial decisions and major purchases.", "location": "St. Petersburg, Fl", "title": "Business Manager / CFO", "startedOn": {"month": 3, "year": 1999}}, {"posId": 158214908, "current": false, "endedOn": {"year": 2000}, "companyName": "Stainless Music, Inc", "description": "â\u0080¢\tScheduled and budgeted recording, touring and merchandising. \nâ\u0080¢\tPrepared initial contracts for recording, publishing,  merchandising and touring. \nâ\u0080¢\tNegotiated with third party attorneys on recording agreements.  \nâ\u0080¢\tManaged investor monies to account for share percentages and return on investment.  \nâ\u0080¢\tMet with investors, suppliers and potential purchasers to negotiate funds, settle accounts and present potential returns based on investments.\nâ\u0080¢\tCounseled artists on funds management and educated on credit building and financial investments.\nâ\u0080¢\tIdentified and recruited high profile executive from recording industry to mentor CFO and CEO on artist and company management and contractual procedures.", "location": "St. Petersburg, FL", "title": "CFO (Part time)", "startedOn": {"year": 1996}}, {"posId": 163550993, "new": false, "current": false, "endedOn": {"month": 2, "year": 1999}, "companyName": "Cherry Bekaert & Holland, LLP", "description": "â\u0080¢\tResponsible for tax planning and preparation for high-income individuals, partnerships and corporations. \nâ\u0080¢\tResearched tax laws for specific tax events to minimize the impact of taxation to the benefit of clients.\nâ\u0080¢\tIdentified multi-state tax consequences to determine lowest tax impact between state and federal laws.\nâ\u0080¢\tWorked with audit staff during off-season and assisted on audits of public and regulated companies\nâ\u0080¢\tCustomized audits for recurring clients to meet generally accepted auditing standards (GAAP)\nâ\u0080¢\tDeveloped and managed entertainment practice to oversee financial and compliance aspects of entertainment companies for recording, filming, touring and merchandising\nâ\u0080¢\tSupervised and trained bookkeeping personnel for firm and client to follow GAAP and prepare books for tax basis.\nâ\u0080¢\tPrepared federal, multi-state and local tax returns, researched tax laws and any IRS statements for minimal impact on tax.", "title": "Tax Senior / Business Manager", "startedOn": {"month": 12, "year": 1994}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Dan", "numOfSharedConnections": 0, "memberBadges": {"premium": true, "openLink": true, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/dan-eagan-cpa-pmp-cgfm-041a8b1b", "location": "Washington D.C. Metro Area"}