{"lastName": "Smith", "objectUrn": "urn:li:member:88722211", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2011}, "fieldsOfStudy": ["Accounting"], "school": "urn:li:fs_salesSchool:18064", "degree": "Accounting", "schoolName": "Howard University", "startedOn": {"year": 2006}, "eduId": 56309417}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Accounting"], "school": "urn:li:fs_salesSchool:18064", "degree": "MBA", "schoolName": "Howard University", "startedOn": {"year": 2006}, "eduId": 56310082}, {"schoolName": "Howard Accounting Career Awareness Program", "eduId": 143081942}, {"fieldsOfStudy": ["Accounting\tBBA"], "school": "urn:li:fs_salesSchool:18064", "degree": "Master of Business Administration (M.B.A.)", "schoolName": "Howard University", "eduId": 56310074}, {"schoolName": "Wilson Senior High School", "eduId": 159990976}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAVJyyMBnjyFP-SoZhnTn4fM3Mw_Fj6GNS0,NAME_SEARCH,undefined)", "numOfConnections": 1145, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHitpHCJVs24w/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=G37kUJLy9HbL8peCvdA_ff1osKVK-OTFyqqmrw_dgEc", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHitpHCJVs24w/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=4yQr8VMKqpdKIVA6vOZsQZeLBC4uc-3k5Egsh_61tO8", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHitpHCJVs24w/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=Yz0FjO9Hz7mONub7XaQwo6QYcMjCpDoqVXkFnPNn0LU", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQHitpHCJVs24w/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=_DpXaiXGmL1Ibcc2h9GfgPZDdl24r_MA3uiLgvKOFQE", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Senior Accountant at Transportation Security Administration (TSA)", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 1098461358, "new": false, "current": true, "companyName": "DC Government", "description": "Elected in the 2016 General Election with 41% of the vote for a 2-year term between January 2, 2017 and January 2, 2019, representing approximately 2,000 residents in Single Member District 7E06. Currently serving as Treasurer of the 7E Commission as well.\n\nAdvisory Neighborhood Commissions are bodies of local government in Washington, D.C. Created in 1974 through a District referendum in the District of Columbia Home Rule Act. ANC's are responsible for considering a wide range of policies and programs affecting the neighborhoods of 2000 constituents. These areas include traffic, parking, recreation, street improvements, liquor licenses, zoning, economic development, police protection, sanitation and trash collection, and the District's annual budget.", "location": "Washington D.C. Metro Area", "title": "Advisory Neighbohood Commissoner - 7E", "startedOn": {"month": 1, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:6314"}, "degree": 3, "fullName": "Dontrell Smith", "positions": [{"posId": 1098461358, "new": false, "current": true, "companyName": "DC Government", "description": "Elected in the 2016 General Election with 41% of the vote for a 2-year term between January 2, 2017 and January 2, 2019, representing approximately 2,000 residents in Single Member District 7E06. Currently serving as Treasurer of the 7E Commission as well.\n\nAdvisory Neighborhood Commissions are bodies of local government in Washington, D.C. Created in 1974 through a District referendum in the District of Columbia Home Rule Act. ANC's are responsible for considering a wide range of policies and programs affecting the neighborhoods of 2000 constituents. These areas include traffic, parking, recreation, street improvements, liquor licenses, zoning, economic development, police protection, sanitation and trash collection, and the District's annual budget.", "location": "Washington D.C. Metro Area", "title": "Advisory Neighbohood Commissoner - 7E", "startedOn": {"month": 1, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:6314"}, {"posId": 754563596, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington, District Of Columbia", "title": "Senior Accountant - Office Assurance Compliance CFO", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1132534674, "new": false, "current": false, "endedOn": {"month": 3, "year": 2018}, "companyName": "Transportation Security Administration (TSA)", "description": "Senior Accountant within Internal Controls and Audit Policy Branch", "location": "Alexandria, Virginia", "title": "Senior Accountant", "startedOn": {"month": 11, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 568465829, "new": false, "current": false, "endedOn": {"month": 1, "year": 2016}, "companyName": "Internal Revenue Service", "description": "â\u0080¢Review and interpret federal legislation, rules, standards, and regulations pertaining to accounting financial management.\nâ\u0080¢Analyze and evaluate agency-wide accounting operations, policies, procedures, and systems for compliance with standards and internal controls.\n\nâ\u0080¢Design, implement, and assess internal control processes and systems pertaining to agency-wide accounting and financial management activities.\n\nâ\u0080¢Prepare, analyze, interpret, review, and present accounting data, reports, and financial statements. Provide high-level technical support to the financial statement audit.\n\nâ\u0080¢Apply cost accounting methods to agency-wide data and systems, in partnership with business units, to report the cost of major activities for management information purposes.", "title": "Senior Staff Accountant - A 123 Internal Controls", "startedOn": {"month": 8, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:4922"}, {"posId": 549052346, "new": false, "current": false, "endedOn": {"month": 8, "year": 2014}, "companyName": "Department of Commerce, Office of Inspector General", "description": "â\u0080¢Plans work requirements to meet assigned audit objectives to include assisting the audit manager in developing time frames and resources needed to complete the assignment;\n\nâ\u0080¢Assist the auditor-in-charge and audit manager in briefing management at entrance conferences to explain audit objectives, procedures, and scope, and to obtain management's input.\n\nâ\u0080¢Assist with the  develop and write various audit documents which includes audit proposals to include scope and objectives of prospective audits, areas of guides or programs for agency-wide audits, and major areas or sections of reports.\n\nâ\u0080¢Apply accounting and auditing standards necessary to conduct broad audit assignments requiring an integrated analysis of a large number and variety of different operational programs and accounting systems.\n\nâ\u0080¢Assist with the development of audit plans that assess the compliance, efficiency, and effectiveness of Department of Commerce programs and using auditing software to manage audit implementation.\n\nâ\u0080¢Collect, organize, and analyze several of information using statistical methods and software compiled from document reviews, interviews, observation, and electronic data. \n\nâ\u0080¢Documents work in accordance with generally accepted auditing standards and generally accepted government auditing standards while assisting and management analyze position on audit results.\n\nâ\u0080¢Effectively communicate both in-person and in writing, with audit management and auditees when views inconsistent with audit findings are presented in addition to addressing management concerns and rebuttals.", "location": "Washington DC", "title": "Financial Statement Auditor", "startedOn": {"month": 6, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:255055"}, {"posId": 347894698, "new": false, "current": false, "endedOn": {"month": 6, "year": 2014}, "companyName": "US Census Bureau", "description": "â\u0080¢Prepares a variety of financial reports to include; identifying and resolving discrepancies in reported data; continually reviews and improves internal controls. Conduct a series of financial analyses by reviewing, evaluating and validating financial data.\n\nâ\u0080¢Utilize professional accounting and auditing knowledge, skills and ingenuity in devising an approach to perform various assignments to maintain oversight for implementing appropriate laws, directives and regulations of internal control programs and procedures.\n\nâ\u0080¢Assist in establishing and monitoring internal controls to identify problems area, determine actions required, improved operating program effectiveness, and ensure and maintain the integrity of the U.S. census Bureau's financial and accounting information.\n\nâ\u0080¢Analyze current accounting procedures to create and/or revise current processes. Validate to current process with respect to regulatory requirements and answers questions related to audits.\n\nâ\u0080¢Conduct thorough and accurate research and testing of systems as necessary. \n\nâ\u0080¢Daily provides timely and accurate responses to requests", "title": "Accountant", "startedOn": {"month": 12, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:7811"}, {"posId": 142789506, "new": false, "current": false, "endedOn": {"month": 12, "year": 2012}, "companyName": "Grant Thornton LLP", "description": "â\u0080¢Audit transaction cycles, including cash, purchasing, investments, capital expenditures, as well as other income and expenses.\n\nâ\u0080¢Review federal contracts to verify completeness and cutoff errors with fund balances\n\nâ\u0080¢Conduct internal analysis of federal contracts and samples to begin testing\n\nâ\u0080¢Identify client operations, processes, and business objectives and utilize that knowledge on engagements.\n\nâ\u0080¢Perform audit procedures for various accounts to verify accuracy with Statement of Budgetary Resources and the accounting systems used\n\nâ\u0080¢Analyze financial statements, audit and tax related issues\n\nâ\u0080¢Substantive testing and auditing of data provided by client\n\nâ\u0080¢Recovery fund testing to verify valid downward adjustments in proper accounts", "location": "Alexandria, VA", "title": "Associate", "startedOn": {"month": 1, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:2432"}, {"posId": 288472051, "new": false, "current": false, "endedOn": {"month": 12, "year": 2011}, "companyName": "Kearney & Company", "description": "â\u0080¢Audited travel vouchers to ensure the correct amounts are claimed as well as the correct supporting documentation are submitted according to the General Services Administration requirements\n\nâ\u0080¢Assisted in the testing of the transformation period from Unified  Financial  Management System into the E-Gov systems to ensure only the required items needed to be processed and approve are entered into the system\n\nâ\u0080¢Processed and approved the entire government agency travel vouchers that are under $3000.\n\nâ\u0080¢Processed and approved all agency invoices for contracts  in respect to companies that begins with the letters E and M\n\nâ\u0080¢Served as the team lead for all government miscellaneous reimbursements claims throughout the agency\n\nâ\u0080¢Effectively decreased an invoice over 10 million dollars past due and currently update with the outside vender   \n\nâ\u0080¢Conducted external accounting reviews of government funded programs for various federal agencies \n\nâ\u0080¢Gather and submitted samples used in testing sustainable testing for Accrual Project for all open receivers that has yet be processed and paid\n\nâ\u0080¢Semimonthly generated the spreadsheet complied of all of the entire invoice team outstanding invoices ranging from 30 â\u0080\u0093 45 days past due thatâ\u0080\u0099s missing receivers\n\nâ\u0080¢Monthly generated the undisbursed payments in Business Object reports in regards to the UFMS system", "location": "Alexandria, VA", "title": "Staff Accountant", "startedOn": {"month": 6, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:35088"}, {"posId": 288472343, "new": false, "current": false, "endedOn": {"month": 5, "year": 2011}, "companyName": "Trinity Washington University", "description": "â\u0080¢Review and prepare cash receipt deposits and journal entries for all student transactions including processing and transmitting bank deposits and reconciling cash receipt batches to source documents\n\nâ\u0080¢Document and create flowcharts of the processes within the Business Office related to cash receipts and accounts receivable\n\nâ\u0080¢Assist with the matching of vendor invoices to purchase orders and receiving information from individual departments\n\nâ\u0080¢Perform a weekly reconciliation of enrollment deposits between accounts receivable sub-ledger and Admissions source documents\n\nâ\u0080¢Assist in managing escheat process, including processing of stale check letters, completing required reports, and preparing of remittances to DC", "title": "Accountant", "startedOn": {"month": 11, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:281720"}, {"posId": 142790395, "new": false, "current": false, "endedOn": {"month": 10, "year": 2010}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Designed a database system for storage of internal facility request used to maintain daily count of request processed and completed\n\nAssemble data continuity analysis that is used to compare the active government vehicles use on the field, ensuring that they have the appropriate purchase card for the vehicles \n\nEffectively record and document received invoices to match recently acquired fleet government vehicles that are used in the field of work\n\nRecord Reports of Survey inventory in excel database to ensure all unaccountable assets are documented effectively for internal audits which was sent to the National Board of Survey for final decision to determine if government should be liable for misuse of government property", "title": "Chief Financial Office of Asset Management", "startedOn": {"month": 9, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 142790396, "new": false, "current": false, "endedOn": {"month": 9, "year": 2009}, "companyName": "U.S. Department of Justice", "description": "â\u0080¢Developed a strategic plan to oversee the successful operation of a Litigation Technology Unit that helped in the maintenance and order of all graphics, maps, and audio videos\n\nâ\u0080¢Maintained Access database of daily court cases to ensure that projects were completed and accounted for by the appropriate due date\n\nâ\u0080¢Established an efficient system to move projects through the preparation for and execution of the graphics process ending with delivery to the Assistant United States Attorneys\n\nâ\u0080¢Trained and monitored the performance of staff  through employee development to ensure requests process were functioning properly", "title": "Student Intern", "startedOn": {"month": 5, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:3564"}, {"posId": 142790397, "new": false, "current": false, "endedOn": {"month": 5, "year": 2009}, "companyName": "U.S. Department of Justice", "description": "â\u0080¢Assisted attorneys with reimbursement and travel vouchers to ensure all documents were submitted to be processed\n\nâ\u0080¢Handled critically sensitive information and the security of courtâ\u0080\u0099s documents when traveling to the Department of State as well as the appropriate embassy to ensure the extradition and mutual legal assistance treaty was signed \n\nâ\u0080¢Efficiently handled communication correspondence for 400+staff which effectively connected calls to attorneys\n\nâ\u0080¢Organized and recorded daily inventory for more that 400+ employees", "title": "Intern Criminal Division", "startedOn": {"month": 4, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:3564"}], "pictureInfo": {}, "relatedColleagueCompanyId": 6314, "savedLead": false, "firstName": "Dontrell", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/dontrell-smith-a5786725", "location": "Washington D.C. Metro Area"}