{"lastName": "Collick", "objectUrn": "urn:li:member:23901500", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2012}, "fieldsOfStudy": ["Homeland Security (Counterterrorism)"], "school": "urn:li:fs_salesSchool:21142", "degree": "MBA", "schoolName": "Northcentral University", "startedOn": {"year": 2009}, "eduId": 75515483}, {"endedOn": {"year": 2003}, "fieldsOfStudy": ["Government"], "school": "urn:li:fs_salesSchool:18762", "degree": "Bachelor of Science", "schoolName": "Campbell University", "startedOn": {"year": 1999}, "eduId": 20462565}, {"endedOn": {"year": 1997}, "fieldsOfStudy": ["Intelligence Studies"], "schoolName": "Joint Military Intelligence College", "startedOn": {"year": 1996}, "eduId": 75515484}, {"endedOn": {"year": 1980}, "fieldsOfStudy": ["College Preparatory"], "degree": "High School Diploma", "schoolName": "Cardinal Spellman High School", "startedOn": {"year": 1976}, "eduId": 75515501}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAFstTwB2am_YkdRhztMGrIVN7W2byzJXSg,NAME_SEARCH,undefined)", "numOfConnections": 173, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHO5V2FTG8I2A/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=8QUk_RhR7qGF-s68DLiuxqFx5mfQIC7gunfxhgAI6f0", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHO5V2FTG8I2A/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=7J-i_L4mP-DkEDktCbREWTpLvlgrTsu6R4qXtjjvRcs", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHO5V2FTG8I2A/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=FVxHDm3oXOBEWQhzR-yl9mH8xlAPWGbHqadXPWIixIk", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHO5V2FTG8I2A/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=RhzxNdkDKPyU6POUKGi6HtQIrjSev_yG4Xb1Z2QbfO0", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Section Chief at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Former Arabic Linguist with over 30 years of Intelligence experience and over ten consecutive years analyzing al-Qaâ\u0080\u0099ida, al-Qaâ\u0080\u0099ida in the Arabian Peninsula and affiliated groups seeking a position as a Senior Intelligence Analyst or manager within the Homeland Security Community of Interest.  Recognized as an expert maritime threat analyst and Subject Matter Expertise on transnational threats, Islamic culture, and Middle Eastern geopolitical issues, particularly those related to Yemen.  Currently serving as a Section Chief and Senior Intelligence Analyst for an Intelligence Section of 13 Intelligence Research Specialists.  Possess a BS in Government, MBA in Homeland Security, and was recently inducted into the Delta Mu Delta International Honor Society in Business.\n\nSenior Intelligence Analyst with extensive experience in counter-terrorism and international maritime security issues in support of U.S. Coast Guard operations, throughout the world.\n\nSpecialties: Transnational Terrorism; Middle Eastern Studies; Homeland Security; Yemen", "pendingInvitation": false, "defaultPosition": {"posId": 366584448, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Supervise several teams of mid-level and junior analysts and act as Unit's Senior Intelligence Analyst. Responsible for ensuring all reports meet established standards and are written in response to specific information needs.  Provide administrative oversight and professional mentorship of multiple analysis teams.  Duties include:\n    - Assisting each employee with the development of their Individual Development Plans \n    - Develop Performance Work Plans for each employee, submit/track training requests, approve leave, overtime, compensatory time, and hours worked, and authorize official travel requests.\n    - Approve and submit all external Requests for Information (RFI) for the Illicit Travel Unit.\n    - Provide operational oversight of team through compilation and submission of weekly activity report (WAR), technical editing of all production, participate in interagency meetings with team members, collaborate with supervisory law enforcement officers to identify their intelligence support requirements.\n     - Provide budgetary input and oversight to ensure employees are able to effectively engage with counterparts throughout the world as well as participate in applicable training.\n    - Counsel and mentor subordinate analysts in areas of training, career progression, formal education, and discipline issues.\n    - Provide tailored job related training to analysts, as required\n    - Provide advice to seniors concerning disciplinary problems, in accordance with appropriate OPM guidelines and ICE policies.\n    - Participate in hiring panels to fill Intelligence Analysis Division billets\n    - Act as Unit Chief as necessary", "title": "Section Chief", "startedOn": {"month": 10, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "John Collick", "positions": [{"posId": 366584448, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Supervise several teams of mid-level and junior analysts and act as Unit's Senior Intelligence Analyst. Responsible for ensuring all reports meet established standards and are written in response to specific information needs.  Provide administrative oversight and professional mentorship of multiple analysis teams.  Duties include:\n    - Assisting each employee with the development of their Individual Development Plans \n    - Develop Performance Work Plans for each employee, submit/track training requests, approve leave, overtime, compensatory time, and hours worked, and authorize official travel requests.\n    - Approve and submit all external Requests for Information (RFI) for the Illicit Travel Unit.\n    - Provide operational oversight of team through compilation and submission of weekly activity report (WAR), technical editing of all production, participate in interagency meetings with team members, collaborate with supervisory law enforcement officers to identify their intelligence support requirements.\n     - Provide budgetary input and oversight to ensure employees are able to effectively engage with counterparts throughout the world as well as participate in applicable training.\n    - Counsel and mentor subordinate analysts in areas of training, career progression, formal education, and discipline issues.\n    - Provide tailored job related training to analysts, as required\n    - Provide advice to seniors concerning disciplinary problems, in accordance with appropriate OPM guidelines and ICE policies.\n    - Participate in hiring panels to fill Intelligence Analysis Division billets\n    - Act as Unit Chief as necessary", "title": "Section Chief", "startedOn": {"month": 10, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 243996226, "new": false, "current": false, "endedOn": {"month": 10, "year": 2012}, "companyName": "Celestar Corporation", "description": "Al Qa'ida in the Arabian Peninsula Subject Matter Expert and HUMINT Issue Manager for Yemen, under contract to DoD.", "title": "Consultant", "startedOn": {"month": 1, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:446414"}, {"posId": 199502101, "new": false, "current": false, "endedOn": {"month": 12, "year": 2011}, "companyName": "Deptartment of Homeland Security", "description": "Senior Intelligence Analyst supervising a team of Intelligence Analysts on the Indications, Watch, and Warning (IWW) Watch at the NOC.  Provides real-time intelligence warning support to the Undersecretary of Homeland Security for Intelligence and her staff as part of a 24 hour watch\n  Advises the NOC Duty Director and Senior Watch Officer of intelligence pertaining to threats in the Homeland and overseas issues of interest with a Homeland impact\n  Identifies, prepares, and sends articles and reporting relating to the DHS missions to various stakeholders within DHS and the component organizations\n  During crisis, coordinates the watch team activities to maximize resources in coordinating intelligence issues within the Intelligence Community and DHS components\n  Routinely reaches out to DHS Components, the IC, Combatant Commanders, and other intelligence stakeholders such as JITF-CT and NCTC to share analysis and identify issues of mutual concern", "title": "Senior Intelligence Analyst", "startedOn": {"month": 3, "year": 2011}}, {"posId": 199502097, "new": false, "current": false, "endedOn": {"month": 3, "year": 2011}, "companyName": "U.S. Coast Guard", "description": "Supervisory Senior Threat Analyst, supervising a team of civilian and military personnel.  Prepares All-Source intelligence threat reporting in support of U.S. Coast Guard international missions, including support to Patrol Forces Southwest Asia (PATFORSWA) and the International Port Security (IPS) Program. \n\nAn expert working knowledge of major transnational terrorist groups in Persian Gulf, Horn of Africa and East Africa regions.  \n\nLead intelligence analyst supporting senior decision-makers on the importation of liquefied natural gas (LNG) from Yemen from September 2008-October 2009, and as a member of a multi-command Coast Guard analysis team from October 2009-2010, initiated intelligence research concerning the same. Research included the geopolitical climate within Yemen's senior political leadership, the internal threats to the Yemeni regime and threats to U.S. Coast Guard personnel operating in Yemen, specifically while operating in ports conducting maritime trade with the U.S.  Additionally, developed significant expertise pertaining to the transnational terrorist groups and individuals operating in or affiliated with those in Yemen. \n\nFormulated and implemented the Adversarial Perspective Team (APT) methodology for the validation of the Port Resilience Operational & Tactical Enforcement to Combat Terrorism (PROTECT), which is under development by the U.S. Coast Guard, University of Southern California, and Purdue University. The APT was tasked with measuring the discernible level of tactical deterrence of PROTECT's randomized patrol schedules against a known adversary.  The secondary goal was to identify, through the adversary's perspective, the tactical deterrence value of purposeful activities conducted during a waterborne patrol at specific national maritime critical infrastructure and key resources (CIKR) in Boston Harbor.", "title": "Senior Threat Analyst", "startedOn": {"month": 11, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:4425"}, {"posId": 199502102, "new": false, "current": false, "endedOn": {"month": 2, "year": 2011}, "companyName": "United States Marine Corps", "title": "Private through First Sergeant", "startedOn": {"month": 2, "year": 1981}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 199502089, "new": false, "current": false, "endedOn": {"month": 11, "year": 2006}, "companyName": "Booz-Allen & Hamilton, Inc", "description": "As a member of the International Shipping and Port Security (ISPS) Program Implementation Team, was responsible for drafting initial policy documents for Intelligence Support to the International Port Security (IPS) Program.  Drafted, edited, and published USCG Atlantic Area's Concept of Operations for Intelligence Support to the International Port Security Program, which identifies the function of intelligence and explains how intelligence supports operations, in accordance with the Maritime Transportation Security Act of 2002 (MTSA). \n \nResearch and collaborate within the Intelligence Community to develop Intelligence Products in support of the USCG International Port Security Liaison Officer Program.  Drafted, edited, and released produce country-specific intelligence assessments which USCG officers require to conduct port surveys in countries which export goods to the United States.  \n\nReceived a Letter of Appreciation after six months in the program for the significant increase in quantity and quality of new products and Meritorious Team Award for contributions in support of the Implementation of the International Port Security Program.", "title": "Associate, Level III", "startedOn": {"month": 4, "year": 2005}}, {"posId": 199502110, "new": false, "current": false, "endedOn": {"month": 4, "year": 2005}, "companyName": "Booz-Allen & Hamilton, Inc", "description": "Research, collaborate, conduct liaison, and provide Intelligence Analysis in support of  both the Joint Personnel Recovery Support Program (JPRSP) and the Prison and Detention Center (P&amp;D) missions.  Participated in the drafting portions of several JPRSP products as well as the command's internal review process which is conducted prior to coordination with the Combatant Commands.  Identified the need to incorporate terrorist related information in all applicable JPRSP products.  \n\nDrafted, coordinated, and edited an 11-page annual Interim Technical Report for this contract, which Booz Allen Hamilton is contractually obligated to submit under the JPRSP Technical Area Task (TAT).", "title": "Senior Consultant, Level II", "startedOn": {"month": 6, "year": 2004}}, {"posId": 125582420, "current": false, "endedOn": {"year": 2005}, "companyName": "Standing Joint Forces Headquarter, Homeland Security", "title": "CT Analyst", "startedOn": {"year": 2003}}, {"posId": 199502112, "new": false, "current": false, "endedOn": {"month": 5, "year": 2004}, "companyName": "Booz-Allen & Hamilton, Inc", "description": "Supervised an 8 member watch section and the preparation of the Intelligence portion of the Commanding General's Daily Update Brief and for the editing each Intelligence product originated within the command.\n\nSubject Matter Expert (SME) on transnational Islamic terrorism.  Responsible for documenting SJFHQ-HLS J2 analytic methodology, using innovative methods to assist in the analytic process and for mentoring analysts in these techniques, which proved successful.  \n\nDrafted, coordinated, edited, and distributed Booz Allen Hamilton's Annual Technical Report for this project to the appropriate recipients within the U.S. Government.  This 13-page all-inclusive report provided specific details pertaining to every task, which Booz Allen Hamilton was contractually obligated to fulfill under this Technical Area Task (TAT).  The report was delivered and accepted by the government ahead of schedule.\n\nAwarded two Certificates of Commendation by the Commanding General and an award of $1,000 from Booz Allen Hamilton for superior performance.", "title": "Senior Consultant, Level II", "startedOn": {"month": 1, "year": 2003}}, {"posId": 199502121, "new": false, "current": false, "endedOn": {"month": 1, "year": 2003}, "companyName": "GG-11", "description": "Exploited documents captured in Afghanistan to provide an understanding of the operational capability, ideology, tactics, and planning of terrorist activity throughout the world to policymakers and to assist in identifying individuals involved in terror. \n\nAnalyzed All-Source Intelligence Material, producing products in support of the Homeland Security mission in combating terrorism and enhancing Force Protection for CONUS military and military related assets.  Additional duty of OSINT coordinator for division.\n\nAwarded the Navy Meritorious Civilian Service Medal and a cash award of $750 for superior performance.", "title": "Intelligence Specialist", "startedOn": {"month": 4, "year": 2002}}, {"posId": 129364409, "current": false, "endedOn": {"year": 2003}, "companyName": "Joint Forces Intelligence Command", "title": "CT Analyst", "startedOn": {"year": 2002}}, {"posId": 47427430, "new": false, "current": false, "endedOn": {"month": 2, "year": 2001}, "companyName": "United States Marine Corps", "description": "Took care of Marines", "title": "First Sergeant", "startedOn": {"month": 2, "year": 1981}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 199502123, "new": false, "current": false, "endedOn": {"month": 2, "year": 2001}, "companyName": "U.S. Marine Corps", "description": "Units included:\t\t\n3d Battalion, 8th Marines\nHeadquarters; As a First Sergeant, was the Senior Enlisted Marine in an infantry company, responsible for supervision of over 175 Marines aboard three ships and during operations in Kosovo.  Initiated, developed and directed a curriculum of Professional Military Education for the company, while deployed.  Coordinated with higher levels of command as needed, with confidence and the ability to execute any mission without direct supervision, using the commander's intent as guidance.\nAwarded Meritorious Service Medal and Combat Action Ribbon", "title": "Instructor", "startedOn": {"month": 2, "year": 1981}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 199502099, "new": false, "current": false, "endedOn": {"month": 6, "year": 1996}, "companyName": "U.S. Army Intelligence School", "description": "Drafted, edited and/or revised Marine Corps Orders (MCO) pertaining to the Foreign Language Program, ensuring it remained consistent with both Marine Corps and DoD doctrine and policy.  Managed a Foreign Language Proficiency Pay (FLPP) budget of over $500,000.\n\nCoordinated training curriculum and policy changes with the members of the Department of Defense Foreign Language Panel to ensure the Marine Corps policies and programs remained consistent with the overall DoD program.  Participated, as the Marine Corps proponent, in Department of Defense panels related to Foreign Language policy, training, and doctrine.\n\nAs the Operations, Control, and Analysis Chief at 2d Radio Battalion, was rated ahead of peers by the Battalion Commander, assigned as the Noncommissioned Officer-in-Charge (NCOIC) of two deploying detachments and as Operations Chief of a third detachment in a tour of 2.5 years.\n\nDuties included supervising several 24-hour analytic watches to ensure quality intelligence products were released to support both the national and tactical intelligence missions.  Was responsible for identifying specific intelligence gaps, utilizing all available resources within the U.S. Intelligence Community to develop specific collection plans designed to fill these gaps.  Briefed senior Marine Corps officers routinely on mission-specific issues in addition to providing intelligence briefs when deployed.  \nAwarded the Navy and Marine Corps Commendation Medal.\n\nWhile assigned; of a Joint Service team responsible for training students from the four services.  Maintained a graduation rate of over 98% while the historical rate was 60%.  An overall class average of 95% was attained after teaching approximately 10 classes with 69% of students completing graduation requirements earlier than their peers.  Created and maintained a basic SIGINT analysis training program to assist entry-level students in identifying critical intelligence.", "title": "Served as Cryptologic Training Chief/Assistant Foreign Language Officer", "startedOn": {"month": 9, "year": 1993}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "John", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/john-collick-a780078", "location": "Washington D.C. Metro Area"}