{"lastName": "Howard, Ph.D.", "objectUrn": "urn:li:member:607989640", "contactInfo": {"websites": [{"category": "COMPANY", "dataSource": "LINKEDIN", "url": "www.jthcoaching.com"}]}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1999}, "fieldsOfStudy": ["Education"], "school": "urn:li:fs_salesSchool:19054", "degree": "Ph.D.", "schoolName": "Syracuse University", "startedOn": {"year": 1996}, "eduId": 459366951}, {"endedOn": {"year": 1991}, "fieldsOfStudy": ["Dynamics of Organization"], "school": "urn:li:fs_salesSchool:19328", "degree": "M.S.", "schoolName": "University of Pennsylvania", "startedOn": {"year": 1987}, "eduId": 459369489}, {"endedOn": {"year": 1983}, "fieldsOfStudy": ["National Security & Public Affairs"], "school": "urn:li:fs_salesSchool:19941", "degree": "B.S.", "schoolName": "United States Military Academy at West Point", "startedOn": {"year": 1979}, "eduId": 459371175}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAACQ9L4gBICZZNd3YJrMe7XtkmOULnlJs-JI,NAME_SEARCH,undefined)", "numOfConnections": 579, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG-wco-kiD_6g/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=VRUW18pTMGqDOjXEgF7Q3zfNyU82udRxNUXMEfxx5VI", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG-wco-kiD_6g/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=IWS1SzuXiREkfxip0vU_qTmdbZJ9YJOK9bBK-Noizsw", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG-wco-kiD_6g/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=7cXjzaHcGaw5GFD4TnEEiIfkqHNvjjemNhHG2gO7zC4", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG-wco-kiD_6g/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=AXjcUc5H_DSokw0ktylIa82jc256Ul-xg4LaVaoAhNM", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "JTH Coaching", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Dr. Howard has over 25 years of diverse Human Resource experience in corporate, government, higher education and military contexts.  He has expertise in coaching, career development, training, mentoring, diversity and strategic sourcing. More recently he focuses on professional coaching and career development.  Dr. Howard has a passion for seeing the success of others.  He possesses a welcoming demeanor and the ability to build rapport with others.  Dr. Howard is extremely proud of his academic accomplishments which include a Ph.D. from Syracuse University, and a MS from the University of Pennsylvania.  He also earned his BS from the U.S. Military Academy at West Point.", "pendingInvitation": false, "defaultPosition": {"posId": 1127945493, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Coaching Program Manager Develop strategies to implement coaching solutions in the career development process for 20,000 employees.  Allocate coaching resources to meet the growing demands of employees. Built a team of internal coaches to deliver outstanding service to employees at all levels of the organization.\n\nCoached Senior Executive Service Candidate Development program participants to create and implement their Executive Development Plan.  Partnered with executives to draft Executive Core Qualifications (ECQs) statements.  Managed the mentor matching process for executives.  Debriefed executives on the results of their 360 degree assessments.  Partnered with executives to develop and to implement action plans addressing assessment feedback. Provided support and developmental counsel to executives covering a wide range of topics.  Provided expert technical guidance and assistance managing five Senior Executive Service (SES) education programs.   Program involved over 80 executives.\n ", "location": "Washington, D.C.", "title": "Program Manager", "startedOn": {"month": 4, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Jerusalem T. Howard, Ph.D.", "positions": [{"posId": 1127945493, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Coaching Program Manager Develop strategies to implement coaching solutions in the career development process for 20,000 employees.  Allocate coaching resources to meet the growing demands of employees. Built a team of internal coaches to deliver outstanding service to employees at all levels of the organization.\n\nCoached Senior Executive Service Candidate Development program participants to create and implement their Executive Development Plan.  Partnered with executives to draft Executive Core Qualifications (ECQs) statements.  Managed the mentor matching process for executives.  Debriefed executives on the results of their 360 degree assessments.  Partnered with executives to develop and to implement action plans addressing assessment feedback. Provided support and developmental counsel to executives covering a wide range of topics.  Provided expert technical guidance and assistance managing five Senior Executive Service (SES) education programs.   Program involved over 80 executives.\n ", "location": "Washington, D.C.", "title": "Program Manager", "startedOn": {"month": 4, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1108115582, "new": false, "current": true, "companyName": "JTH Coaching", "description": "I partner with clients to create successful outcomes, to develop action plans, and to achieve desired goals. My executive clients have a desire to accelerate results, to seek clarity when making crucial decisions, and to increase productivity.  Coaching clients during career transitions is another service I offer. I successfully coach clients to develop successful career transition strategies and plans.  As a trained Gallup Strengths Coach, I team with client to identify their strengths so they can maximize professional satisfaction and productivity in the work place.  Veterans, consider JTH Coaching your trusted advisor as you embark on your next step of your career. At the strategic level, I work with veterans as they develop plans to chart their course for their next career objective.\n", "location": "Wasington, DC", "title": "Executive & Professional Coach", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:11316313"}, {"posId": 1111195182, "new": false, "current": false, "endedOn": {"month": 3, "year": 2010}, "companyName": "US Army Regional Training Center - East", "description": "Provide leadership in the use of Instructional Systems Design/Systematic Design of Training processes to redesign a 4 hour cultural training course with a $200K training budget.\nDirect and manage 5 subject matter experts using ISD/SAT processes to develop 4 distance learning courses that aim to reduce the number of training related injuries.  Evaluate, analyze and recommend emerging technologies for appropriate Electronic Performance Support Systems (EPSSs) for unit distance learning training applications.  Developed an innovative web application prototype that collects an organizationâ\u0080\u0099s demographic information and speeds the planning process while increasing data accuracy.  Facilitated the development of 130 soldier 2011/12 workforce staffing plan by using a modified occupational analysis to identify required Military Occupational Specialties (MOS) as cadre. \n", "location": "Ft. Dix, NJ", "title": "Training Officer", "startedOn": {"month": 7, "year": 2008}}, {"posId": 1111194281, "new": false, "current": false, "endedOn": {"year": 2008}, "companyName": "Princeton Day School", "description": "Developed, managed and created multicultural programs in an academic setting. Supervised a team of 4 professionals to develop 15 socio-cultural programs and 8 training programs for 850 students and 60 faculty members.  Conducted an organizational study using an online survey for 900 participants that focused on current and long term training needs and requirements. The survey was conducted annually. The surveys surfaced employee concerns, and led to better employee programs.  Prepared, justified and submitted resource training requirements for the $15K instructional programming budget. Evaluated the effectiveness and calculated ROI of programs.  Coached faculty, staff and students on multicultural issues.", "location": "Princeton, NJ", "title": "Director of Diversity ", "startedOn": {"month": 7, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:85061"}, {"posId": 1111187704, "new": false, "current": false, "endedOn": {"month": 7, "year": 2006}, "companyName": "The College of New Jersey", "description": "Established the strategic goals for diversity and equity for the college. Presidential cabinet member and advisor on Equal Employment Opportunity/Affirmative Action matters. Led the development and implementation of diversity programs which were recognized and awarded by the American Association of Colleges and Universities for having one of the top 3 diversity programs in the New Jersey.  Convened of a cross-functional campus task force charged with determining the optimal resource allocation of $4.3 million dollars in summer revenue. Developed relationships with community groups, outside agencies, and other colleges for cultural and other training courses.  Coached faculty, staff and students on diversity and inclusion topics and issues.  Monitored workforce practices to ensure compliance with current EEO/AA laws.\n\n", "location": "Ewing, NJ", "title": "Director of Equity and Diversity", "startedOn": {"month": 7, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:12415"}, {"posId": 1111187475, "new": false, "current": false, "endedOn": {"month": 5, "year": 2003}, "companyName": "Merrill Lynch", "description": "Provided leadership in the use of the e-Learning platform for 2500 domestic users and defined and implemented distance learning strategy for client group.  Led a design staff of 7 subordinates from diverse backgrounds to create a computer based business simulation for Sales Associates. This simulation measured employees' decision making ability, technical and product knowledge, and assessed performance. This simulation was the first of its kind for the company, it reduced training time and accelerated learning.  Developed a cost-effective global socio-cultural training curriculum for 25K global employees working in the US, Japan, Europe, and Middle East. Curriculum included 3 resident and 4 web-delivered courses and had a $500K budget. Conducted ROI analysis for the curriculum. Consulted and coached affinity group leaders to develop programs aimed at increasing retention and building employee morale. \n\n", "location": "Plainsboro, NJ", "title": "e-Learning and Diversity Training Manager", "startedOn": {"month": 7, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:1178"}, {"posId": 1111187301, "new": false, "current": false, "endedOn": {"month": 7, "year": 1999}, "companyName": "Andersen Consulting", "description": "â\u0080¢\tManaged the Change Process for clients.  Led a 4 person instructional design team to design, develop and create a computer based medical dictionary for a major pharmaceutical company facing a government mandated product recall.  Classroom instruction and other educational material were developed to teach call center personnel.  Conducted train-the-trainer sessions and supervised the development of instructorâ\u0080\u0099s guide.  The computer based medical dictionary was designed using ISD process and it transformed the work processes for call center employees.  Created other web-based and blended training solutions for clients.  Developed and delivered classroom training programs for management teams.\nCreated e-mentoring pilot for office associates.\n", "location": "Philadelphia, PA", "title": "Change Management Manager", "startedOn": {"month": 7, "year": 1998}}, {"posId": 1111183711, "new": false, "current": false, "endedOn": {"month": 8, "year": 1995}, "companyName": "Bristol-Myers Squibb", "description": "Provided counsel to line management to enhance performance.  Managed salary and compensation planning for operations division.  Coached directors and managers to effectively handle employee relation issues for professional, non-exempt and union populations.  Teamed with manufacturing division to develop recruiting strategies.  Managed organizational development support for client groups.  Facilitated management-training programs to improve employee competency.  Managed the recruiting process for the Pharmaceutical Research Institute.\n", "location": "Syracuse, NY", "title": "Human Resources Manager", "startedOn": {"month": 3, "year": 1992}, "companyUrn": "urn:li:fs_salesCompany:1773"}, {"posId": 1109385926, "new": false, "current": false, "endedOn": {"month": 3, "year": 1992}, "companyName": "Mc Neil Consumer Products Co", "description": "Recruited executives, technical and managerial and other professionals.  Worked with hiring departments to develop cost effective recruiting strategies to fill open positions.  Managed the Co-op program that required over 30 new students every six months.  Developed an innovative coaching onboarding  process to help students more quickly  learn their roles and responsibilities.", "location": "Ft. Washington, PA", "title": "Senior Employment Administrator", "startedOn": {"month": 2, "year": 1989}, "companyUrn": "urn:li:fs_salesCompany:6474781"}, {"posId": 1111185427, "new": false, "current": false, "endedOn": {"month": 2, "year": 1989}, "companyName": "Johnson & Johnson Corporate Hqs.", "description": "Recruited executives, managers, and other professionals for positions at the J&J Corporate Office. Interviewed and made assessments on applicant's qualifications for open positions. Developed a novel approach to recruiting by leveraging telecommunications technology to speed the hiring process. Worked with local community leaders to increase diversity in the workforce. ", "location": "New Brunswick, NJ", "title": "Employment Administrator", "startedOn": {"month": 12, "year": 1987}}, {"posId": 1108051843, "new": false, "current": false, "endedOn": {"month": 12, "year": 1987}, "companyName": "Ethicon, Inc.", "description": "Supervised 28 union and non-union employees in the manufacturing of suture products. As a supervisor supported a diverse workforce and created a respectful work environment. Built and fostered good team morale among workers. Coached employees to improve manufacturing production.", "location": "Somerville, NJ", "title": "Production Supervisor", "startedOn": {"month": 12, "year": 1986}, "companyUrn": "urn:li:fs_salesCompany:1202"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Jerusalem T.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/jerusalem-t-howard-ph-d-a3474514b", "location": "Washington, District Of Columbia"}