{"lastName": "Nejand", "objectUrn": "urn:li:member:5051868", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Computer & Network Security", "educations": [{"endedOn": {"year": 1990}, "fieldsOfStudy": ["Electrical Engineering / Computer Engineering"], "school": "urn:li:fs_salesSchool:19604", "degree": "BS", "schoolName": "University of Virginia", "startedOn": {"year": 1986}, "eduId": 25594242}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAABNFdwBi4oaQVcDeCGmmtnxHnCrM_pR-yw,NAME_SEARCH,undefined)", "numOfConnections": 501, "showTotalConnectionsPage": false, "headline": "INFOSEC", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Specialties: Certification and Accreditation (C&A)\nINFOSEC (FISMA, FISCAM, DIACAP, DISA STIGs, DISA SRRs, etc.)\nNetworking (Cisco routers, switches and firewalls)\nUNIX (HP UX, SUN Solaris, IBM AIX and various Linux flavors)\nWindows  NT 4.0, Windows 2000, Windows 2003, etc.)\nMCSE Windows 2003 in Messaging and Security Architecture", "pendingInvitation": false, "defaultPosition": {"posId": 820193691, "new": false, "current": true, "companyName": "U.S. Department of the Treasury", "title": "IT Specialist", "startedOn": {"month": 6, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:5064"}, "degree": 3, "fullName": "David Nejand", "positions": [{"posId": 820193691, "new": false, "current": true, "companyName": "U.S. Department of the Treasury", "title": "IT Specialist", "startedOn": {"month": 6, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:5064"}, {"posId": 205041538, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Security Assurance Manager", "startedOn": {"month": 8, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 88817125, "new": false, "current": false, "endedOn": {"month": 7, "year": 2011}, "companyName": "KCG", "description": "â\u0080¢\tWorked at Transportation Security Administration (TSA) in the Information Assurance Division (IAD).\nâ\u0080¢\tProvided insight and FISMA C&A expertise to the CISOâ\u0080\u0099s office. \nâ\u0080¢\tManaged the C&A process for unclassified systems (FISMA) and classified (DIACAP).\nâ\u0080¢\tProvided an independent assessment of the system security plan, assessed the security controls in the information systems to determine the extent to which the controls were implemented correctly; operating as intended; and produced the desired outcome with respect to meeting the security requirements of the system.  \nâ\u0080¢\tRecommended corrective actions to reduce or eliminate vulnerabilities.\nâ\u0080¢\tDeveloped various documentation packages related to the C&A Process. Including ATO Packages,  Decommission Packages, Waiver/Exception Packages, and Plan of Action and Milestones (POA&M) Closure Packages.\nâ\u0080¢\tProvided guidance/support to Information System Security Officers (ISSO) to create Certification and Accreditation packages (FISMA) for various systems including FIPS 199 security categorization, Privacy Impact Assessment (PIA), E-Authentication evaluation, System Security Plan (SSP) and Contingency Plan.\nâ\u0080¢\tCreated Risk Assessments (RAs), Security Assessment Reports (SARs) and conducted Security Testing and Evaluations (ST&Es).", "title": "Transportation Security Administration (TSA) - Contractor", "startedOn": {"month": 9, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:37669"}, {"posId": 6946667, "new": false, "current": false, "endedOn": {"month": 9, "year": 2009}, "companyName": "Deloitte", "description": "â\u0080¢\tManaged the SPAWAR Information Assurance Validation team for Net-Enabled Command Capability (NECC). The NECC is the Department of Defense (DoD) command and control system that features web applications and web services in a service-oriented architecture (SOA). Responsible for execution of  the validation and security testing and evaluation portion of the NECC certification and accreditation (C&A) process for NECC systems and software as an authorized agent of the Certification Authority (CA). Led a team of engineers responsible for all validation activities.\nâ\u0080¢               Acted as an authorized agent of the Certification Authority (CA) - Defense Information Systems Agency (DISA) Field Security Operations (FSO).\nâ\u0080¢               Provided recommendations to the DAA (Deputy Commander, United States Strategic Command-USSTRATCOM).\nâ\u0080¢\tWorked on various proposal efforts.\nâ\u0080¢\tWorked at Coast Guard (FISCAM Support) and conducted root cause analysis for Notice of Findings and Recommendation (NFR) issued by Office of Inspector General.\nâ\u0080¢\tWorked at CyberTrust to obtain WebTrust certification as a certification authority. The certification addresses user (meaning, subscriber and relying party) needs and concerns and is designed to benefit users and providers of CA e-commerce assurance.\nâ\u0080¢\tWorked at Social Security Administration (SSA) and Internal Revenue Service (IRS) to create Certification and Accreditation packages (FISMA) for various systems. Created Risk Assessments (RAs), System Security Plans (SSPs), Security Testing and Evaluations (ST&Es) and various other FISMA related documentation. \nâ\u0080¢\tWorked with various clients in various penetration testing engagments.", "title": "Manager", "startedOn": {"month": 10, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:1038"}, {"posId": 51041812, "new": false, "current": false, "endedOn": {"month": 9, "year": 2005}, "companyName": "TWM Associates", "description": "â\u0080¢\tWorked with TWMâ\u0080\u0099s CEO & CFO to provide support on various IT projects.\nâ\u0080¢\tWorked with various customers to ensure INOFSEC compliance with various government regulations. Created interal security and disaster recovery plans and policies. Perfomed and coordinated security related tasks for various customer Security Offices. Configured and used various tools such ISS Scanner, nmap, nessus, etc.\nâ\u0080¢\tFormulated an IT plan to help support company business goals. Created an IT roadmap and implemented the new infrastructure.\nâ\u0080¢\tMaintain all internal IT infrastructure comprising of Windows /Exchange 2003 servers, Linux servers, SUN Workstations, Cisco Routers, PIX Firewall, IIS 6.0 and Apache web servers. \nâ\u0080¢\tMigrated company from NT 4.0/Exchange 5.5 environment to Windows 2003/Active Directory and Exchange 2003. Also completed two similar migrations for clients. \nâ\u0080¢\tDeveloped and maintain internal Intranet using .NET framework (Sharepoint).", "title": "Managed IT Infrastructure and Sr. Infosec Engineer", "startedOn": {"month": 9, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:65505"}, {"posId": 51041817, "new": false, "current": false, "endedOn": {"month": 8, "year": 2003}, "companyName": "Independent Consultant", "description": "â\u0080¢\tProvided IT consulting  to various companies including how to implement a secure environment and implementation of disaster recovery procedures. Supported and maintained networks comprising NT servers, Cisco routers and switches.\nâ\u0080¢\tInstalled and configured Cisco PIX firewalls.\nâ\u0080¢\tDesigned and developed website for Chocolate Boutique (www.bestchocolatestore.com).", "title": "Independent Consultant", "startedOn": {"month": 7, "year": 2002}}, {"posId": 51042144, "new": false, "current": false, "endedOn": {"month": 7, "year": 2002}, "companyName": "Corvis Corporation", "description": "â\u0080¢\tManaged and expanded IS infrastructure in order to accommodate companyâ\u0080\u0099s rapid growth from 40 to 1600+ employees in less than two years. Completed cabling, expanded network and deployed servers to all new buildings within project timelines. \nâ\u0080¢\tIdentified, implemented and managed strategic business partnerships with consulting firms and key suppliers.\nâ\u0080¢\tImplemented an integrated Manufacturing Execution System (MES), Oracle ERP system, Network Infrastructure comprising of Cisco routers/switches, Intranet, Extranet,  Windows domain, UNIX Servers, firewalls and various other other IT related systems for Corvis.", "title": "IT Director", "startedOn": {"month": 5, "year": 1998}, "companyUrn": "urn:li:fs_salesCompany:1619"}, {"posId": 51042301, "new": false, "current": false, "endedOn": {"month": 5, "year": 1998}, "companyName": "Navius", "description": "â\u0080¢\tDesigned and programmed two commercial websites. Built websites www.auto-partner.com and www.property-partner.com on a Digital Alpha Unix server using JAVA and Perl. Co-wrote a JAVA application for inventory control and auction of cars and properties.  \nâ\u0080¢\tProvided sales support, represented the company in trade shows and conducted demonstrations.", "title": "Partner", "startedOn": {"month": 10, "year": 1997}}, {"posId": 51042306, "new": false, "current": false, "endedOn": {"month": 10, "year": 1997}, "companyName": "Independent Consultant", "description": "â\u0080¢\tProvided project management and engineering support to UNISYS for maintenance and deployment of the largest Microsoft NT network in existence at the time.", "title": "Independent Consultant", "startedOn": {"month": 6, "year": 1997}}, {"posId": 51042422, "new": false, "current": false, "endedOn": {"month": 6, "year": 1997}, "companyName": "Rapid Systems Solutions (RSSI) (currently BSG / Impact Innovations)", "description": "â\u0080¢\tDesigned a secure e-mail and workgroup solution for all Navy medical sites.\nâ\u0080¢\tWrote a program to migrate users from a POP-3/PC-Eudora environment to Microsoft Exchange. \nâ\u0080¢\tWrote a program to import all PH data to Exchange.\nâ\u0080¢\tFollowing the success of this project, the Army adopted the NT domain and e-mail strategy developed for the Navy.\nâ\u0080¢\tPrepared, presented, and defended proposal for the Marines R-NET project and won the multi-million dollar project.\nâ\u0080¢\tLed a 14-person team to design and implement R-NET (R-NET connects 203 sites across the nation via frame relay using Cisco routers to two network operation centers).\nâ\u0080¢\tServed as the 1995 Project Leader for the Joint Warrior Interoperability Demonstration â\u0080\u009895 ONCALL project for the Camp Pendleton/Marine Corps Tactical Systems Support Activity site; the ONCALL project provided real-time video teleconferencing (VTC) for a telemedicine application via ATM CBR running over terrestrial systems and C-Band satellite at T1 bandwidth.", "title": "Program Manager", "startedOn": {"month": 3, "year": 1994}}, {"posId": 51042428, "new": false, "current": false, "endedOn": {"month": 3, "year": 1994}, "companyName": "PRC", "description": "â\u0080¢\tDesigned and implemented imaging systems to electronically capture, index and access documents (including engineering drawings) for General Dynamics Electric Boat division; programmed in C using Borland C++.\nâ\u0080¢\tIntegrated HP servers and SCO workstations; optimized and fine-tuned machines to achieve scores well over government requirements for the Super-mini (AFCAC 300) proposal.\nâ\u0080¢\tConfigured HP and SCO workstsations/servers to meet various government security guidelines including C2, B1 and B2 classes.", "title": "Systems/Software Engineer", "startedOn": {"month": 8, "year": 1991}, "companyUrn": "urn:li:fs_salesCompany:14514"}, {"posId": 51042553, "new": false, "current": false, "endedOn": {"month": 5, "year": 1991}, "companyName": "General Electric", "description": "â\u0080¢\tProgrammed in FORTRAN.\nâ\u0080¢\tAdministrated Novell network.", "title": "Systems Engineer", "startedOn": {"month": 6, "year": 1990}, "companyUrn": "urn:li:fs_salesCompany:1015"}, {"posId": 51042557, "new": false, "current": false, "endedOn": {"month": 8, "year": 1989}, "companyName": "Republic Technology", "description": "â\u0080¢\tResponsible for the quality of the printed circuit boards.\nâ\u0080¢\tReduced the number of returned orders from 18 per month to 1 per month; increased yield from 65% to 95%.", "title": "Quality Control Manager", "startedOn": {"month": 6, "year": 1989}}], "pictureInfo": {}, "relatedColleagueCompanyId": 5064, "savedLead": false, "firstName": "David", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/nejand", "location": "Washington D.C. Metro Area"}