{"lastName": "Anderson CHS IV, SSI", "objectUrn": "urn:li:member:98515507", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Military", "educations": [{"endedOn": {"year": 2017}, "fieldsOfStudy": ["Security Management with a concentration in INFOSEC"], "school": "urn:li:fs_salesSchool:41992", "degree": "Bachelorâ\u0080\u0099s Degree", "schoolName": "American Military University", "startedOn": {"year": 2014}, "eduId": 337718658}, {"endedOn": {"year": 2015}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:20165", "degree": "Some Coursework Competed", "schoolName": "Brookdale Community College", "startedOn": {"year": 2011}, "eduId": 179507162}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAXfOjMBSJqfcvwxChhks7-lzHMEnaXc6QA,NAME_SEARCH,undefined)", "numOfConnections": 141, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGiQPxVlHJY6A/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=klwvOE9g40-T4iK2Ix1lJb10GQu3KeBBg3jT7MenRkM", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGiQPxVlHJY6A/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=sREKG680YJ3xiquPEACN1aHTDmbg6hlmM3tgu7k_xXc", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGiQPxVlHJY6A/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=JSx4SKdw3RHIUnmLC2SoafzHhmuFMp611PKDCTFyMMM", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGiQPxVlHJY6A/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=K6TDM7eMbEs-0PznsjVVqpdJ5f3ego17P8tPypFVqVE", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Police Officer at United States Department of Defense", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "A strong work ethic and solid law enforcement track record combined with experience implementing anti-terrorism protocols and measures to provide a solid foundation for carrying out any security-related duties, be they in a military, private sector, or public sector setting.", "pendingInvitation": false, "defaultPosition": {"posId": 1300588073, "new": true, "current": true, "companyName": "United States Department of Defense", "location": "Miami/Fort Lauderdale Area", "title": "Police Officer", "startedOn": {"month": 4, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:7510"}, "degree": 3, "fullName": "Kelly Anderson CHS IV, SSI", "positions": [{"posId": 1300588073, "new": true, "current": true, "companyName": "United States Department of Defense", "location": "Miami/Fort Lauderdale Area", "title": "Police Officer", "startedOn": {"month": 4, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:7510"}, {"posId": 945356231, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Newark, New Jersey", "title": "Enforcement and Removal Office", "startedOn": {"month": 3, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 443998372, "new": false, "current": false, "endedOn": {"month": 3, "year": 2017}, "companyName": "United States Department of Defense", "description": "Maintain logs showing the status of actions and official correspondence.Screen visitors, vendors, and contractors for access to the installation through the National Crime Information Center and Consolidated Law Enforcement Operations Center databases.Initiate vetting for access to restricted areas as well as the issuance of camera passes to those authorized.Carry out policies and procedures for the clearance of foreign visitors and foreign nationals to access the installation\nConduct fingerprinting for member SF-86. Coordinate with supervisors, HR, and outside parties on security requirements and standards .Receive and process access request forms granting base and/or restricted area access.", "location": "Naval Weapons Station Earle NJ", "title": "Security Specialist", "startedOn": {"month": 12, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:7510"}, {"posId": 156887296, "new": false, "current": false, "endedOn": {"month": 4, "year": 2015}, "companyName": "United States Navy Reserves", "description": "Performed anti-terrorism and force protection duties to include security patrols, installation and pier access control, and the implementation of random anti-terrorism measures. Provided waterborne security for five nautical miles of restricted waterways protecting all in port and visiting fleet units.   \nHelped develop, coordinate, and maintain pre-planned responses to potential terrorist attacks and emergency situations as part of an exercise during Navy Mid-Atlantic Solid Curtain/ Citadel Shield.   \nAssisted the United States Secret Service in a Protective Service Detail for President Bush during the commissioning of U.S. Navy aircraft carrier George H.W. Bush (CVN 77). Monitored security program operations, current events, receive, analyze, and disseminate intelligence and information. Communicated and coordinated with the U.S. Fleet Forces Maritime Operations Center, The CNIC Shore Support Center, installation EOCs,installation dispatch centers, and other agencies as required for emergency management and force protection planning and execution.  Supported, implemented, and directed Crisis Action Team (CAT) Operations Information Management using the C4I Suite and all other available information systems in the Regional Operation Center (ROC).\nUtilized the Command, Control, Communications, Computers, and Intelligence (C4I) suite to assist with the coordinating of responses to various incidents.Developed policies for local regulations, supplements to regulations, and standing operating procedures, and inspection lists. Maintained Situational Awareness (SA) and Situational Understanding (SU) in accordance with regional Commander Critical Information Requirements (CCIRs) and information in accordance\nwith local region directives and standard operating procedures.Provided both Physical Security and Law Enforcement support as assigned to Norfolk Naval Shipyard and other surrounding regional installations.\n\n", "location": "Naval Station Norfolk, CRNMA Regional Operations Center", "title": "Master-at-Arms/ Petty Officer Second Class", "startedOn": {"month": 1, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 444005989, "new": false, "current": false, "endedOn": {"month": 11, "year": 2013}, "companyName": "United States Navy", "description": "Oversaw the Tactical Operations Center (TOC) to facilitate consistent mission and threat communications between all joint Army and Navy customsâ\u0080\u0099 camps and forward operating bases.\nAssigned as unit security manager verifying memberâ\u0080\u0099s security clearances in JPAS and approving access requests for classified areas such as the flight lines.Disseminated information to Navy Expeditionary Logistics Command HQ in Camp Arifjan, Kuwait. Tracked troop movements, supply requests, and situational reports for five Forward Operating Bases to the Naval Expeditionary Logistics Support Group (NAVELSG) Logistics Operation Center.", "location": "Bagram Airfield /Kandahar Airfield  Afghanistan", "title": "Tactical Operations Center Supervisor/ Operations Petty Officer", "startedOn": {"month": 2, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 444004531, "new": false, "current": false, "endedOn": {"month": 10, "year": 2012}, "companyName": "US Navy", "description": "Coordinated and oversaw night operations,  watch bills/schedules , and the implementation of restraints/ search techniques prior to escorting detainees for movements.Conducted the safe, humane, and transparent care and custody of detained enemy combatants, including those convicted by military commission and those ordered released. Supervised prisoner and detainee movements and activities. Carried out the daily operations of detention facilities and over 150 detainees. Integrated interpersonal communication, problem-solving, and leadership skills in the everyday care of detainees and in the training and development of more than 50 guards, resulting in increased mission readiness for the high-tempo operations of the largest and most dynamic detention facility on base. Enforced rules and regulations governing facility security detainee accountability and detainee conduct to ensure detainees remained in custody.", "location": "Naval Station Guantanomo Bay, Cuba", "title": "Nights Supervisor/ Detainee Information Management Specialist", "startedOn": {"month": 10, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 156871201, "new": false, "current": false, "endedOn": {"month": 2, "year": 2011}, "companyName": "Department of the Navy", "description": "Tasked with enforcing state and federal laws resulting in the apprehension and arrest of suspects while protecting their civil rights. Collected and inventoried evidence and wrote comprehensive reports leading to convictions. Performed follow-up investigations that required technical knowledge of police/security operations. Conducted fingerprinting and photographing of suspects for processing.Identified fraudulent documents such as false licenses, passports, and government identification cards. Conduct preliminary investigations into sensitive subjects such as sexual assault, rape, and juvenile offenses as well as preliminary interviews of victims, witnesses, and suspects who obtain written complaints or confessions.Ensure that vehicles and personnel accessing military installations/buildings have the appropriate credentials for entry. Train staff in the standard operating procedures for the issuance and proper method of verifying identity of visitor, contractor, and vendor passes. Performed anti-terrorism and force protection duties to include security patrols, installation and pier access control, and the implementation of random anti-terrorism measures. Provide waterborne security for five nautical miles of restricted waterway protecting all in port an visiting fleet units.", "location": "Naval Station Norfolk, Sewells Point Precinct", "title": "Police Officer GS-0083", "startedOn": {"month": 5, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:1335"}], "pictureInfo": {}, "relatedColleagueCompanyId": 7510, "savedLead": false, "firstName": "Kelly", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/klande1", "location": "Key West, Florida"}