{"lastName": "Schlim", "objectUrn": "urn:li:member:17866852", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Program Development", "educations": [{"endedOn": {"year": 2006}, "fieldsOfStudy": ["Clinical Health Sciences"], "school": "urn:li:fs_salesSchool:18050", "degree": "BS", "schoolName": "The George Washington University School of Medicine and Health Sciences", "startedOn": {"year": 2004}, "eduId": 14302094}, {"endedOn": {"year": 1998}, "fieldsOfStudy": ["General Studies"], "school": "urn:li:fs_salesSchool:20286", "degree": "General Studies", "schoolName": "Springfield Technical Community College", "startedOn": {"year": 1996}, "eduId": 21107445}, {"endedOn": {"year": 1985}, "fieldsOfStudy": ["General Studies"], "degree": "Diploma", "schoolName": "Richland Senior High School", "startedOn": {"year": 1983}, "eduId": 24538866}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAEQoGQBKgG9A_eYL8y4_cy1IBWyI7CJn24,NAME_SEARCH,undefined)", "numOfConnections": 487, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGkOXdEAL43zw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=shZICP7Paa6kafjKYmCbvo8I54Lp9XN5Lo1S0Jg5JtI", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGkOXdEAL43zw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=Bj8uWL-HdQswM90fCIXCmiKSVmLVPXiY0oD63d8Btng", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGkOXdEAL43zw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=hizIwvGSYb13h3NgEYSp-HaFzekteMNMbeJpz4LDDt8", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGkOXdEAL43zw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=Jg2HrIMXC_DQEK_YsBobD-yt-Zj20UovD_wNCDWiAxo", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Program Manager - Records Management SME at U.S. Immigration and Customs Enforcement (ICE), OBIM RIM", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Highly skilled leader with over 31 years of extensive and progressive experience in health related organizations that range from small outpatient to large complex hospital directorates, Senior Records Officer for traditional and electronic records, publications and manuals.  Exceptionally talented project leader who uses organizational talents and technical skills that are well above the norm.  Creative use of team intellect and attention to detail that are the hallmarks of how this leader gets the job done.\n\nSpecialties: National Archives Records Administration - trained Federal Records Manager.\nTotal Records Information Management (TRIM) ERMS Systems Administrator.\nLean Six Sigma (LSS) Green Belt.", "pendingInvitation": false, "defaultPosition": {"posId": 883828488, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Arlington, VA", "title": "Program Manager - Records Management SME", "startedOn": {"month": 12, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Anthony J. Schlim", "positions": [{"posId": 883828488, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Arlington, VA", "title": "Program Manager - Records Management SME", "startedOn": {"month": 12, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 883825609, "new": false, "current": true, "companyName": "Integral Consulting Services, Inc.", "location": "Arlington, VA", "title": "Program Manager - Records Management SME", "startedOn": {"month": 12, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:729052"}, {"posId": 802589153, "new": false, "current": true, "companyName": "AJS Records & Information Management", "title": "Independent Consultant", "startedOn": {"month": 7, "year": 2015}}, {"posId": 810052574, "new": false, "current": false, "endedOn": {"month": 12, "year": 2016}, "companyName": "Defense Nuclear Facilities Safety Board", "location": "Washington D.C. Metro Area", "title": "Federal Records Management SME", "startedOn": {"month": 5, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:6275331"}, {"posId": 818675348, "new": false, "current": false, "endedOn": {"month": 12, "year": 2016}, "companyName": "LAC Group", "location": "Washington D.C. Metro Area", "title": "Records Management Specialist SME", "startedOn": {"month": 5, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:26050"}, {"posId": 687184858, "new": false, "current": false, "endedOn": {"month": 4, "year": 2016}, "companyName": "J5 Systems", "description": "Subject Matter Expert supporting the transition between contract awards for the Department of the Navy / Assistant for Administration â\u0080\u0093 Directives and Records Management Division.  \n\n- Provided continuity for the smooth transition from a large defense contractor to a small business awarded programmatic responsibilities for the division.\n \n- Managed the departmentâ\u0080\u0099s $21M records storage requirements which resulted in the quick recall and final determination of status (i.e. retention for business purposes, transfer Permanent records to the National Archives & Records Administration, or the destruction in accordance with current policies).\n \n- Primary Point of Contact with the Federal Records Center Transfer & Disposition branches, coordinating the destruction of over 27,000 cubic feet of temporary records and the denial of the destruction of financial records in support of the Government Accountability Officeâ\u0080\u0099s audit of the Navy.\n\n- Primary support for the Navy General Counselâ\u0080\u0099s Office in regards to record discovery by analyzing the holdings at the Federal Records Centers and subordinate Navy commands, resulting in potential documentary sources to support litigation.", "location": "Arlington, Virginia", "title": "Independent Consultant", "startedOn": {"month": 7, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:245394"}, {"posId": 299394531, "new": false, "current": false, "endedOn": {"month": 6, "year": 2015}, "companyName": "Lockheed Martin Information Technology", "description": "Department of the Navy, Secretary of the Navyâ\u0080\u0099s Assistant for Administration / Directives and Records Management Directorate (DON/AA-DRMD) provides contract oversight to the DON in matters of SECNAV Directives, Records Management & Forms and Reports Management, and Declassification programs. As Task Lead, responsible for the oversight and productivity of 9 team members handling highly sensitive DON records and projects, provide government stakeholders with weekly and monthly reporting.\n\nâ\u0097\u008a Assessed the Navy Secretariat records management compliance and governance of electronic, paper, and special media record materials.\nâ\u0097\u008a Oversee the programmatic management of the Secretary of the Navyâ\u0080\u0099s Directives and Issuances. Produce dashboard metrics to support the ongoing directives writing, review, editing, and publication of over 190 SECNAV directives and notices.\nâ\u0097\u008a Direct the DONâ\u0080\u0099s lower Echelon Commands in the use of ARCIS, ERA, and the Navyâ\u0080\u0099s Electronic Records Management Tool (HP TRIM).\nâ\u0097\u008a Assistant HP TRIM Administrator supporting over 300,000 product end users.\nâ\u0097\u008a Executive Assistant to the Director & Deputy Director DON/AA-DRMD preparing executive level correspondence and supporting all staff needs from onboarding to separation.", "location": "Washington D.C. Metro Area", "title": "Program Manager -- Federal Records Management Task Lead - Department of the Navy", "startedOn": {"month": 7, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:1319"}, {"posId": 183794317, "new": false, "current": false, "endedOn": {"month": 7, "year": 2012}, "companyName": "AECOM", "description": "Department of Defense, Records Management and Declassification Division.\n\nResponsible for the day-to-day activities of all Records Managers on the Records Team.  Schedules, monitors, and assists the Records Managers on the Records Team with their on-site duties, enforcing work standards, and reporting on task progress.  Consolidate Records Management Application (RMA) requirements and research potential RMA vendors with Enterprise IT Solutions Directorate (EITSD), Washington Headquarters Services (WHS), and Department of Defense (DoD) personnel.\n\n*  Direct 3 junior Records Managers in tasks that they are assigned \n*  Assess existing records management programs and practices throughout the Office of the Secretary of Defense (OSD) and WHS (73 Divisions, Branches, and Offices) which include:\n     -  Assessing both the current electronic and hardcopy records program\n     -  Identifying and documenting the customer needs and business practices\n     -  Providing assistance to remediate identified deficiencies to comply with Agency procedures and policies\n*  Produce Report of Findings, to include the initial assessment results as well as what assistance activities occurred for each Directorate\n*  Conduct Quality Control Audits of the Directorates to ensure all deficiencies were corrected\n*  Identified and evaluated five potential RMA candidates and provided recommendation to WHS for procurement", "title": "Program Manager -- Federal Records Management Task Lead - Office of the Secretary of Defense", "startedOn": {"month": 4, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:15656"}, {"posId": 67732682, "new": false, "current": false, "endedOn": {"month": 4, "year": 2011}, "companyName": "AECOM", "description": "Program Manager - Federal Records Task Lead - Department of Education, Regulatory Information Management Services, Records Management and Privacy Division.  Provide leadership, oversight, and coordination to ensure Departmental compliance with government initiatives regarding the acquisition, release and maintenance of information.  The Records Management Division is responsible for developing and implementing strategies and programs designed to ensure compliance with federal information management requirements.\n\n* Serves as the Department's principal authority and representative on records management statutory, regulatory and policy requirements to assure compliance with National Archives and Records Administration (NARA) directives. \n* Develops clear and consistent business rules (standards) for records management, administrative safeguards for protecting personally identifiable information. \n* Provide guidance and instruction to Department staff for the appropriate handling, maintenance and disposition of records. \n* Develops and provides print and web-based training to Department employees and contractors regarding records management lifecycle and file plan development.", "title": "Program Manager -- Federal Records Management Task Lead - US Department of Education", "startedOn": {"month": 3, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:15656"}, {"posId": 38538433, "new": false, "current": false, "endedOn": {"month": 3, "year": 2009}, "companyName": "Booz Allen Hamilton", "description": "Subject matter expert on Federal Records Management for Booz Allen Hamilton supporting the Under Secretary of Defense for Personnel & Readiness (Information Management) on the Defense Integrated Military Human Resource System (DIMHRS) implementation across the DoD.  Analyze and propose measures to comply with Federal Government and National Archives Records Administration (NARA) statutory and regulatory provisions.", "title": "Senior Consultant / Federal Records Management", "startedOn": {"month": 5, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:1403"}, {"posId": 26568348, "new": false, "current": false, "endedOn": {"month": 5, "year": 2008}, "companyName": "Commander, Navy Installations Command", "description": ">Develop, recommend and maintain current guidelines, policies and procedures for the management of traditional and electronic records throughout their life cycle for the Commander, Navy Installations Command (CNIC).\n\n>Provide technical assistance and direction on records management to 13 global regions of the CNIC enterprise.\n\n>Develop and review filing and retrieval systems ensuring that the systems are adequate for the identification, maintenance and disposition of records.\n\n>Provide training on records management to CNIC personnel.  Provide input and assist Navy Records Manager in updating records schedules annually.\n\n>Participate in CNIC and professional committees to share records management information.  Develop long range goals and projections for the records management program.\n\n>Work with CNIC command staff in developing CNIC Records Management strategies.", "title": "Records Officer/TRIM RMA Administrator", "startedOn": {"month": 10, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 26577721, "new": false, "current": false, "endedOn": {"month": 10, "year": 2007}, "companyName": "BearingPoint", "description": "Consultant - Public Sector / Navy supporting Director, Navy Records in the implementation of a digital records management enterprise solution for the Department of the Navy (DON).\n\n*Counsel and provide guidance to the Director in matters pertaining to the enterprise implementation of TRIM Context (Total Records & Information Management) for the DON.\n\n*Devise, Track, and provide useful metrics data to the client in an expeditious manner.\n\n*Provide technical telephone support and help desk support to DON clients in who experience difficulties with TRIM.\n\n*Liaison with the National Archives and Records Administration to facilitate a smooth transference of historically pertinent Navy records to include records from units and organizations affected by BRAC.\n\n*Member of the BearingPoint Business Development Team collaborating with major vendors to provide a broad range of process improvements to the DON at various levels", "title": "Consultant, Public Sector - Navy", "startedOn": {"month": 12, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:1349"}, {"posId": 26577729, "new": false, "current": false, "endedOn": {"month": 1, "year": 2007}, "companyName": "US Navy", "description": "The National Naval Medical Center Bethesda, MD\nAssociate Directorate Administrative Officer\nMarch 1, 2004 - January 31, 2007\n\nAssistant to the Director, Senior Enlisted Leader and for all administrative duties for over 275 personnel in 10+ inpatient and outpatient units within the facility. \n\n* Counsel and provide quarterly/annual evaluations\n* Ensure career development for members\n* Initiate correspondence & evaluations\n* Track reports and monitor quality of the performance of departments\n* Develop multiple computer tracking systems\n* Create efficiency reports\n* Provide training opportunities to subordinate, peers and supervisors for career and educational development", "title": "Chief Petty Officer", "startedOn": {"month": 8, "year": 1985}, "companyUrn": "urn:li:fs_salesCompany:1335"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Anthony J.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/anthonyschlim", "location": "Washington D.C. Metro Area"}