{"lastName": "Bundy", "objectUrn": "urn:li:member:186856044", "contactInfo": {"socialHandles": [{"name": "BigSIS5STAR", "type": "TWITTER", "dataSource": "LINKEDIN"}]}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2018}, "fieldsOfStudy": ["Business Administration, Management and Operations"], "school": "urn:li:fs_salesSchool:32957", "degree": "Master of Business Administration (M.B.A.)", "schoolName": "Stratford University", "startedOn": {"year": 2016}, "eduId": 353916904}, {"endedOn": {"year": 2015}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:32957", "degree": "Bachelor of Business Administration (B.B.A.)", "schoolName": "Stratford University", "startedOn": {"year": 2013}, "eduId": 112714283}, {"endedOn": {"year": 2001}, "fieldsOfStudy": ["General Studies"], "degree": "High School Diploma", "schoolName": "Western Branch High", "startedOn": {"year": 1998}, "eduId": 291277507}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAsjMmwBBihdDh3WXGWy7UVQCGWSNrh5y8s,NAME_SEARCH,undefined)", "numOfConnections": 480, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQG3X-BxZ_EYKQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=InXAKdamZTT5_uEXhPc0LUZzX5T8YLOw-obgzkVmknc", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQG3X-BxZ_EYKQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=WF0Vm2tMHS80VdhXlyq9cy6Ua1rSSwfkK5JWZHi2OO4", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQG3X-BxZ_EYKQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=sW6-TmzSLzYQHTOQTLQzUDGXZ6FZMsxZ0ZhDq2MfoP0", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQG3X-BxZ_EYKQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=XJIJSnd-ZRLjOYOY2iRAFuzeCGVbWkrV4NCJnOXLu8M", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Mission Support Specialist at ICE ", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I am reliable, detail-oriented, and extremely hard-working associate; one who will serve as a model to encourage other staff members to demonstrate the same high standard of professionalism.", "pendingInvitation": false, "defaultPosition": {"posId": 860298467, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provide valuable administrative and technical services that enhance the operational performance of U.S. Immigration and Customs Enforcement ERO offices, units and personnel. Develop and implement human resources training programs. Manage, evaluate and upgrade information involving Workmanâ\u0080\u0099s Comp and OWCP for the WAS Field office. Prepare budgets based on office projections for monthly and annual purchases. Produce paperwork necessary to facilitate building maintenance and security procedures. Prepare status reports on facilities, personnel and equipment. Analyze and evaluate administrative and mission operations in order to make recommendations that enhance performance. WebTA time coordinator for the WAS Field Office providing time card assistance to over 350 ERO Employees. Organize itineraries and travel documentation. Coordinate operations with other agencies and government representatives. Present studies, reports and recommendations to senior administrators and Diversity Counsel committee members. Access intelligence databases to provide tactical and strategic information to front line personnel. Mail management liaison and Stamps.com representative for ERO Richmond.\n", "location": "Richmond, Virginia Area", "title": "Mission Support Specialist ", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Michelle E.J. Bundy", "positions": [{"posId": 860298467, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provide valuable administrative and technical services that enhance the operational performance of U.S. Immigration and Customs Enforcement ERO offices, units and personnel. Develop and implement human resources training programs. Manage, evaluate and upgrade information involving Workmanâ\u0080\u0099s Comp and OWCP for the WAS Field office. Prepare budgets based on office projections for monthly and annual purchases. Produce paperwork necessary to facilitate building maintenance and security procedures. Prepare status reports on facilities, personnel and equipment. Analyze and evaluate administrative and mission operations in order to make recommendations that enhance performance. WebTA time coordinator for the WAS Field Office providing time card assistance to over 350 ERO Employees. Organize itineraries and travel documentation. Coordinate operations with other agencies and government representatives. Present studies, reports and recommendations to senior administrators and Diversity Counsel committee members. Access intelligence databases to provide tactical and strategic information to front line personnel. Mail management liaison and Stamps.com representative for ERO Richmond.\n", "location": "Richmond, Virginia Area", "title": "Mission Support Specialist ", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 691782622, "new": false, "current": false, "endedOn": {"month": 10, "year": 2016}, "companyName": "Transportation Security Administration", "description": "Acquisitions and Lead Purchasing Specialist; Accountable Property Officer, Vehicle Custodian; Government Fleet/WEX Card Coordinator; IT and Government Wireless CoordinatorProvide administrative support to the Administration department for RIC HUB and SPOKE airports. Lead Purchaser and Ordering Official with a team of seven subordinates. Maintain a purchase card in order to purchase supplies, materials, professional development classes, etc. Assisting with the budget by running reports in JP Morgan and updating a record-keeping workbook.\nAccountable Property Officer for RIC HUB and six SPOKE Airports. Responsible for over three million dollars worth of accountable property. Wireless and IT coordinator for RIC HUB and SPOKE airports. Perform data entry where appropriate with a high level of accuracy, with little or no supervision. Initiating personnel actions for employee awards, promotions, reassignments, demotions, etc. Processing time and attendance for the RIC HUB Office by entering leave and payroll data into the WebTA database. Serves as a vehicle custodian for RIC HUB Office government vehicles; tracking information, log-in books, vehicle maintenance, and government fleet credit card tracking/management. Serves as the travel regulations and policies POC for the RIC HUB Office; verifying and certifying all travel authorizations and vouchers in the Concur database, ensuring that all travelers get reimbursed. Serves as PCIF Manager for Personal Identification Card distribution center for the Central Virginia and South Eastern Virginia; Issuing over 30 PIV badges a week. Maintain files, records, schedules and calendars for assigned teams within the RIC HUB Office such as Employee Performance Files (EPFs), administrative files, recording TSA online learning center training courses, etc.", "location": "Richmond, Virginia Area", "title": "Program Assistant", "startedOn": {"month": 2, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 436098159, "new": false, "current": false, "endedOn": {"month": 2, "year": 2015}, "companyName": "Transportation Security Administration", "description": "Perform customer service duties such as answering phones, greeting guest to the Welcome Center and responding to inquiries. Established policies/procedures provide guidance for most assignments, but allow some discretion to select the most appropriate approach. Acts as a lead for other support staff to coordinate multiple assignments. Provide guidance to lower-level support staff for handling routine problems and issues. Provides assistance to a program area which may include finance, human resources, model workplace, scheduling, or other core functional area. Work activities typically support multiple projects/programs and contribute to one or more organizational units and major subdivisions. Apply analytical techniques and methods to perform a variety of administrative and analytical duties in support of TSA field operations.", "location": "Richmond, Virginia Area", "title": "Administration Assistant", "startedOn": {"month": 8, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 287685474, "new": false, "current": false, "endedOn": {"month": 8, "year": 2013}, "companyName": "US Department of Defense", "description": "Direct the work of all full time support personnel assisting in the accomplishment of all command objectives and program activities. The principal administrator responsible for performing and coordinating duties for the USAR Unit CommanderServes as secondary advisor to the Director and Associate Director staff on civilian personnel management issues. Manage unit preparations for official inspections, command staff visits, and similar activities along with the implementation of the Commandâ\u0080\u0099s Physical Security and Loss Prevention Programs. Coordinates emergency response activities with the Executive Committee and serves as an active member in the internal control program by reviewing activity and incident reports, guard tours and taking corrective action to correct policies, procedures, compliance and regulation violations. Analyzes work requirements and determines resources and equipment needed to accomplish work assignments. Exercises flexibility and the ability to determine priorities. Serves as liaison with outside agencies, and maintains compliance with federal, state and local safety regulations.", "location": "302nd ICTC", "title": "USAR Unit Administrator", "startedOn": {"month": 8, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:7510"}, {"posId": 287687006, "new": false, "current": false, "endedOn": {"month": 8, "year": 2007}, "companyName": "United States Department of Defense", "description": "Performs a variety for personnel, pay administration, and supply work in operation of the 302nd Transportation CompanyPlans and establishes priorities; assigns, distributes, and reviews work of subordinate unit sections and personnel. Providing administrative support to accomplish goals effectively and efficiently. Reviews incoming directives, policies, and instructions from higher headquarters, advises the Commander on those affecting administrative functions, and develops and recommends appropriate action to implement changes. Coordinates personnel, payroll, and automated systems activities. Implement and administer complex accounting, and financial programs, policies and accounts. Researched, analyzed, interpreted, and provided advice and counsel to program officials on financial policies, procedures and laws; and compiling, developing and presenting complex accounting, and/or financial data, statements and reports. Initiates and manages personnel actions in such areas as reenlistments, separations, discharges and transfers, requests for MOS changes, security clearances, retirements, promotions and awards, completion of officer and enlisted efficiency reports, unit training and attendance, unauthorized absences from drill, and disciplinary actions.", "location": "302nd ICTC", "title": "USAR Unit Administrator Tech", "startedOn": {"month": 10, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:7510"}, {"posId": 287687335, "new": false, "current": false, "endedOn": {"month": 10, "year": 2006}, "companyName": "Spherion", "description": "Assisted Best Buy employees with enrollment in Health Insurance and 401k Plans. Researched and analyze and Family Status Change; such as Marriage, Birth of a child or Divorce. Prepared and processed records. Inform participants of any major changes being made to the Health Care plans.", "title": "Benenfits Coordinator", "startedOn": {"month": 1, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:2266"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Michelle E.J.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/mejbundy", "location": "Richmond, Virginia Area"}