{"lastName": "Bevard", "objectUrn": "urn:li:member:314922428", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2012}, "fieldsOfStudy": ["ICE ERO Academy"], "schoolName": "Federal Law Enforcement Training Center", "startedOn": {"year": 2012}, "eduId": 213199501}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["Uniformed Police Training Program"], "schoolName": "Federal Law Enforcement Training Center (FLETC)", "startedOn": {"year": 2010}, "eduId": 213197851}, {"endedOn": {"year": 2009}, "fieldsOfStudy": ["Homeland Security, Law Enforcement, Firefighting and Related Protective Services"], "schoolName": "Aberdeen Proving Ground DACP Police Academy", "startedOn": {"year": 2009}, "eduId": 213197877}, {"endedOn": {"year": 2002}, "schoolName": "Louisa County High School", "startedOn": {"year": 1997}, "eduId": 213196624}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABLFVbwBlqs6kOwXzuxEKA_cLQibCocuty0,NAME_SEARCH,undefined)", "numOfConnections": 11, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFBW3Q9vcthpw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=Rot3w7C30tqSbaegVzxiUdQ3DVXYNPhkx-v10IJpSs0", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFBW3Q9vcthpw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=55366WKH5_lIcpKr8Zc-_LdSk5eIgBxE7bQwzjQiYjE", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFBW3Q9vcthpw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=21oV4YuGswRGGKJ_weNYuEdtK7cFs7cPEbfuTKCv_PU", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFBW3Q9vcthpw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=Aeu85csk5-uOLiW6aeY1tMwroeqPcSNNCX9qOaERhY0", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Immigration Enforcement Agent at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 495657142, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Perform enforcement functions related to the investigation, identification, arrest and removal of persons determined to be illegally residing in the United States. Interview criminal aliens found in local jails and are determined to be residing in the United States illegally. Knowledge of criminal and immigration law and the use of databases including NCIC, CIS, ATS, CCD and Piers to specify criminal history, immigration status, method and location of entry and visa status. Serve Warrants for Arrest and Deportation, assist in executing civil arrest warrants, and Administrative Removal Orders. Prepare evidence for prosecution for immigration offenses such as criminal re-entries. Assist Fugitive Operations Officers tasked with vetting target intelligence, performing surveillance and locating criminal aliens to affect arrests. Serve as a liaison between the Washington Area of Responsibility (AOR) and contracted facilities used to hold ICE detainees. Compile information concerning the living standards of persons in contracted facilities related to medical treatment, food preparation, transportation, property management and general living conditions. Assist in the implementation of procedures for transporting detainees to other jurisdictions to effect their removal from the United States. Update ICE databases with information about each detainee including health concerns, custody status and biographic information. Serve documents to detainees to record custody status and processing through removal.", "title": "Immigration Enforcement Agent", "startedOn": {"month": 2, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Paul Bevard", "positions": [{"posId": 495657142, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Perform enforcement functions related to the investigation, identification, arrest and removal of persons determined to be illegally residing in the United States. Interview criminal aliens found in local jails and are determined to be residing in the United States illegally. Knowledge of criminal and immigration law and the use of databases including NCIC, CIS, ATS, CCD and Piers to specify criminal history, immigration status, method and location of entry and visa status. Serve Warrants for Arrest and Deportation, assist in executing civil arrest warrants, and Administrative Removal Orders. Prepare evidence for prosecution for immigration offenses such as criminal re-entries. Assist Fugitive Operations Officers tasked with vetting target intelligence, performing surveillance and locating criminal aliens to affect arrests. Serve as a liaison between the Washington Area of Responsibility (AOR) and contracted facilities used to hold ICE detainees. Compile information concerning the living standards of persons in contracted facilities related to medical treatment, food preparation, transportation, property management and general living conditions. Assist in the implementation of procedures for transporting detainees to other jurisdictions to effect their removal from the United States. Update ICE databases with information about each detainee including health concerns, custody status and biographic information. Serve documents to detainees to record custody status and processing through removal.", "title": "Immigration Enforcement Agent", "startedOn": {"month": 2, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 524531823, "new": false, "current": true, "companyName": "US Army", "description": "Supervises and provides support to the battlefield by conducting battlefield circulation control, area security, prisoner of war operations, civilian internee operations, law and order operations on the battlefield and support to the peacetime Army community through security of critical Army resources, crime prevention programs and preservation of law and order. Leads military police teams in support of battlefield operations and leads and supervises small sections in support of security and installation law and order operations. Conduct protection missions in order to ensure a safe operating environment, which included motorcade/formation techniques and site advances for VIP's.", "location": "Fredericksburg, VA", "title": "Military Police Sergeant - Team Leader", "startedOn": {"month": 9, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 524532544, "new": false, "current": false, "endedOn": {"month": 2, "year": 2012}, "companyName": "Pentagon Force Protection Agency - Pentagon Police Department", "description": "Preserved law and order by conducting traffic stops, participating in undercover operations, random anti-terrorism measures, serving warrants, conducting plain clothes (undercover) details, identifying and obtaining evidence from crime scenes, assisting in planning and conducting investigations, dignitary escorts and responding to possible barricade or hostage situations. Conducted executive protection measures in order to ensure a safe operating environment, which included motorcade/formation techniques and site advances for foreign dignitaries visiting the Secretary of Defense. Established perimeter security, neutralized threats and enforced federal and state law to deter possible chemical attacks or terrorist sabotage. Prevented trespassing by unauthorized persons and guarded against tampering and vandalism of property, monitored and operated various communications equipment, alarm systems, and access gates. Controlled access of visitors and contractors, and inspected security devices for proper functioning. Maintained radio equipment and resolved problems associated with vehicles and equipment, and served as the ERT subject matter expert for the Motorola hand-held radios. Was responsible for troubleshooting and repairing minor operator level errors with Motorola hand-held radios.", "location": "Arlington, VA", "title": "ERT Police Officer", "startedOn": {"month": 10, "year": 2010}}, {"posId": 524529991, "new": false, "current": false, "endedOn": {"month": 10, "year": 2010}, "companyName": "Pentagon Force Protection Agency - Pentagon Police Department", "description": "Responsible for force protection, security and law enforcement in the National Capital Region for the people, facilities, infrastructure and other resources at the Pentagon Reservation and for DoD activities and DoD occupied facilities not under the jurisdiction of a Military Department. Maintain law and order and preserve the peace; provide access control; search and secure buildings and evacuate personnel; make arrests enforce federal and state laws; conduct investigations and carry out surveillance. Establish perimeter security, secure areas and stabilize situations, and prevent the escape and further intrusion by perpetrators. Enact Anti-Terrorism Force Protection measures in order to thwart terrorist attacks. Enforce Random Counter Terrorism Measures in order to present DOD facilities as a â\u0080\u009chard targetâ\u0080\u009d. Provide security for the Chairman of The Joint Chiefs of Staff and other high ranking US Officials as well as Foreign Military and VIPâ\u0080\u0099s. Established perimeter security, neutralized threats and enforced federal and state law to deter possible chemical attacks or terrorist sabotage. Prevent trespassing by unauthorized persons and guarding against tampering and vandalism of property, monitors and operates various communications equipment, alarm systems, and access gates. Control access of visitors and contractors,and inspects security devices for proper functioning. Maintain radio equipment and resolving problems associated with vehicles and equipment.", "location": "Arlington, VA", "title": "Police Officer", "startedOn": {"month": 1, "year": 2010}}, {"posId": 524530832, "new": false, "current": false, "endedOn": {"month": 1, "year": 2010}, "companyName": "Fort AP Hill Police Department", "description": "Patrol assigned area of the installation that includes main post, residential and industrial areas, airfields/aircraft landing sights, and isolated range areas. Patrol on foot, bicycle or by motorized vehicle and/or maintains static position on installation gates when assigned. Conduct traffic stops and issue traffic citations. Preserving the peace, crime prevention and protection of lives and property and access control. Arrest persons committing or suspected of committing crimes on the installation. Investigate suspicious circumstances, advises criminal suspects of their constitutional right to silence and to legal counsel. Coordinate with the Desk Sergeant on matters involving assistance from other police or service agencies. Administer first aid and CPR. Prepare written reports of case findings, transport prisoners to holding facilities and appear as a witness in hearings or trials.", "location": "Bowling Green, VA", "title": "Police Officer", "startedOn": {"month": 4, "year": 2009}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Paul", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/paul-bevard-93857289", "location": "Woodbridge, Virginia"}