{"lastName": "Zito", "objectUrn": "urn:li:member:576218537", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1994}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:19974", "degree": "Bachelor of Science - BS", "schoolName": "The Citadel", "startedOn": {"year": 1990}, "eduId": 422993733}, {"endedOn": {"year": 2007}, "fieldsOfStudy": ["Criminal Justice/Law Enforcement Administration"], "school": "urn:li:fs_salesSchool:19627", "degree": "Master's degree", "schoolName": "Norwich University", "startedOn": {"year": 2005}, "eduId": 422993766}, {"endedOn": {"year": 2018}, "fieldsOfStudy": ["Center for Homeland Defense and Security, Executive Leaders Program"], "school": "urn:li:fs_salesSchool:20313", "degree": "Graduate Certificate", "schoolName": "Naval Postgraduate School", "startedOn": {"year": 2017}, "eduId": 434923372}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAACJYZakBLx7i1KuVf1XhhPcXImjMW6FI7gs,NAME_SEARCH,undefined)", "numOfConnections": 6937, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFn-vqwTkxKGA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=MXg3fB9h7RyqNueOb6DxLBgMWp5FmNyff57x0RH733Y", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFn-vqwTkxKGA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=BgayJVWaRNeH14JGYRPORp2IDax6TtFukW85vW3Eb1M", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFn-vqwTkxKGA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=nuOVLTETqIsMFGcn66zf1mF-oQhgdVkYskVrba32nxk", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFn-vqwTkxKGA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=sFLh8B4B1RS4oXreXU9e8fv0sNpm3Y8WZaJmtvRt4Ps", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Assistant Special Agent in Charge at Homeland Security Investigations (HSI)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "High-performing law enforcement professional with 23 years of federal experience in a diverse range of challenging assignments who possesses the desired combination of leadership skills and technical knowledge to direct and oversee the full spectrum of all investigative operations conducted by a field office of the second largest criminal investigative agency in the United States. ", "pendingInvitation": false, "defaultPosition": {"posId": 1182113352, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Supervisory oversight covering all of Orange County, CA which is the sixth most populous county in the U.S., supervising ~85 employees including 6 GS-14 supervisory special agents, 1 GS-14 program manager, 48 HSI special agents, 3 special agents from other federal agencies, 18 state/local police task force officers, 2 intelligence research specialists, 1 auditor, and 6 administrative personnel supporting 7 multi-programmatic groups: National Security/Joint Terrorism Task Force/Worksite Enforcement/Alien Smuggling, ICE-Certified Undercover (CUC) Operations, Contraband Smuggling/Gangs, Orange County Child Exploitation & Human Trafficking Task Force, Financial Fraud Group, and Identity/Benefits Fraud. Apply robust oversight and support administration of an office budget worth ~$3.4 million. Technical authority for adjusting and realigning budget, manpower, and workloads to meet existing operational needs.", "location": "Orange County, California", "title": "Assistant Special Agent in Charge, Homeland Security Investigations (HSI)", "startedOn": {"month": 11, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Mark Zito", "positions": [{"posId": 1182113352, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Supervisory oversight covering all of Orange County, CA which is the sixth most populous county in the U.S., supervising ~85 employees including 6 GS-14 supervisory special agents, 1 GS-14 program manager, 48 HSI special agents, 3 special agents from other federal agencies, 18 state/local police task force officers, 2 intelligence research specialists, 1 auditor, and 6 administrative personnel supporting 7 multi-programmatic groups: National Security/Joint Terrorism Task Force/Worksite Enforcement/Alien Smuggling, ICE-Certified Undercover (CUC) Operations, Contraband Smuggling/Gangs, Orange County Child Exploitation & Human Trafficking Task Force, Financial Fraud Group, and Identity/Benefits Fraud. Apply robust oversight and support administration of an office budget worth ~$3.4 million. Technical authority for adjusting and realigning budget, manpower, and workloads to meet existing operational needs.", "location": "Orange County, California", "title": "Assistant Special Agent in Charge, Homeland Security Investigations (HSI)", "startedOn": {"month": 11, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 998839073, "new": false, "current": false, "endedOn": {"month": 10, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I was assigned to HSI Headquarters as the Division Chief for both the Export Enforcement Coordination Center (E2C2) and the Counter-Proliferation Investigations Unit (CPIU).  In this position, I work closely with the Director of the E2C2 and the Assistant Director for National Security in planning, directing, managing, and coordinating all policies, procedures, and guidelines concerning export enforcement and counter-proliferation investigative activities for ICE.  I direct the activities of approximately 35 personnel and lead the agencyâ\u0080\u0099s mission of serving as the primary forum for the coordination of export enforcement activities of 22 federal agencies.  I manage conflict identification and resolution efforts to enhance export enforcement investigations in furtherance of U.S. national security.  I also work closely with the Assistant Director for National Security in  formulating policies and procedures affecting HSIâ\u0080\u0099s export enforcement investigations and provide guidance and investigative support to HSI personnel assigned to more than 200 domestic and international offices.", "location": "Washington D.C. Metro Area", "title": "Division Chief, National Security Division, Homeland Security Investigations(HSI)", "startedOn": {"month": 5, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 998840032, "new": false, "current": false, "endedOn": {"month": 5, "year": 2016}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I directed a dynamic law enforcement team of 4 group supervisors, over 30 special agents, approximately 20 task force officers, and support staff at LAX.  ASAC LAX is one of the largest airport groups within HSI; the airport ranks as the fifth busiest in the world,   for passenger and cargo traffic.  ASAC LAX is responsible for all criminal investigations under ICE jurisdiction.  I was responsible for overseeing all criminal cases and for the administration of the office, including the physical facility, vehicle fleet, investigative technical equipment, and the storage of evidence.", "location": "Los Angeles International Airport (LAX)", "title": "Assistant Special Agent in Charge, Homeland Security Investigations (HSI)", "startedOn": {"month": 8, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 998839367, "new": false, "current": false, "endedOn": {"month": 8, "year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Selected based on high-level programmatic and investigative experience to manage and direct the Counter-Proliferation Investigations Unit (CPI).  Supervised the long-term, complex criminal investigative activities of 15 criminal investigators from HSI and other federal law enforcement agencies working to identify and dismantle illicit procurement networks seeking to violate and circumvent U.S. export laws.  Established goals, priorities, and strategies for identifying and investigating significant threats located throughout the world with particular focus on exports to Iran and the Middle East.", "location": "Greater Los Angeles Area", "title": "Supervisory Special Agent, Homeland Security Investigations (HSI)", "startedOn": {"month": 5, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 998844597, "new": false, "current": false, "endedOn": {"month": 5, "year": 2009}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "In November 2005, I was promoted to the National Security Unit at ICE Headquarters as a National Program Manager.  I initiated, planned, developed, implemented, and monitored the ICE counterterrorism/foreign counterintelligence/national security program, to include its policies, practices, actions, projects, and goals in assigned areas of responsibility.\nIn June 2007, I was selected for assignment to the newly-formed National Export Enforcement Coordination Network (NEECN), the precursor to the Export Enforcement Coordination Center (E2C2).  As one of two National Program Managers at the time, I was responsible for the procurement of materials to establish the infrastructure of the Unit, including the acquisition of classified national systems for all CPI groups around the country.", "location": "Washington D.C. Metro Area", "title": "National Program Manager, Homeland Security Investigations (HSI)", "startedOn": {"month": 12, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 998843942, "new": false, "current": false, "endedOn": {"month": 12, "year": 2005}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I was assigned to the contraband smuggling group where I developed and investigated criminal organizations involved in narcotics smuggling, international money laundering, trade fraud, counter-proliferation, cyber-crimes,  child exploitation and alien smuggling/trafficking.  I worked closely with other federal and local law enforcement officers and task forces, and represented ICE in Organized Crime Drug Enforcement Task Force (OCDETF) investigations. I also served as a Field Training Agent and was responsible for training and rating the performance of new special agents. \nKey accomplishments include following:\nâ\u0080¢\tLed multiple criminal investigations.  Of note, two of these investigations resulted in 20 arrests, 100% conviction rate, seizure of approximately $1.3m cash, 92 pounds of marijuana, 235 kilograms of cocaine, 75 kilograms of GBL, and additional assets valued more than $60,000.  \nâ\u0080¢\tServed as Team Leader for the deployment of SAC/LA agents to New Orleans after Hurricane Katrina, and assisted in rescue, law enforcement, and humanitarian efforts.", "location": "Los Angeles International Airport (LAX)", "title": "Special Agent", "startedOn": {"month": 1, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 998847179, "new": false, "current": false, "endedOn": {"month": 1, "year": 2003}, "companyName": "U.S. Postal Inspection Service", "description": "I investigated and enforced over 200 federal statues, and conducted criminal investigations involving the criminal exploitation of the U.S. mail and postal system or any activity that adversely affected the postal system including: volume mail theft, identity theft, counterfeiting postal money orders and postage stamps, assaults and/or threats involving postal employees, illicit drug trafficking, mail bombs and suspicious parcels, mail fraud, child pornography, money laundering, robberies, and burglaries involving postal property and its 800,000 plus work force.  \n\nKey accomplishments include following:\nâ\u0080¢\tInitiated an identity theft and financial investigation with ties to Hezbollah that resulted in successful prosecution of all the defendants.  Received US Secret Service Directorâ\u0080\u0099s Award in 2002.\nâ\u0080¢\tConducted investigation of large-scale identity theft ring which resulted in over 32 arrests, 100% conviction rate, and identified financial losses exceeding $1m.\nâ\u0080¢\tConducted undercover buys and executed federal search warrants resulting in the recovery of 20 counterfeit postal master keys (federal offense), which was the largest seizure of its kind.  This case resulted in an 80% decrease in mail theft for the office area of operation impacting a population of over 1 million residences. Received the Federal Bar Associations Distinguished Achievement Award.\n", "location": "Long Beach, California", "title": "U.S. Postal Inspector", "startedOn": {"month": 6, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:30682"}, {"posId": 998848594, "new": false, "current": false, "endedOn": {"month": 8, "year": 1998}, "companyName": "US Army", "description": "I led a Military Police Platoon in a Combat Support Military Police Company.  I trained and supervised a platoon of over 30 soldiers to accomplish its wartime missions of area security, circulation control, prisoner of war operations, and law and order operations.  I was responsible for accountability and maintenance of vehicles, weapons, radios, and equipment valued at over $2.5 million. I also served as the Acting Company Commander for several months in charge of the health and welfare of over 150 soldiers.  \n\nKey accomplishments include following:\nâ\u0080¢\t100% certified on all law enforcement operations and exceeded all Battalion goals and standards set. \nâ\u0080¢\tSelected over my peers by the Brigade Commander to be the Deputy Force Provost Marshal in the Former Yugoslav Republic of Macedonia where I was responsible for the organization, operation, and supervision of 23 multinational United Nations Military Police Officers.  Provided law enforcement oversight for a 1,050 soldier and 165 civilian UN force.  \nâ\u0080¢\tPlanned and successfully executed patrol distribution plans that provided protection and security for all UN personnel in a hostile fire zone.\nâ\u0080¢\tPrepared and conducted personal security escorts for VIPs, and wrote the Military Police Standard Operation Procedures for the mission.  \nâ\u0080¢\tDeveloped the Personnel and Residential Security Plan for the UN mission, and enforced law and order within UN forces as well as protected host nation interests.\nâ\u0080¢\tServed as Lead Advisor to the UN and contingent commanders on all law enforcement matters.\nâ\u0080¢\tConducted a critical military assessment, which identified serious gaps in the security of the Skopje International Airport.  My findings were briefed to the U.S. Ambassador and the Macedonian Secretary of Defense.\nâ\u0080¢\tReceived the United Nations Medal, Army Achievement Medal (2), Armed Forces Service Medal, National Defense Service Medal, and the Army Commendation Medal for impeccable service.", "location": "Germany / Former Yugoslavia", "title": "Platoon Leader, Military Police", "startedOn": {"month": 1, "year": 1995}, "companyUrn": "urn:li:fs_salesCompany:1223"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Mark", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/mark-zito-975b83140", "location": "Orange County, California Area"}