{"lastName": "Drakeford", "objectUrn": "urn:li:member:102428352", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Logistics and Supply Chain", "educations": [{"endedOn": {"year": 2019}, "fieldsOfStudy": ["Military Strategic Studies, General"], "school": "urn:li:fs_salesSchool:3153260", "schoolName": "The United States Army War College", "startedOn": {"year": 2017}, "eduId": 425755575}, {"endedOn": {"year": 2015}, "fieldsOfStudy": ["Organizational Leadership"], "school": "urn:li:fs_salesSchool:21142", "degree": "Doctor of Philosophy (Ph.D.)", "schoolName": "Northcentral University", "startedOn": {"year": 2008}, "eduId": 277978542}, {"endedOn": {"year": 1992}, "fieldsOfStudy": ["Human Resources Management/Personnel Administration, General"], "school": "urn:li:fs_salesSchool:18732", "degree": "Master's degree", "schoolName": "Webster University", "startedOn": {"year": 1991}, "eduId": 101179740}, {"endedOn": {"year": 1987}, "fieldsOfStudy": ["Political Science and Government"], "school": "urn:li:fs_salesSchool:19608", "degree": "Bachelor of Arts (B.A.)", "schoolName": "Virginia Commonwealth University", "startedOn": {"year": 1983}, "eduId": 82677870}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAYa7sABzTopFKyPbT-5VoCEoSXPUW5AxQo,NAME_SEARCH,undefined)", "numOfConnections": 1064, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEJ6v3pNVCCjw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=kERQ87AJBJFgX6AsA2U6uoGFEfoKBpgxpxw-YHaAwP4", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEJ6v3pNVCCjw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=217fkHL31g0CLxD-OLNx4RhGQIxjEoQ1YyT8ueQ78Zs", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEJ6v3pNVCCjw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=eURFxKkNFHW-pMevzk2K2bhur0aQ1mzoLYAyf6hdfV8", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQEJ6v3pNVCCjw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=8fV5RtQ4EAjrBQV63YvdyEwh7mKpXeLkgFrGptFtQM0", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Law Enforcement/Logistics", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "LTC (P)-US Army", "pendingInvitation": false, "defaultPosition": {"posId": 647953131, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Conduct legal research to support decisions on deportation/exclusion cases and assist attorneys in representing the Government in court actions; Work with other Federal law enforcement officials to identify, locate and/or apprehend aliens; Prepare, present and defend deportation or exclusion proceedings; and ensure the physical removal of aliens from the United States .Working with both criminal and/or non-criminal aliens in the United Sates at various stages of their deportation/exclusion proceedings; responsible for conducting complex investigations; conduct surveillance work; preparing investigative reports; and assisting in complex, difficult, or sensitive seizures.", "location": "Baltimore, Maryland Area", "title": "Law Enforcement Officer", "startedOn": {"month": 4, "year": 1993}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Dr. John Drakeford", "positions": [{"posId": 647953131, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Conduct legal research to support decisions on deportation/exclusion cases and assist attorneys in representing the Government in court actions; Work with other Federal law enforcement officials to identify, locate and/or apprehend aliens; Prepare, present and defend deportation or exclusion proceedings; and ensure the physical removal of aliens from the United States .Working with both criminal and/or non-criminal aliens in the United Sates at various stages of their deportation/exclusion proceedings; responsible for conducting complex investigations; conduct surveillance work; preparing investigative reports; and assisting in complex, difficult, or sensitive seizures.", "location": "Baltimore, Maryland Area", "title": "Law Enforcement Officer", "startedOn": {"month": 4, "year": 1993}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 851142285, "new": false, "current": false, "endedOn": {"month": 7, "year": 2017}, "companyName": "US Army", "description": "Responsible for daily interaction with UAE Ministry of Foreign Affairs, UAE Ministry of Defense, UAE General Headquarters, and the UAE Joint Operations Command to ensure all diplomatic documentation are correct in order to receive the required UAE Customs Clearance for SDDC cargo with movement in and out of UAE. Work daily with the 831st Transportation Battalion's DET at Jebel Ali Port, all Carriers with cargo movement by air-land-sea, DNATA (APOD), by providing approved custom clearances and to resolve any customs issues. Work with the US Embassy in the United States Liaison Office (USLO) supporting all US Joint Forces within CENTCOM area of operations as their UAE Customs Officer.", "location": "United Arab Emirates", "title": "Forward Strategic Transportation Officer (FSTO)", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 1019147387, "new": false, "current": false, "endedOn": {"month": 7, "year": 2016}, "companyName": "US Army", "description": "Battalion Commander for a six company motor transportation battalion supporting 773 Soldiers geographically dispersed over nine locations. Provided vision, guidance and a common operation picture for the organization. Coached, mentored, and trained six subordinate Company Commanders and staff. Responsible for preparing unit for its wartime mission by maintaining the highest levels of operational readiness, providing tough and realistic training, and enforcing Army standards. Maintained good order, high morale, and discipline in the organization. Developed subordinates for positions of higher responsibility. Worked with the Group Commander to fulfill the higher headquarters' mission and goals.", "location": "Livingston, Alabama", "title": "Battalion Commander", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 266386693, "new": false, "current": false, "endedOn": {"month": 11, "year": 2014}, "companyName": "Special Operations Command Central (SOCCENT)", "description": "Principal assistant to the Commander, Joint Information Support Task Force (Special Operations) in support of Operation ENDURING FREEDOM. Assumed Command during Commander's absence.  Comprised of 130 Soldiers, Airmen, Marines and Civilians; JISTF(SO) was responsible for coordinating and conducting Military Information Support Operations (MISO) in the CENTCOM AOR through 3 Military Information Support Team (MIST) operating through U.S. Embassies in Lebanon, Yemen and Afghanistan and the JSOFT-GCC based in Bahrain.  Managed a $15 million budget. Maintained accountability of $3 million dollars worth of U.S. Government equipment. Coordinated staff actions with CENTCOM, SOCCENT and CFSOCC.", "location": "Doha, Qatar", "title": "Chief of Staff", "startedOn": {"month": 9, "year": 2013}}, {"posId": 1019148286, "new": false, "current": false, "endedOn": {"month": 10, "year": 2013}, "companyName": "US Army", "description": "Served in the European Deployment and Distribution Operations Center (EDDOC), Logistics Directorate, HQ, U.S. European Command (EUCOM) as the logistics officer to plan, allocate, apportion and monitor multi-modal sustainment and distribution activities within and throughout the 51-country EUCOM Area of Responsibility (AOR).  Lead a branch of seven military and U.S. civilian joint logistics/transportation planners.  Worked with the Defense Logistics Agency (DLA) and Surface Deployment and Distribution Command (SDDC) to provide logistics expertise to the EUCOM commander and staff, subordinate service components, the North Atlantic Treaty Organization (NATO) and coalition governments, Operation ENDURING FREEDOM (OEF), and other contingency operations.", "location": "Stuttgart Area, Germany", "title": "Plans Officer", "startedOn": {"month": 5, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 1019147462, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "US Army", "description": "Executive Officer and Installation Manager for the Military Ocean Terminal, Concord (MOTCO), California; Supervised the Director of Public Works (DPW), Director of Emergency Services and the effective management of the physical facility maintenance and facility maintenance, renovation and upgrades.  Supervised all physical security and antiterrorism measures to include a Department of the Army Police force, a contracted security force and a Fire Department consisting of a command cell of two police/security chiefs, one fire chief, a Director of Emergency Services, a Provost Marshal section, an Antiterrorism Officer, a 44-person police/security unit and 26 firefighters. Supervised the Director of Information Management with and installation server and communications and network systems.   Was responsible for equipment totaling over $25M. DirectedDPWs and coordinated efforts to maintain and upgrade MOTCO's physical facilities and directing the drafting of the Real Property Management Plan (RPMP).", "location": "Concord, California", "title": "Executive Officer", "startedOn": {"month": 5, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 1019150090, "new": false, "current": false, "endedOn": {"month": 5, "year": 2012}, "companyName": "US Army", "description": "Chief of  the Northern Distribution Network section of the Military Surface Deployment and Distribution Command Transportation Brigade located in Rotterdam, the Netherlands; consisting of a Headquarters and two transportation battalions with a diverse workforce of 269 personnel located in Central Region Europe, the Benelux, United Kingdom, Italy, Greece, Turkey, and the Azores.  Enabled surface multi/inter-modal port and distribution network movement operations to deliver combat power and DoD cargo to assure strategic depth / advantage across the USEUCOM, USAFRICOM, and USCENTCOM AORs.  Designated as the Army Liaison Officer to the Benelux Chapter of the National Defense Transportation Association (NDTA", "location": "Rotterdam Area, Netherlands", "title": "Northern Distribution Network (NDN) Chief", "startedOn": {"month": 6, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 1019148384, "new": false, "current": false, "endedOn": {"month": 6, "year": 2009}, "companyName": "US Army", "description": "Performed duties as primary instructor for 75 cadets/students, to include academic advisor and chief counselor. Assisted in targeted recruiting, developing leaders, and retaining quality prospects for commissioning. Acted as the battalionâ\u0080\u0099s test control officer for cadre and cadet testing requirements. Taught Military History 204 and US History 305 to over 35 cadets/ students.", "location": "Bowie State University, Bowie, MD", "title": "Assistant Professor Of Military Science", "startedOn": {"month": 7, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 1019149308, "new": false, "current": false, "endedOn": {"month": 7, "year": 2008}, "companyName": "US Army", "description": "Acted as a liaison between 1st Army and civilian contractors at Ft. Dix, ensuring compliance with contract terms and conditions of work for $12.5 million dollar contracts. Monitored contracted role players for quality performance and realism as Civilians on the Battlefield and Foreign Language Speakers. Received, reviewed, and forwarded training support requests from six brigade training committees to civilian contractor scheduling and allocation. Maintained contract integrity and produced modifications to contract as required. ", "location": "Fort Dix, NJ", "title": "Contract Officer Representative", "startedOn": {"month": 8, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 1019149357, "new": false, "current": false, "endedOn": {"month": 7, "year": 2004}, "companyName": "U.S. Department of Homeland Security", "description": "Managed and supported numerous diverse and complex investigations that require an analysis of financial and scientific research. Identified complex INS related criminal, civil, and administrative inconsistencies, which later evolved in an investigation. Analyzed foreign and domestic documents gathered from INS and government agencies. Developed and spearheaded intelligence-training programs by utilizing FDL resources. Identify and create deterrents to fraudulent and undocumented immigration. Oversee examinations of refugees seeking admission to the United States and probed for discrepancies of petitions filed by U.S. citizens on behalf of quota and non-quota spouses, and children. Prepared motions to reconsider appeals. Determined the need of certain revisions of INS policies. Lead research in determining validity of information that was being furnished to INS and other government agencies. Briefed agents, auditors, and federal contractors on programs, contracts, and subjects involved in the investigation. After briefing special agent, each interview is reviewed to ascertain the progression of the investigation. Resources from other field offices are utilized to assist in the investigation. Investigations are concisely planned in an efficient and timely manner in accordance with the INS Criminal Investigator Division guidelines in making the final determination on individual cases \n\n", "location": "Rome Area, Italy", "title": "Immigration Officer", "startedOn": {"month": 9, "year": 2001}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 1019147628, "new": false, "current": false, "endedOn": {"month": 9, "year": 2003}, "companyName": "US Army", "description": "Served as Chief of Transportation for Area Support Group (ASG) Eagle. Responsible for providing logistical transportation support to external organizations operating in the ASG AOR. Managed all modes of transportation in support of Task Force Eagle mission to include line haul, rail, and air. In addition, maintained supervision over the Branch Movement Control Team. Supervised and managed the Container Handling Storage Area and was in charge of development and enforcement of the theater container management policy. Representative for local customs control and compliance in MNB (N). ", "location": "Bosnia and Herzegovina", "title": "Chief of Transportation", "startedOn": {"month": 9, "year": 2002}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 1019150284, "new": false, "current": false, "endedOn": {"month": 9, "year": 2001}, "companyName": "U.S. Immigration & Naturalization Service", "description": "Conducted comprehensive investigations of high profile, high impact employers suspected of violating the administrative, civil, and/or criminal provisions of the employer sanctions laws of the United States, as provided for in the Immigration and Nationality Act (INA). Conducted compliance inspections, which required extensive review and audit of personnel records and other evidence to determine if there had been violations of criminal or civil laws. Initiated, planned, and conducted comprehensive, complex criminal investigations that involve large scale fraud, marriage fraud, and conspiracies to defraud and violate immigration laws and criminal statutes. Investigated highly organized criminal rings with several layers of organization between the principals and the prime perpetrator. Arrested, interviewed and interrogated illegal aliens, permanent residents, and United States citizens who had or were suspected of violating the immigration and nationality laws of the United States. Served as a case agent for interagency investigations utilizing teams of additional special agents necessary to develop cases and successfully conclude them depending upon the size of the criminal organization. Consulted frequently with the Assistant United States Attorney and the INS supervisor concerning logistical and strategic questions that arised during an investigation. Prepared cases that included the proper seizing, or otherwise obtaining, marking and inventorying of evidence. Exercised responsibility for safeguarding the integrity of an investigative program. Conducted a variety of less complex and less sensitive investigations. Investigated high profile smuggling rings in Central America and conducted successful prosecutions of many of the smugglers that were operating out of these smuggling rings. Researched and verified immigration status and/or criminal history by querying various database systems. ", "location": "Alexandria, VA", "title": "Criminal Investigator", "startedOn": {"month": 3, "year": 1998}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Dr. John", "numOfSharedConnections": 0, "memberBadges": {"premium": true, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/dr-john-drakeford-8003772a", "location": "Harrisburg, Pennsylvania Area"}