{"lastName": "Uriostegui", "objectUrn": "urn:li:member:255792856", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2019}, "fieldsOfStudy": ["Managment"], "school": "urn:li:fs_salesSchool:18706", "degree": "Human Resource", "schoolName": "Park University", "startedOn": {"year": 2015}, "eduId": 305546352}, {"endedOn": {"year": 2019}, "fieldsOfStudy": ["Human Resources Management/Personnel Administration, General"], "school": "urn:li:fs_salesSchool:18574", "degree": "Bachelor's degree", "schoolName": "University of Maryland University College", "startedOn": {"year": 2015}, "eduId": 500019688}, {"endedOn": {"year": 2005}, "schoolName": "West Rowan High School", "startedOn": {"year": 2001}, "eduId": 222493353}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAA8_FtgBKUACfDZpnJ8BTAp4k765epZbZZI,NAME_SEARCH,undefined)", "numOfConnections": 200, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQG7PlJemG6C4w/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=lYcvUSvNZ4-EzlOaMon9R-xIyTxbbrqatXhJqYd9TEI", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQG7PlJemG6C4w/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=l5eQB-ZZ1vSdornYuhFJMjTd2yqz48eKww9RCmoDfT4", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQG7PlJemG6C4w/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=XAyxVmHsUvzR-se1XQ-OElXwrCUPYbALEnvITc7hTHU", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQG7PlJemG6C4w/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=AlysLTd7MAnuQJmhV1kheP1U7YgEPV4e38oHMWSLscA", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Management and Program Analyst in the Budget Office.", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Passionate and dedicated professional with more than twelve years of experience as an administrative professional in the Marine Corps. Continually exhibits high performance in all aspects of work with attributes such as honesty, dependability, timeliness and follow-through with projects and reports, tactful in quick operations and decision-making, assertive in appropriate situations yet still approachable, all while supporting the mission of the enterprise. Served in Iraq in support of Operating Iraqi Freedom from 2007-2008 and then again from 2008-2009. Educated on Standard Labor Data Collection and Distribution Application (SLDCADA).", "pendingInvitation": false, "defaultPosition": {"posId": 911611033, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington, District Of Columbia", "title": "Management and Program Analyst", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Jennifer Uriostegui", "positions": [{"posId": 911611033, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington, District Of Columbia", "title": "Management and Program Analyst", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 543545015, "new": false, "current": false, "endedOn": {"month": 3, "year": 2016}, "companyName": "Marine Corps Recruiting", "description": "Effectively create/maintain profiles for family members and Wounded, Ill and Injured Marines in the case of Non-Medical Attendants (NMA), Special Compensation for Assistance with Activities of Daily Living (SCAADL), and Defense Travel System (DTS). Intensive knowledge of administrative and financial management systems and programs such as Word, Excel, Power Point. Processing profiles for administrative and financial management for over 100 Wounded, Ill and Injured (WI&I) Marines and their families/caregivers. Lead instructor of NMA, SCAADL, DTS, educated and supervised junior personnel in the daily process/policies on these programs. Human resource regulatory compliance; conducted periodic audits of DOD/USMC records in accordance with compliance regulations and industry best practices. Conducted exit interviews, compiled results, and communicated trends to Senior Management; managed the overall performance management process; including the redesign of the existing initial 90-day and annual employee audit reviews. Human Resource Policy Guidance to managers and staff members on various updates of all programs such as NMA/TAD/SCAADL/DTS to include per diem rates changed by the Joint Travel Regulations (JTR). Employee Eligibility; process personnel actions; determines effects of eligibility for leave, benefits, of our Wounded, Ill and Injured veteran's; prepares or completes necessary documents. Supervisory Controls; utilizes programs and judgment to adapt to guidelines specific to cases or problems with the ability to interpret policies and procedures to those outside of the office, solves complex/unusual issues by conducting research and analysis as required to create an action plan using reports, justifications, policies. Labor employee relations such as coaching and counseling, workplace investigations and other legal matters; reviewed and made recommendations to existing human resources policies and procedures.", "location": "Walter Reed National Military Medical Center, Bethesda MD", "title": "Administrative, 0301, Travel/Financial Manager", "startedOn": {"month": 9, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 718635860, "new": false, "current": false, "endedOn": {"month": 9, "year": 2013}, "companyName": "Marine Corps Recruiting", "description": "- Conduct daily physical training. \n- Attend classes on objectives of being a Drill Instructor. \n", "location": "Marine Corps Recruit Depot Parris Island, SC", "title": "Student at Drill Instructor School", "startedOn": {"month": 7, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 718636663, "new": false, "current": false, "endedOn": {"month": 7, "year": 2013}, "companyName": "Marine Corps Recruiting", "description": "Supervised an office of 5 Marines and worked in a high paced setting for over 3,000 Marines across MAG-39. Drafted and supervised the processing of Basic Housing Allowance (BAH), Warrant Office/Geography Bachelor portfolios. Making sure everything is accounted for and all financial allowances are accounted for approval from higher echelon. Assisting the Finance Defense Travel Administrator as the Organizational Defense Travel Administrator for the command on all DTS related authorizations and vouchers. Taking action on completion of all authorizations and vouchers to payment fulfillment. Utilized programs and judgment to adapt to guidelines specific to cases or problems with the ability to interpret policies and procedures to those outside of the office. Prepares status and reports covering open and complete requests for personnel to include financial budgets for Temporary Additional Duty Orders, Promotion packages, Officer Program packages. Research regulatory material to obtain factual information based on pay, vacation leave day issues. By using specific programs and procedures and policies, ability to resolve these issues. Effectively trained and educated Marines across the company on the base in travel orders and final payments of the GTCC. Created and maintained over 4 training jackets, focusing on mentoring, training, and counseling to include both positive and negative; as well as completion of required training for specific rank per individual as well as annual training across the board. Improved the DTS process and procedures with the updated policies of DTS to streamline the amount man hours involved with the authorizations and vouchers for over 300 Marines.\n\nKey Accomplishments\nIn this short time; became the go to administrative specialist for all Defense Travel System related issues. All pay issues were sent directly to me to educate and teach junior administrative clerks on how to effectively research and regulate pay issues brought before the office.", "location": "Marine Corps Base Camp Pendleton, CA", "title": "Administrative and Travel Specialist Manager", "startedOn": {"month": 1, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 718635593, "new": false, "current": false, "endedOn": {"month": 1, "year": 2013}, "companyName": "Marine Corps Recruiting", "description": "Resolved pay related issues for over 200 Marines. Supervised over 3 Marines in this time frame, across this time, took charge of 4 other Marines for two other detachments on 6 month deployment. Each detachment (3 totals) had about 50 Marines each; of these 3 detachments; attached to HMM-262 in Okinawa Japan.\n\nAdministrative Operations Proactively sought knowledge of administrative operations on a daily basis and communicated tasks to subordinates in preparation of this 6 month deployment. In preparation of this deployment, worked with entire command of HMLA-367 to prepare every Marine to travel on DTS authorization while parent command moved entire unit to Hawaii and two other detachments to two separate Marine Expeditionary Units for deployments across the seas.\n\nWorkforce Management; worked with base echelon at the Installation Personnel Administrative Center to make all personnel on detachment in compliance with base polices for Unit Deployment Program, and verifies all meal cards needed for this deployment to Okinawa Japan.\n\nTechnical Decisiveness; took charge of the Defense Travel System program for this detachment and the entire unit deployed plus the other 2 sub-unit detachments, Oversaw, monitored and managed all internal detachments and main units programs and polices pertaining to each detachment and unit. \n\nManagement Oversight; managed and oversaw these 2 other sub unit detachments and main units administrative clerks; while teaching and educating each administrative clerk on the process and procedures for different programs across the administrative section to include; Defense Travel System, Marine Online, Government Travel Charge Card, Unit Deployed Program, Per Diem Rates via Joint Federal Travel Regulations.\n\nKey accomplishments\nActed in the capacity of a Team Manager for 3 Sub Unit detachments attached to a larger Marine Corps Unit; over all consisting of over 650 Marines.\n", "location": "Marine Corps Base Camp Pendleton, CA", "title": "Financial Management, Travel and General Administrative Specialist", "startedOn": {"month": 7, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 718634942, "new": false, "current": false, "endedOn": {"month": 7, "year": 2011}, "companyName": "Marine Corps Recruiting", "description": "Supervisory controls; Found commendable and attained â\u0080\u009cMission Capableâ\u0080\u009d status during an Inspection of the Region in administrative operations in the following functional areas: general administration, legal procedures, all administrative files, and Permanent Change of Station Orders procedures and files. \n\nAs the local Agency Program Coordinator (APC); ensured that over 150 service members had Government Travel Charge Cards and were open/closed upon start and completion of all travel for all required expenses. Verified proper allotted dollar amount allowed for each traveler separately. \n\nProcessed and settled over 150 travel claims and 258 annual record administrative audits and processed 240 PCS orders for the Marine Security Guards leaving Region 2, along, with all correspondence for incoming Marines into the Region. \n\nExecutes Reassignments; compiled all information needed for two Watch Stander Movement Windows for 21 detachments, correlating to human resource movement of individual Marines to their next post based on their past, present posts, professionalism, career advancement and detachment requirements. \n\nSensitive Administration; Tracked over 283 behavioral assessments and training records throughout the Region; These BAT records contained personal information pertaining to each individual attached to Region 2 as a Marine Security Guard for behavioral guidance, in case one individual became over whelmed from personal stressors to where it would hinder their job as a United States Marine Corps Embassy Security Guard in a foreign country.\n\nKey accomplishments\nAssisted executive levels to determine which personnel were best for future posts across the world; cross referencing their past, present post and their behavioral assessment tools to finalize their next post. \n", "location": "American Embassy Abu Dhabi, United Arab of Emirates", "title": "Travel, General Administration, and Personnel Movement Specialist", "startedOn": {"month": 7, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 718637041, "new": false, "current": false, "endedOn": {"month": 7, "year": 2009}, "companyName": "Marine Corps Recruiting", "description": "Administrated a wide variety of tasks to include personnel, payroll, orders, promotions, decorations and awards for over 400 personnel. Assured that over 300 Personnel were paid accurately before, during and after both deployments to Iraq in support or Operation Iraqi Freedom on both deployments; July 2007 â\u0080\u0093 February 2008 and then again September 2008 â\u0080\u0093 March 2009. Properly followed written and verbal instructions utilizing technical knowledge required and the written regulations published; base and Marine Corps wide. \n\nAcademia and training; Developed, implemented and executed internal procedures and policies for the DOD program; Defense Travel System; by developing, executing, and verifying final pay for all authorizations and orders. Processed funded Temporary Additional Duty orders and non-funded orders for over 300 personnel, created and maintained Defense Travel System personnel profiles and kept all personnel informed of all updates to polices pertaining to Defense Travel System; to include all training required to for each personnel of over 300 to utilize the Defense Travel System.\n\nTrained on mail room procedures, picked up, dropped off, sorted and routed mail from the base Post Office to the unit. \n\nProvided administrative and clerical support for over 300 Marines ranging from every day pay related issues to in-depth orders and correspondence. Collected, complied and organized information and data to meet administrative requirements for command staff. \n\nMaintained over 3,000 official files, records, and reports, Clarified company personnel policies, benefits, and procedures to current and new Marines.\n\nKey accomplishments\nAcademia and training; With the implementation of the DTS program; conceived and designed the standard operating procedures for the program in time for first major utilization before a deployment to Iraq. Took lead in program development as a junior team leader.\n", "location": "Marine Corps Air Station Cherry Point, NC", "title": "Administrative and Legal Assistance Team Leader", "startedOn": {"month": 7, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:2039"}, {"posId": 398257982, "new": false, "current": false, "endedOn": {"month": 7, "year": 2007}, "companyName": "United States Marine Corps", "description": "Provided administrative and clerical support for over 15,000 personnel ranging from program entries to separation of retirees and administrative separations. \n\nLearned the duties rapidly and performed upper level duties within 6-8 months of assignment. Controlled and monitored the documents required for proper separation for the following categories of military separations, administrative Separation, Retirement, and regular end of active service separation. \n\nUtilized programs to input information into the Marine Corps Total Force System in a diary format for information to be effective in individualâ\u0080\u0099s permanent service record books. These diary entries were reviewed and approved by separations staff and officer, Maintained over 9,000 official files, records, and reports. Clarified company personnel policies, benefits, and procedures to current and new Marines.\n\nKey accomplishments\nTracked retiring separating personnel; briefing them all on retiring financial policies and programs such as the Service Benefit Plan, Created a standard procedures for separating administrative separating personnel to better process the packages from creation to completion.\n", "location": "Marine Corps Air Station Cherry Point, NC", "title": "Separation Administrative and Team Member", "startedOn": {"month": 2, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:2039"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Jennifer", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/jenniferuriostegui", "location": "Washington D.C. Metro Area"}