{"lastName": "Bustamante", "objectUrn": "urn:li:member:156612851", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Relations", "educations": [{"endedOn": {"year": 2015}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:19568", "degree": "BBA", "schoolName": "Averett University", "startedOn": {"year": 2011}, "eduId": 93358775}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAlVuPMBi5AKDaeH86eTqBJcvjKGXfVC35I,NAME_SEARCH,undefined)", "numOfConnections": 170, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG4gD8dq5tkpQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=F1RZTLXN-xnCBgNKMSzFOSBBKBo_jXvBOkkHB2iGEHA", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG4gD8dq5tkpQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=Qa1mrWmG3Kc3QWrxeo4IbcTq7efuXbgnq2gJ0g8OZ9A", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG4gD8dq5tkpQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=X7qX2WzOcMcmkGfjcjh7-O2odd8X2vH-k7_mX41GyNI", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQG4gD8dq5tkpQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=Y-mysTbyl-knyFVFuK3agRh8QLGXaUNTItO5poDrctI", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Intelligence Research Specialist at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I am a career military professional looking for a position with strong potential for professional and personal growth at an exciting, innovative, and diverse corporation where my expertise and abilities will enhance customer satisfaction and the organizationâ\u0080\u0099s commitment to excellence.\n\nI have acquired 21 years of progressive, broad-spectrum management and supervisory experience since joining the United States Army as a 13F (Fire Support Specialist), being assigned as a Senior Drill Sergeant in a Multiple One Station Unit Training Battery that incorporates Basic Combat Training and Advanced Individual Training and culminating in my retirement as the Senior Manager for the 1st Information Operations Command, from the United States Army, located on Fort Belvoir, VA. Based upon my ability to lead, manage vast resources, and skillfully juggling priorities in performance-critical environments, I have been entrusted to oversee numerous projects and programs requiring capable leadership and aggressive follow through.\n\nI attribute my success thus far to several key factors: (1) a capacity for continued personal and professional growth, (2) advanced interpersonal and analytical skills, (3) ability to find structural solutions to organizational challenges, (4) command of presentation and communication skills, and (5) ability to analyze roadblocks and apply creative problem-solving to reach objectives.", "pendingInvitation": false, "defaultPosition": {"posId": 591738295, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Prepares instructions, guides, and manuals to support many different and unrelated new processes and methods for the collection of intelligence information. Continually monitors incoming intelligence to identify and alert staff members to developments of special urgency or importance.\n\nAdvises on or develops potential sources of information within and outside the intelligence community, including those that are unsecure or covert. Answers questions, considering the situation and clearance of the interrogator to provide the appropriate level of information, regarding sources and methods used to collect materials.\n\nAssists in the planning and development of group reports or other products. Independently develops instructions, guides, and manuals to support established dissemination standards and methods dealing with conventional intelligence problems, questions, or situations. Analyzes and reviews the intelligence dissemination process. Reviews the application of intelligence safeguarding routines, and reports security breeches or concerns to a supervisor or higher-grade specialist.", "location": "Washington D.C.", "title": "Intelligence Research Specialist", "startedOn": {"month": 10, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "John Bustamante", "positions": [{"posId": 591738295, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Prepares instructions, guides, and manuals to support many different and unrelated new processes and methods for the collection of intelligence information. Continually monitors incoming intelligence to identify and alert staff members to developments of special urgency or importance.\n\nAdvises on or develops potential sources of information within and outside the intelligence community, including those that are unsecure or covert. Answers questions, considering the situation and clearance of the interrogator to provide the appropriate level of information, regarding sources and methods used to collect materials.\n\nAssists in the planning and development of group reports or other products. Independently develops instructions, guides, and manuals to support established dissemination standards and methods dealing with conventional intelligence problems, questions, or situations. Analyzes and reviews the intelligence dissemination process. Reviews the application of intelligence safeguarding routines, and reports security breeches or concerns to a supervisor or higher-grade specialist.", "location": "Washington D.C.", "title": "Intelligence Research Specialist", "startedOn": {"month": 10, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 490839625, "new": false, "current": false, "endedOn": {"month": 5, "year": 2015}, "companyName": "Wheels Up - Classic Iron", "description": "Teach potential motorcycle riders on how to operate a motorcycle safely, with emphasis on the special skills and mental attitude necessary for dealing with traffic. \n\nInstruct students in classroom environment on the different types of motorcycles, their controls, and how they operate.  Advise students on personal protective gear and what to wear for comfort and protection.  Instruct students on the how alcohol and drugs will affect their ability to ride safe.  Develop students to create a strategy for riding in traffic and dealing with critical situations.\n\nConducts range operations, starting students off with straight-line riding, turning, shifting and stopping. Then, progress students to cornering, swerving and emergency braking. \n\nAdminister students a knowledge test and a skills evaluation test.", "location": "Fredericksburg, VA", "title": "Motorcycle Rider Instructor", "startedOn": {"month": 11, "year": 2013}}, {"posId": 239087495, "new": false, "current": false, "endedOn": {"month": 10, "year": 2013}, "companyName": "US Army, 1st Information Operations Command", "description": "o Managed and directed tactical and technical guidance to major Army commands, five subordinate managers and a staff of 200 employees in daily and future operations of the command, while serving as the Operations and Planning lead. Ensured that team requirements were met in accordance with time sensitive requirements. Managed operations of the division with oversight of operational and administrative requirements with a $5.4 million operating budget. . \no Effectively wrote and streamlined standard operation procedures to ensure operations conformed to Army standards. \no Instrumental in developing measures of performance, organizing and conducting performance reviews, soliciting stakeholder input, and improving quality audit scores. Coordinated with other team personnel and subs to identify and analyze existing and emergent issues, and develop effective mitigation recommendations and strategies.\no Supervised the day-to-day operations of the organization by reaching, reviewing, and analyzing documents on behalf of senior leadership.  \no Successfully developed and implemented annual testing requirement to meet mission objectives and readiness. Developed a plan to manage a minimum of nine annual testing programs for over 300 personnel. Effectively prepared Soldiers for worldwide deployments to build confidence, competence, and team building skills.\no Successfully managed and supervised  the  training  for command personnel. Analyzed and tracked compliance with the annual training requirements.. Provided data collection and analysis to meet program review and evaluation requirements. Achieved success in program by having 95% database compliance and 100% Army Weight Control Program compliance (no deficiencies). \no Cleary and concisely advised senior management using clear, well thought out analysis of various reports to ensure training programs met Army requirements and standards.", "location": "Fort Belvoir, VA", "title": "Plans and Operations Manager", "startedOn": {"month": 12, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 245673702, "new": false, "current": false, "endedOn": {"month": 12, "year": 2011}, "companyName": "US Army, Field Support Detachment (FSD)", "description": "o Managed an annual training and travel budget in excess of $180,000. Maintained accountability of over 30 personnel and $20,000 in equipment. \no Successfully developed and implemented training policies by utilizing data to identify trends to find solutions to improve command programs. \no Performed staff visits to review and inspect sub unit training programs. Advice commanders and supervisor in building effective training programs and ensured compliance with Army standards.\no Created an effective system to manage unitâ\u0080\u0099s formal school quotas; created programs to validate and prioritize annual and out-of-cycle training requirements.\no Analyzed data and trends to create objective products that were disseminated to over 100 personnel.\no Led programs to delivery and ensured accomplishment of goals, objective and priorities.\no Coordinated assets for deployed teams for multiple joint operations.\no Assessed Concepts of Operation (CONOPs) to enhance kinetic effects, degrade insurgent influence, and increase public awareness of the partnered military force.\no Supervised the execution of pre-deployment mission exercises, the deployments of deployed teams, and implemented training program.\no Conducted research of all joint task force missions to provide the commander and staff with situational awareness of threats, world events and/or natural disasters. Identified mission essential functions, process analyses, risk assessments, and hazard mitigation. Researched laws, regulations, and policies to ensure missions were executed in accordance with the applicable mandates. \no Utilized supportive relationships with other U.S. and international governmental agencies to Enhanced CONOPs. Collected, compiled, and analyzed intelligence and operational data for running assessment of multi-national forces; viewed at senior executive levels.", "location": "Fort Belvoir, VA", "title": "Manager/Planner", "startedOn": {"month": 6, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 245673052, "new": false, "current": false, "endedOn": {"month": 6, "year": 2010}, "companyName": "US Joint Forces Command, Joint Targeting School", "description": "o Developed courseware, implemented and supervised the overall Joint Targeting School training requirements within the staff course in regards to joint fires, maintained 100% accountability and serviceability of all schools equipment valued in excess of $1 million.\no Developed new and updated existing study  guides for a diverse student population and Tomahawk Land Attack Missile courseware that enhanced the students to understand the capabilities of joint fires. Instructed over 300 U.S., international, and civilian students on field artillery capabilities and joint battle space. \no Provided written analysis and recommendations from collected data to improve curriculum within training program.\no Senior liaison for hundreds of students and staff, including international students. Supervised the successful preparation of all the Joint Targeting School classrooms.  \no Supervised the physical and professional development of the staffâ\u0080\u0099s enlisted personnel. \no Managed the supply and purchase accounts for a joint organization in excess of $2.4 million.", "location": "Virginia Beach, VA", "title": "Course Instructor/Manager", "startedOn": {"month": 6, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:35493"}, {"posId": 244036932, "new": false, "current": false, "endedOn": {"month": 6, "year": 2009}, "companyName": "US Army, 10th Mountain Division", "description": "o Planned, synchronized, and executed complex Joint Fires plans of over 70 squadron and troop level combat operations; was instrumental to mission accomplishment while leading the fire support current operations cell on all combat operations.\no Served as the Squadron Air Planner, enabling troop movements between forward operating bases, and planned and synchronized seven combat air missions.  \no Planned, coordinated, synchronized Intelligence, Surveillance, and Reconnaissance (ISR).  Analyzed intelligence reports to target enemy strongholds.\no Planned and coordinated security for coalition and local nationals.\no Conducted over 150 missions in support of OIF; Prepared daily security briefs; developed fire support CONOPS involving operational and intelligence analysis. \no Maintained accountability and operational readiness of vehicles and combat equipment valued in excess of $1,000,000.\no Educated and trained junior personnel at various locations in support of military transition teams. \no Planned, resourced, and executed training in preparation of certification prior to deployment. \no Responsible for the Battalions Physical and Personnel Security Readiness. Conducted all physical security inspections, maintained and updated security access control rosters within the Battalion.", "location": "Fort Drum, NY", "title": "Senior Fires and Effects Coordinator/ Manager", "startedOn": {"month": 7, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 245674121, "new": false, "current": false, "endedOn": {"month": 3, "year": 2005}, "companyName": "US Army, 1-40th Field Artillery", "description": "o Directed and trained a platoon of 60 newly recruited field artillery Soldiers in basic combat skills and forward observer individual training. \no Managed, counseled, inspected, and evaluated Soldiers during the five phases of initial entry training. Accountable for the welfare and morale of all subordinate Soldiers. \no Recommended Soldiers for retention or dismissal from training and/or the Army.   Planned, coordinated, and executed all Unit Graduations.\no Developed written guidance/special instructions for the protection and accountability of the unit Arms, Ammunition & Explosives (AA&E)/Sensitive Items (SI) Standard Operating Procedures (SOP), which was outdated and obsolete.    \no Appointed as the AA&E Key and Lock Control Custodian; Established and maintained a key control program for the unit; model program was then taught to and adopted by all Batteries.  \no Unit Physical Security Officer (PSO); conducting monthly assessments/inspections of the unit AA&E storage facility, enforcing the Armyâ\u0080\u0099s Physical Security Program.         \no Instrumental in resource and executing an aggressive Physical Security training program for primary and alternate key control custodians and unit armorers who are responsible for the accountability and protection of AA&E, keys and locks.        \no Played a key role as the PSO during an Installation Physical Security inspection resulting in high remarks for establishing the units Physical Security and Key Control program with zero deficiencies.", "location": "Fort Sill, OK", "title": "Senior Drill Sergeant /Armorer/Manager", "startedOn": {"month": 11, "year": 2002}, "companyUrn": "urn:li:fs_salesCompany:1223"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "John", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/john-bustamante-52b54844", "location": "Washington D.C. Metro Area"}