{"objectUrn": "urn:li:member:57037913", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2000}, "fieldsOfStudy": ["Human Resources Management"], "school": "urn:li:fs_salesSchool:20313", "degree": "Masters", "schoolName": "Naval Postgraduate School", "startedOn": {"year": 1998}, "eduId": 39688200}, {"endedOn": {"year": 1993}, "fieldsOfStudy": ["Information Systems"], "school": "urn:li:fs_salesSchool:18200", "degree": "Masters", "schoolName": "Hawaii Pacific University", "startedOn": {"year": 1991}, "eduId": 39688196}, {"endedOn": {"year": 1988}, "fieldsOfStudy": ["Liberal Studies"], "school": "urn:li:fs_salesSchool:18953", "degree": "Bachelor's", "schoolName": "Excelsior College", "startedOn": {"year": 1986}, "eduId": 39688262}, {"endedOn": {"year": 1982}, "fieldsOfStudy": ["General Studies"], "degree": "Bachelor's", "schoolName": "Philippine Military Academy", "startedOn": {"year": 1978}, "eduId": 39688287}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAANmVFkBWjtJFK1Y5gUsCGgvJmTAPbcWs10,NAME_SEARCH,undefined)", "numOfConnections": 111, "showTotalConnectionsPage": false, "headline": "Management and Program Analyst at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Current Federal Government employee and former U.S. Navy Officer.\n\nSpecialties: Process development and improvement, professional studies and research, education and training, human resources, higher-level management and administration, consensus-building.", "pendingInvitation": false, "defaultPosition": {"posId": 93574608, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Assigned to the Data Quality Section (DQS), Data Management Unit, Homeland Security Investigations. Responsible for ensuring the accuracy of data in the Treasury Enforcement Communications System (TECS) database.  Sends messages to field offices for correction of erroneous database entries.  Assigns routine tasks to co-workers.  Responsible for training of new employees.  Program Manager for the Executive Data Information System (EDIS).  Acts as Section Chief or Unit Chief, during temporary absences of the incumbents.\nAccomplishments:\n- Assisted in the development of a Case Presentation process, in connection with the TECS modernization program.\n- Participated in the development of an Information Sharing training presentation, for use by field offices nationwide, and by ICE Attache offices overseas.  \n- Developed a procedure for correcting a common error in over 18,000 TECS records, for use by field offices.  \n- Assisted in developing a training guide for field offices, to avoid common TECS data entry errors.\n- Conducted an inventory of over 100 TECS help screens, for the purpose of developing a standard user guide.", "title": "Management and Program Analyst", "startedOn": {"month": 5, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 93574608, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Assigned to the Data Quality Section (DQS), Data Management Unit, Homeland Security Investigations. Responsible for ensuring the accuracy of data in the Treasury Enforcement Communications System (TECS) database.  Sends messages to field offices for correction of erroneous database entries.  Assigns routine tasks to co-workers.  Responsible for training of new employees.  Program Manager for the Executive Data Information System (EDIS).  Acts as Section Chief or Unit Chief, during temporary absences of the incumbents.\nAccomplishments:\n- Assisted in the development of a Case Presentation process, in connection with the TECS modernization program.\n- Participated in the development of an Information Sharing training presentation, for use by field offices nationwide, and by ICE Attache offices overseas.  \n- Developed a procedure for correcting a common error in over 18,000 TECS records, for use by field offices.  \n- Assisted in developing a training guide for field offices, to avoid common TECS data entry errors.\n- Conducted an inventory of over 100 TECS help screens, for the purpose of developing a standard user guide.", "title": "Management and Program Analyst", "startedOn": {"month": 5, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 93575347, "new": false, "current": false, "endedOn": {"month": 5, "year": 2009}, "companyName": "US Census Bureau", "description": "Assigned to the Information Systems Support and Review Office (ISSRO).  Assistant Manager for the Census Bureau's Blade Server Project, which intends to replace various existing servers to blade servers, over a five-year period.\n- Assisted in oversight and periodic review of a $3M, three-year blade server transition contract, for migrating all software applications and operating systems from various servers to an all-blade server utility computing environment.  Also developed the Satement of Work (SOW) for this contract, as well as the SOW for a contract renewal worth $3.5M.\n- Liaisons with contractor personnel to develop timetables, resolve customer/client issues, and provides alternatives to problems encountered in project management and implementation.\n- Led the development of a project website which provides general information and updates on the Blade Server Project, for an agency of 4,000 employees.  Responsible for regularly updating this website.\n- On short notice, developed a sound plan to migrate all applications from an agency Divisionâ\u0080\u0099s  present servers to 14 newly-purchased blade servers, over an eight week period.\n- Developed an allocation and tracking system for procured blade servers, in accordance with the priorities of the agencyâ\u0080\u0099s Blade Server Migration Project Management Plan.\n- Developed a SOW for a one-year, $1.7M contract for Project Management Support for the agency's Blade Server Project.\n- Developed formal processes for blade server builds, delivery, and acceptance; lab testing; and legacy server decommissioning.", "title": "Program Analyst", "startedOn": {"month": 6, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:7811"}, {"posId": 93576088, "new": false, "current": false, "endedOn": {"month": 6, "year": 2006}, "companyName": "US Navy", "description": "Assistant Department Head for Administration at the Naval Medical Information Management Center, Bethesda, MD.\n- Performs duties related to general management and administration of a headquarters-level Navy organization.\n- Responsible for major oversight of the following program areas: Human Resources (military, civil service, and contractor), Budget, Supply, Personnel and Physical Security, Occupational Safety and Health (OSH), Facilities Management, and Internal Audit.  Provided oversight on some contracts.", "title": "Commissioned Officer", "startedOn": {"month": 6, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 93576875, "new": false, "current": false, "endedOn": {"month": 6, "year": 2004}, "companyName": "US Navy", "description": "Assigned to the Bureau of Medicine and Surgery, a Navy headquarters-level organization which has oversight of all Navy health care programs and facilities worldwide.\n- Ensured that all three Naval Medical Centers, 22 Naval Hospitals, 15 Dental Centers, 6 Medical Clinics, and various other Navy medical training and support facilities were adequately staffed with military, civil service, and contract personnel (with the appropriate skill sets) in accordance with Navy staffing priorities, to provide quality health care to 3.3 million beneficiaries worldwide.\n- Assisted in developing a system-wide resource sharing policy between the Department of the Navy (DON) and the Department of Veterans Affairs (VA).  This policy is expected to streamline health care delivery, reduce costs, and optimize the use of manpower assets at co-located Navy and VA hospitals.  This policy resulted in human resources sharing plan between a Naval Hospital and a Veterans Administration Hospital.  Estimated cost savings to the Navy was $160,000.  Human resources cost avoidance to the Navy was estimated at $636,000.\n- Coordinated movement of over 200 active duty and reservist medical personnel from worldwide locations from 2001 to 2003, to support and augment critical training programs at three locations, while saving the Navy thousands of dollars in travel costs through stringent fiscal monitoring and controls.\n- Developed a decision tool for converting civil service dental provider positions to contract positions, based on cost data.  This decision tool was used to address the shortage of dental providers at Navy Dental Clinics located in high-cost areas.\n- Assisted in developing a transition and implementation plan for approved future Navy health care contracts, which ensured continuity of high-quality health care for 3.3 million beneficiaries during the transition period.", "title": "Commissioned Officer", "startedOn": {"month": 7, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:1335"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/luisito-maligat-07512817", "location": "Washington D.C. Metro Area"}