{"lastName": "Cady", "objectUrn": "urn:li:member:143730476", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2014}, "fieldsOfStudy": ["International Management"], "school": "urn:li:fs_salesSchool:18058", "degree": "Master of Public Administration (M.P.A.)", "schoolName": "American University", "startedOn": {"year": 2012}, "eduId": 122791537}, {"endedOn": {"year": 2009}, "fieldsOfStudy": ["Political Science"], "school": "urn:li:fs_salesSchool:17783", "degree": "B.A", "schoolName": "University of Arizona", "startedOn": {"year": 2005}, "eduId": 83675140}, {"endedOn": {"year": 2007}, "fieldsOfStudy": ["Spanish Language and Literature"], "degree": "Bachelorâ\u0080\u0099s Degree", "schoolName": "University of Vina del Mar", "startedOn": {"year": 2007}, "eduId": 96131190}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAiRJywBsnBN4rDC_NCb5cTZyVcICSH0pe4,NAME_SEARCH,undefined)", "numOfConnections": 308, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEIqM679xqzuA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=k3nZpYE_bW61VmLWRxmdvT-q9_DXzL3NiUA1rdIBJTU", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEIqM679xqzuA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=LBZMAy7myoQs3Heot3f1JI92AHPUbZQAAGntZVoDBPU", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEIqM679xqzuA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=2QKm4PAfHjUjXSDNlNJ0R8xXfrSWpYTXALtIaUkarfc", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEIqM679xqzuA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=U6tIE5aA6xVoQLWRv0kaBoju88ta89pI_3I8EA3mShI", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Senior Policy Advisor at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Dedicated professional with Top Secret security clearance and over eight years experience in project design, management, data analysis, and writing grants. Experienced leader in project management that has worked with diverse stakeholders and management teams to effectively strategize, assess, and conduct effective programming in domestic and international settings.\n\nFormer Peace Corps health volunteer who served in Peru from 2009-2011. Seasoned worker in cross-cultural environments that is looking to transition back into the international development / international affairs realm.\n\nAwarded in October 2016 Recognition of Exceptional Service for outstanding contributions and exemplary service to the Family Case Management Program and for enhancing the mission of the Office of Enforcement and Removal Operations by the Custody Programs Division Deputy Assistant Director.", "pendingInvitation": false, "defaultPosition": {"posId": 1296456976, "new": true, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Senior Policy Advisor at U.S. Immigration and Customs Enforcement (ICE) overseeing Civil Liberties and Civil Rights and the Legal Access portfolios. ", "location": "Washington D.C. Metro Area", "title": "Senior Policy Advisor", "startedOn": {"month": 4, "year": 2018}}, "degree": 3, "fullName": "Christopher Cady", "positions": [{"posId": 1296456976, "new": true, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Senior Policy Advisor at U.S. Immigration and Customs Enforcement (ICE) overseeing Civil Liberties and Civil Rights and the Legal Access portfolios. ", "location": "Washington D.C. Metro Area", "title": "Senior Policy Advisor", "startedOn": {"month": 4, "year": 2018}}, {"posId": 1110060320, "new": false, "current": false, "endedOn": {"month": 4, "year": 2018}, "companyName": "FEMA", "description": "â\u0080¢ Provided assessments, analysis, and recommendations to senior leadership on the impact of new or proposed legislation, executive orders, agency directives, and other agency decisions on organizational operations, managerial programs and requirements.\nâ\u0080¢ Planned and conducted the Office of Response and Recovery analysis of the federal employee viewpoint survey and provided recommendations to the Deputy Assistant Administrator on improving employee morale, developing better performance metrics, and enhancing supervisory training opportunities.\nâ\u0080¢ Drafted, reviewed, and edited standard operating procedures, memorandums, congressional letters, briefing materials, fact sheets, and strategic documents for the Office of Response and Recovery\nâ\u0080¢ Tracked, analyzed, and delegated taskers for all FEMA response and recovery efforts to Hurricaneâ\u0080\u0099s Harvey, Irma, and Maria.\n\n", "location": "Washington D.C. Metro Area", "title": "Program Analyst", "startedOn": {"month": 10, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:2995"}, {"posId": 1110061060, "new": false, "current": false, "endedOn": {"month": 10, "year": 2017}, "companyName": "FEMA", "description": "â\u0080¢ Provided assessments, analysis and recommendations on new and proposed policy initiatives, executive orders, DHS priorities, programs and operations at the national level\nâ\u0080¢ Developed program policies, procedures, information bulletins and the notice of funding opportunity for Port and Transit Security grant programs\nâ\u0080¢ Managed, coordinated, and developed project plan for FEMA's Fiscal Year 2017 preparedness grants rollout which encompasses eight homeland security programs\nâ\u0080¢ Spearheaded the Grant Programs Directorate's analysis of the fiscal impact of Executive Order, Enhancing Public Safety in the Interior of the United States, on FEMA homeland security grant programs", "location": "Washington D.C. Metro Area", "title": "Program Analyst", "startedOn": {"month": 2, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:2995"}, {"posId": 792527941, "new": false, "current": false, "endedOn": {"month": 2, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢ Drafted, reviewed, and edited strategic documents, standard operating procedures, memorandums, concept notes, briefing materials, and reports for Custody Programs Division\nâ\u0080¢ Identified, monitored, and developed strategies that mitigate or capitalize on program and project-level risks and opportunities for senior management\nâ\u0080¢ Engaged in Spanish and English, internal and external stakeholders to provide repatriation assistance to returned families as a means to promote compliance\nâ\u0080¢ Developed monitoring and evaluation toolkit for alternative to detention program, Family Case Management, which analyzed the efficiency and effectiveness of program deliverables\nâ\u0080¢ Composed quantitative and qualitative analytical report on Family Case Management Program which compared year one results to other alternative to detention programs\nâ\u0080¢ Produced Departure Planning Webinar for 30 GEO Care case managers and management staff that detailed the removal and repatriation process", "title": "Policy and Management Analyst", "startedOn": {"month": 4, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 636312738, "new": false, "current": false, "endedOn": {"month": 4, "year": 2016}, "companyName": "FEMA", "description": "â\u0080¢ Develop briefing material and talking points for senior leadership on Homeland Security budgetary, programmatic, and policy decisions\nâ\u0080¢ Compose policy memorandums to grantees elucidating Grants Program Directorate policies\nâ\u0080¢ Manage the extension review process, draft panel review recommendations, and brief the Assistant Administrator weekly on homeland security grant extension packages\nâ\u0080¢ Analyze grant closeout data and send weekly progress reports to the office director\nâ\u0080¢ Implement monitoring and evaluation tools for active homeland security grant awards\nâ\u0080¢ Design measurement tools to track project based applications for homeland security grants\n", "title": "Program Analyst", "startedOn": {"month": 2, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:2995"}, {"posId": 760033065, "new": false, "current": false, "endedOn": {"month": 12, "year": 2015}, "companyName": "FEMA", "description": "\nâ\u0080¢ Conducted site visits on state and local facilities damaged by flooding\nâ\u0080¢ Prepared project worksheets detailing the scope of work, estimated cost, and special considerations associated with the Applicantâ\u0080\u0099s submitted documentation \nâ\u0080¢ Identified cost eligibility concerns and drafted determination memos for the Public Assistance Crew Leader on issues flagged during the site visit\n", "title": "Public Assistance Project Specialist", "startedOn": {"month": 10, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:2995"}, {"posId": 418567807, "new": false, "current": false, "endedOn": {"month": 2, "year": 2015}, "companyName": "FEMA", "description": "â\u0080¢ Responsible for overseeing and closing out Homeland Security grant (HSGP) packages in 25 states and territories\nâ\u0080¢ Reaching out to grantees to provide programmatic information and answer grantee inquiries\nâ\u0080¢ Reviewing, Editing, and Assembling border security grant packages through the Operation Stonegarden program\nâ\u0080¢ Creating and maintaining excel spreadsheets to track grant award information, release of funds packages, and grant extensions.", "title": "Program Support Specialist", "startedOn": {"month": 7, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2995"}, {"posId": 392912946, "new": false, "current": false, "endedOn": {"month": 6, "year": 2013}, "companyName": "U.S. Department of State", "description": "â\u0080¢ Composed, edited, and organized paperwork in SharePoint for the Strategic Planning office, which encompassed four distinct divisions\nâ\u0080¢ Compiled weekly Division Chief Reports and briefed the office director on ongoing actions within the office\nâ\u0080¢ Analyzed the effectiveness of Bureau programs and assisted in the development of a training program for E-Diplomacy that promoted social media applications overseas\nâ\u0080¢ Collaborated with the office director on a Prezi presentation on Mobile Computing for 40 top industry executives and created a Prezi for IRMâ\u0080\u0099s eDiplomacy office to motivate U.S. embassies to use social media to advance diplomacy\nâ\u0080¢ Served as HR proxy for the office director", "title": "IRM Strategic Planning Office - Pathways Program", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:3100"}, {"posId": 310804013, "new": false, "current": false, "endedOn": {"month": 12, "year": 2012}, "companyName": "U.S. Department of State", "description": "â\u0080¢ Managed a 10 office bureau; drafted, edited, and organized paper work\nâ\u0080¢ Established and maintained contacts with interagency representatives to compose talking points, briefing checklists, and press statements for U.S. diplomats\nâ\u0080¢ Collected and analyzed incoming correspondence and cables and forwarded them to pertinent offices for appropriate action\nâ\u0080¢ Prepared the daily activity report for the Assistant Secretary and advised the Senior Coordinator for Western Hemisphere Affairs on sustainable development and citizen security issues in Latin America", "title": "Western Hemisphere Affairs Front Office Intern", "startedOn": {"month": 8, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:3100"}, {"posId": 250307189, "new": false, "current": false, "endedOn": {"month": 10, "year": 2011}, "companyName": "Peace Corps", "description": "â\u0080¢ Developed, validated, and conducted community surveys that identified prevalent health issues in the district\nâ\u0080¢ Spearheaded project management teams that analyzed and solved complex technical problems, such as the high prevalence of water born diseases and malnutrition\nâ\u0080¢ Conducted Leadership Activities for Adolescent Women (ALMA) to 68 students that covered leadership, self-esteem, gender-based violence, sexuality, adolescent pregnancy, life planning, sexual transmitted disease prevention, and drug and alcohol abuse\nâ\u0080¢ Designed, managed, and evaluated a college preparatory class for 25 high school students that focused on management and technical literacy classes contributing to a 45 percent in college admission rates in the school district\nâ\u0080¢ Adapted analytical techniques and evaluation criteria for a kitchen stove project in order to enhance qualitative and quantitative measurements\nâ\u0080¢ Monitored and evaluated projects and sent narrative reports to in-country staff", "title": "Community  Health  Specialist", "startedOn": {"month": 9, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:3441"}, {"posId": 250307200, "new": false, "current": false, "endedOn": {"month": 5, "year": 2009}, "companyName": "Arizona  Attorney  General's  Office", "description": "Â· Observed  mediations  between  conflicting  parties  and  advised  the  mediator  \n               of  possible  resolutions  \n         Â· Organized  case  information  into  the  main  civil  rights  computer  and  filed  all  \n               cases  chronologically  \n         Â· Answered  phones  and  coordinated  with  my  supervisor  in  order  to  improve  \n               organization  within  the  Civil  Rights  Division", "title": "Civil  Rights  and  Mediation  Division  Intern", "startedOn": {"month": 9, "year": 2008}}], "pictureInfo": {}, "savedLead": false, "firstName": "Christopher", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/christopher-cady-43817540", "location": "Washington, District Of Columbia"}