{"lastName": "Hoffmeister", "objectUrn": "urn:li:member:403148327", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2004}, "fieldsOfStudy": ["International Security Studies"], "school": "urn:li:fs_salesSchool:18062", "degree": "Master's Degree", "schoolName": "Georgetown University", "startedOn": {"year": 2002}, "eduId": 265289141}, {"endedOn": {"year": 1999}, "fieldsOfStudy": ["English Language and Literature"], "school": "urn:li:fs_salesSchool:19382", "degree": "Bachelor's Degree", "schoolName": "University of South Carolina-Columbia", "startedOn": {"year": 1995}, "eduId": 265288238}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABgHjicBjNwXfN0OzvRGSHaxyF3mOflhjos,NAME_SEARCH,undefined)", "numOfConnections": 175, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGq1wCPicbYkA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=voI0eM_0zHOXzxRYmyUwt--hPnEFjNxHTh9S3zAweFc", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGq1wCPicbYkA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=ipClNuXPYQnippn86vo8TEHQhEKx5t_mvCeEPQAbZV4", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGq1wCPicbYkA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=2WP-S2A2eERViqi1mo2HVCoykKX75BO-veIH8ZU63_U", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQGq1wCPicbYkA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=bLG0pU5LZ_PBOjTwbJvyu_4DgkcalhimBbk4o74d0qQ", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Financial Crimes Specialist | Intelligence Manager", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I am an intelligence manager and financial crimes expert with over 13 years of U.S. federal law enforcement and intelligence experience. I am currently with Homeland Security Investigations in Williston, Vermont, as team lead for the intelligence group at the National Bulk Cash Smuggling Center. I direct investigative research in the areas of cross-border financial crimes and money laundering; currency smuggling risk assessment; and statistical methods related to cash courier targeting and suspicious financial transactions. \n\nI co-founded the center in 2009 and am the principal architect of the centerâ\u0080\u0099s analytic and business processes. Prior to opening the center, I worked intelligence related to counter terrorism, passenger enforcement, and cargo security at U.S. Customs and Border Protection in Washington, D.C. \n\nI have developed nationwide training programs for intelligence analysts in the Department of Homeland Security, conducted training seminars on using law enforcement databases and automated targeting systems, and developed applied research methodologies for criminal investigations. \n\nI have been credentialed through the Association of Certified Financial Crime Specialists, and have been a member of the International Association of Crime Analysts and the Massachusetts Association of Crime Analysts.\n\nI co-wrote an editorial in the New York Times on North Koreaâ\u0080\u0099s part in the international illicit drugs trade, and more recently authored an article for the National Criminal Enforcement Association's flagship magazine. I am currently at work on a collection of essays on international security and politics. \n\nI am a Returned Peace Corps Volunteer from the agencyâ\u0080\u0099s Mongolia program. \n\nI earned my M.A. in Security Studies from Georgetown University and a B.A. in English from the University of South Carolina, where I graduated magna cum laude from the South Carolina Honors College.", "pendingInvitation": false, "defaultPosition": {"posId": 637374711, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I am currently the team lead for a seven-person intelligence group at the National Bulk Cash Smuggling Center, a unit I co-founded in 2009. I provide technical direction and guidance for operational support of GPS tracking and covert surveillance programs; lead intake and development of preliminary bulk cash smuggling investigations; reporting of enforcement statistics and performance measures; and intelligence production.\n\nI oversee the entire program of analysis for the center, including all aspects of the intelligence business cycle, to include: 1) defining intelligence requirements and information needs, 2) reporting tactical information to customers within and outside of HSI, 3) designing and proofing operational and strategic finished intelligence products, and 4) planning intelligence operations in the face of constrained budgets and limited resources.\n\nI have authored several white papers to obtain non-allocated funds through the Treasury Executive Office of Asset Forfeiture Super Surplus program. These grants have been used to acquire equipment such as prepaid/stored-value card readers, and to fund several advanced analytics research programs, including a project with MITRE to apply natural language processing to unstructured text narratives.\n\nI routinely represent the center, my agency, and my department at the highest levels in collaborative work with law enforcement, intelligence, and regulatory partners, both within and outside the United States. I have worked with Europol, Interpol, the customs services of many countries with which we have Customs Mutual Assistance Agreements (CMAA), and the United Nations Office on Drugs and Crime.\n", "location": "Burlington, Vermont Area", "title": "Team Lead, Intelligence Group", "startedOn": {"month": 9, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Chris Hoffmeister", "positions": [{"posId": 637374711, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I am currently the team lead for a seven-person intelligence group at the National Bulk Cash Smuggling Center, a unit I co-founded in 2009. I provide technical direction and guidance for operational support of GPS tracking and covert surveillance programs; lead intake and development of preliminary bulk cash smuggling investigations; reporting of enforcement statistics and performance measures; and intelligence production.\n\nI oversee the entire program of analysis for the center, including all aspects of the intelligence business cycle, to include: 1) defining intelligence requirements and information needs, 2) reporting tactical information to customers within and outside of HSI, 3) designing and proofing operational and strategic finished intelligence products, and 4) planning intelligence operations in the face of constrained budgets and limited resources.\n\nI have authored several white papers to obtain non-allocated funds through the Treasury Executive Office of Asset Forfeiture Super Surplus program. These grants have been used to acquire equipment such as prepaid/stored-value card readers, and to fund several advanced analytics research programs, including a project with MITRE to apply natural language processing to unstructured text narratives.\n\nI routinely represent the center, my agency, and my department at the highest levels in collaborative work with law enforcement, intelligence, and regulatory partners, both within and outside the United States. I have worked with Europol, Interpol, the customs services of many countries with which we have Customs Mutual Assistance Agreements (CMAA), and the United Nations Office on Drugs and Crime.\n", "location": "Burlington, Vermont Area", "title": "Team Lead, Intelligence Group", "startedOn": {"month": 9, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1037104923, "new": false, "current": false, "endedOn": {"month": 9, "year": 2011}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "In 2009, I helped establish the National Bulk Cash Smuggling Center (BCSC). I was responsible for designing many of the business processes currently in place at the center, including best practices for criminal investigative analysis.\n\nIn this role, I was the initial investigator for over 150 criminal cash courier and financial crimes investigations stemming from post-case assessment, Suspicious Activity Report (SAR) review, and leads from partner agencies. These investigative leads resulted in one Organized Crime Drug Enforcement Task Force (OCDETF) investigation, several million dollars in seized currency and assets, and numerous criminal and administrative arrests. Additionally, I assisted the HSI Burlington office with several financial crimes and drug trafficking cases, which resulted in criminal convictions and asset forfeitures totaling several hundred thousand dollars.\n\nI created, wrote, and edited our weekly intelligence newsletter, and managed internal and external distribution lists for several thousand law enforcement and regulatory partners. \n\nI deployed a behavior analysis software solution to identify key members of criminal organizations through social network analysis of telecommunications records.\n\nI developed a methodology for heat map and ping/stop analyses of GPS tracking device data in support of HSI bulk cash smuggling investigations. This methodology identified the geography of bulk cash supply chains, stash house locations, and numerous potential target addresses.\n\nI generated statistical analyses and situational assessments for HSI Special Agent in Charge offices. These assessments have been used to direct outreach to local law enforcement agencies, set up multi-agency task forces and criminal interdiction units, and direct investigative resources.", "location": "Burlington, Vermont Area", "title": "Criminal Intelligence Analyst", "startedOn": {"month": 4, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1037106445, "new": false, "current": false, "endedOn": {"month": 4, "year": 2009}, "companyName": "U.S. Customs and Border Protection", "description": "In 2007, I assumed responsibility for the intelligence-driven components of cargo targeting and rules development for the CBP Automated Targeting System (ATS). In 2007/2008, I was tasked with creating a threat assessment methodology for the CBP national security and narcotics weight sets for the ATS inbound cargo module. This assessment took the form of a complex threat model at the country-level that served as the basis for all location-based cargo targeting concepts and rules.\n\nI spearheaded design strategies for advanced analytic and data management technologies. I was a member of a select group of superusers tasked with modeling data queries through direct access to the CBP enterprise data warehouse. I provided initial development requirements to contractors building the Analytic Framework for Intelligence (AFI), the principle intelligence platform in use at CBP.\n\nI collaborated frequently with foreign customs agencies and third-agency partners, such as Interpol. I routinely provided analytic and pre-deployment operational security briefings for officers and intelligence analysts stationed internationally with the Container Security Initiative.\n\nOn several occasions, I briefed the CBP Commissioner and the Executive Staff (SES-level command staff) on pressing national security issues, outlined operational impacts of threats and vulnerabilities, and recommended possible operational solutions.\n\nI was a highly productive analyst. By the end of my time with CBP, I had written 113 intelligence documents. These products included forty (40) weekly intelligence notes, a product line I created; two (2) intelligence studies; one (1) threat assessment; and seventy (70) intelligence bulletins and alerts.\n", "location": "Washington D.C. Metro Area", "title": "Lead Intelligence Analyst", "startedOn": {"month": 10, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:2997"}, {"posId": 637387089, "new": false, "current": false, "endedOn": {"month": 9, "year": 2007}, "companyName": "U.S. Customs and Border Protection", "description": "I began my career as a counter-terrorism analyst in 2004. In this role, I leveraged classified and law enforcement reporting sources to identify high-risk travelers to the U.S. I provided source-directed and organic collection requirements to Intelligence Community partners. And I produced finished intelligence products to inform primary customers in CBP. \n\nI was the CBP lead analyst for an inter-agency working group on Lebanese Hezbollah. I provided substantial input into intelligence-driven special operations and target development for customs and immigration inspections. I conducted fraudulent document detection and intelligence briefings for front-line officers at international Ports of Entry.\n\nIn 2006, I was invited by our human capital manager to assist in developing a Five-year Strategic Plan for the Office of Intelligence, given potential staffing levels and budgetary constraints.\n\nWith colleagues from the Office of Intelligence, the Office of Field Operations, the U.S. Border Patrol, and the Office of Air and Marine Operations, I co-authored the first iteration of the CBP Intelligence Support to Operations Course (CISOC) in 2007, the basic intelligence training course for all intelligence employees at CBP. I instructed several of the course modules during the pilot course.\n\nI represented my agency at national security and terrorist mobility meetings in a joint advisory capacity with CBP Office of Field Operations personnel.\n\nIn 2005, I was designated the CBP Lead Analyst for Exercise TOP OFFICIALS (TOPOFF) 3.\n", "location": "Washington D.C. Metro Area", "title": "Intelligence Analyst", "startedOn": {"month": 6, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:2997"}, {"posId": 1037105493, "new": false, "current": false, "endedOn": {"month": 7, "year": 2002}, "companyName": "Peace Corps", "description": "After two years as a Peace Corps Volunteer, I extended my service for a third year as the Volunteer Coordinator for the Peace Corps Mongolia program. In this capacity, I served as the mediator between headquarters program managers and field volunteers. I ensured health, safety, living accommodations, and workplace needs were met in the field; and that headquarters expectations were conveyed to and understood by volunteers throughout the country.\n\nIn 2002, I managed the orderly evacuation of five Peace Corps Volunteers from Choibalsan, the Dornod provincial capital, after an anthrax quarantine had prevented travel or food delivery for almost two weeks. This required close coordination with local government and military officials and open lines of communication with the U.S. Embassy and country team in Ulaanbaatar.\n\nAs the official liaison to the UN Development Program, UN Volunteers, Volunteer Services Overseas (UK), Mongolian Volunteers Association, Amnesty International and other in-country development partners, I worked on joint inter-agency development projects in education, healthcare, and environmental protection.\n\nI was the Assistant Training Coordinator and managed host family selection and placement in six communities for a Community-Based Training Module implemented in the summer of 2002. I was the Community Assessment and Development Project Management trainer for 70 Peace Corps Volunteers in the summer of 2001.\n", "location": "Ulaanbaatar, Mongolia", "title": "Volunteer Coordinator", "startedOn": {"month": 8, "year": 2001}, "companyUrn": "urn:li:fs_salesCompany:3441"}, {"posId": 637392993, "new": false, "current": false, "endedOn": {"month": 7, "year": 2001}, "companyName": "Peace Corps", "description": "For two years, I was stationed in Dashbalbar Sum, Dornod Province, a remote agricultural village in northeastern Mongolia. Principally, I developed curricula for high school and adult community English classes. \n\nAs an English teacher, I constructed a foreign language classroom, procured instructional materials, and taught English to approximately 120 secondary school students, 10 community business professionals, 10 government employees, and 15 school teachers. Nine out of ten of my students were accepted to university, largely on consideration of their English skills.\n\nI tutored middle and high school students in preparation for regional English Olympics competitions. Two of my tutored students succeeded in going to the national championships.\n\nMy secondary responsibilities entailed planning and executing family and community gardening projects, small business development plans, and satisfying other community development needs as they arose in liaison meetings between town officials, my host-country counterpart, and me.\n\nLike all Peace Corps Volunteers, I lived and worked in my community, and served as a cultural envoy and representative of the United States. In three years, I learned to speak fluently in two dialects of Mongolian, and scored an ACTFL rating of Advanced High prior to out-processing.\n", "location": "Mongolia", "title": "English Teacher | Community Development Specialist", "startedOn": {"month": 6, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:3441"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Chris", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/crhoffmeister", "location": "Williston, Vermont"}