{"objectUrn": "urn:li:member:466424335", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Military", "educations": [{"endedOn": {"year": 2021}, "fieldsOfStudy": ["Psychology"], "school": "urn:li:fs_salesSchool:19704", "schoolName": "American Public University System", "startedOn": {"year": 2013}, "eduId": 318224239}, {"endedOn": {"year": 2013}, "fieldsOfStudy": ["General Studies"], "school": "urn:li:fs_salesSchool:32243", "degree": "Associate of Arts (A.A.)", "schoolName": "Barton County Community College", "startedOn": {"year": 2011}, "eduId": 322669358}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABvNEg8BgIzbvfk8gySk4Z4Eye5CmQzB7_Y,NAME_SEARCH,undefined)", "numOfConnections": 53, "showTotalConnectionsPage": false, "headline": "Retired U.S. Army Supervisor with extensive experience in mobility/countermobility, survivability, & medical aid.", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Emergency Medical Technician and Military Veteran with a Secret Security Clearance and over 10 years of proven experience in the United States Army and private healthcare sector.  Accomplished measurable results while leading teams of 40 in dynamic, fast - paced environments.  Possess a comprehensive background in Emergency Response Care, Patient Assessment and Customer Service derived from conducting domestic and global operations in Iraq and Afghanistan. Managed risk upon multiple lines to protect assets, property, and equipment valued over $1M while meeting the expectations of senior leadership.  Possesses extensive knowledge in Patient Counseling, Tactical Field Care and Triage.  Recipient of multiple awards for outstanding performance and professionalism.  Career supported by Associate of Arts in General Studies, Emergency Medical Technician-Basic and Life Support Provider certifications. Areas of expertise include but are not limited to: Patient Counseling, Leadership, Data Entry/Analysis, Medical Administration, Training & Development, Medical Evacuations, Trauma/Critical Care/Triage Management, Organization/Communication, Records Management, Skill Levels 1 and 2 basic Combat Engineer tasks, Small Unmanned Aerial Vehicle (SUAV) Raven Master Trainer and Operator and Organizational Defense Travel Administrator (ODTA).", "pendingInvitation": false, "defaultPosition": {"posId": 859525382, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provided clerical and administrative support to the Enforcement and Removal Operations Program. Established and reviewed case records of aliens who are detained by the agency; process and review officers notes; review program documents for completion and accuracy. Prepare and forwarded records to appropriate offices for removal and exclusion hearings; reviewed and analyzed case files to determine appropriate action. Served as a liaison with international government officials to request and obtain foreign travel documents to effect the removal of final order aliens upon final order removal authorization from an Immigration Judge. \nâ\u0080¢\tResearch detainee history using multiple sources to establish identity/citizenship and assist in managing detained and non-detained dockets.\nâ\u0080¢\tEnsured new encounters were assigned the proper case category, and that appropriate database were updated as needed.\nâ\u0080¢\tEnsured that the required case actions and decisions were updated, consistent with the final decisions made in individual removal cases. \nâ\u0080¢\tPerformed a variety of clerical duties associated with arranging the physical removal of aliens which included the preparation and delivery of documents such as bond release paperwork, making travel arrangements, and determining appropriate payment of expenses. \nâ\u0080¢\tAccess to multiple criminal and agency database systems such as: National Crime Information Center (NCIC), National File Tracking System (NFTS), Enforce Alien Removal Module (EARM), Enforce Alien Detention Module (EADM), Central Index System (CIS) and Electronic Travel Documents system (eTD) to obtain requisite information, run criminal history and background checks, input alien information and to monitor the progress of assigned cases from start to finish.\nâ\u0080¢\tFamiliar with the Privacy Act of 1974 and how it relates to the release of personally identifiable information (PII).", "location": "Centennial, CO", "title": "Enforcement and Removal Assistant", "startedOn": {"month": 9, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 859525382, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provided clerical and administrative support to the Enforcement and Removal Operations Program. Established and reviewed case records of aliens who are detained by the agency; process and review officers notes; review program documents for completion and accuracy. Prepare and forwarded records to appropriate offices for removal and exclusion hearings; reviewed and analyzed case files to determine appropriate action. Served as a liaison with international government officials to request and obtain foreign travel documents to effect the removal of final order aliens upon final order removal authorization from an Immigration Judge. \nâ\u0080¢\tResearch detainee history using multiple sources to establish identity/citizenship and assist in managing detained and non-detained dockets.\nâ\u0080¢\tEnsured new encounters were assigned the proper case category, and that appropriate database were updated as needed.\nâ\u0080¢\tEnsured that the required case actions and decisions were updated, consistent with the final decisions made in individual removal cases. \nâ\u0080¢\tPerformed a variety of clerical duties associated with arranging the physical removal of aliens which included the preparation and delivery of documents such as bond release paperwork, making travel arrangements, and determining appropriate payment of expenses. \nâ\u0080¢\tAccess to multiple criminal and agency database systems such as: National Crime Information Center (NCIC), National File Tracking System (NFTS), Enforce Alien Removal Module (EARM), Enforce Alien Detention Module (EADM), Central Index System (CIS) and Electronic Travel Documents system (eTD) to obtain requisite information, run criminal history and background checks, input alien information and to monitor the progress of assigned cases from start to finish.\nâ\u0080¢\tFamiliar with the Privacy Act of 1974 and how it relates to the release of personally identifiable information (PII).", "location": "Centennial, CO", "title": "Enforcement and Removal Assistant", "startedOn": {"month": 9, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 829016884, "new": false, "current": false, "endedOn": {"month": 9, "year": 2016}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provided clerical and administrative support to the Enforcement and Removal Program (ERO). Reviewed case records of aliens who are detained by the agency to determine the proper actions for their removal. Processed and reviewed officers notes and reviewed program documents for completion and accuracy. Prepared and forwarded records to appropriate offices for removal and exclusion hearing; reviewed and analyzed case files to determine appropriate action. \nâ\u0080¢\tAccess to multiple database systems such as NFTS, EARM, EADM, and CIS, among others to retrieve and input information.\nâ\u0080¢\tPerformed a variety of technical and clerical duties associated with the arrangement of physical removal of aliens including the preparation and delivery of documents such as bond release paperwork, making travel arrangements, and located files for Deportation Officers.\nâ\u0080¢\tScreened calls and visitors to provide them with basic program information; maintain and review deportation docket files and systems.\nâ\u0080¢\tUsed office automation tools to create spreadsheets, reports, and other documents from databases.", "location": "Florence, Colorado", "title": "Enforcement and Removal Assistant Intern", "startedOn": {"month": 2, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 886447600, "current": false, "endedOn": {"year": 2016}, "companyName": "US Army", "title": "Staff Sergeant Retired", "startedOn": {"year": 2006}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 756426121, "new": false, "current": false, "endedOn": {"month": 12, "year": 2015}, "companyName": "American Red Cross", "description": "Volunteer American Red Cross First Aid/CPR/AED Instructor and Provider. American Heart Association Basic Life Support Provider. American Red Cross Psychological First Aid Certified. ", "title": "Volunteer First Aid/CPR/AED Instructor", "startedOn": {"month": 6, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:157239"}, {"posId": 844342921, "new": false, "current": false, "endedOn": {"month": 5, "year": 2015}, "companyName": "US Army", "description": "Managed, ensured, and maintained accountability of 40+ soldiers and their individual personnel files including 15 junior and senior level managers, as they progressed through the Integrated Disability Evaluation System (IDES) and transitioned to new career opportunities. Possess a high level of interpersonal skills to handle sensitive and confidential information/situations and documentation. Prepared organizational accountability charts, wrote official correspondence memorandums, and maintained records and reports of lower and senior level soldiers. \nâ\u0080¢\tSupervised training and professional development for lower level soldiers; mentored personnel through one-on-one counseling, group sessions, and liaison work with other departments\nâ\u0080¢\tReceived professional recognition for developing soldier-tracking database using MS Excel, which improved reporting functions and tracked soldier demographics, records, appointments, and status progression as they progressed through the IDES. \nâ\u0080¢\tOversaw the successful transition of 45 soldiers as they prepared for transition out of the military and into the civilian workforce.\nâ\u0080¢\tBriefed local and executive leadership on all administrative matters concerning the soldiers undergoing IDES on a daily, weekly, and monthly basis.\nâ\u0080¢\tExperienced using standard office equipment such as computers, phones, and photocopiers and experience using a variety of computer software applications including MS Excel, MS Word, and MS Power Point. \nâ\u0080¢\tOrganized, maintained, and reviewed 45+ personnel records of varying types including medical records, monthly progress reports, and job assignments for accuracy and completeness. \nâ\u0080¢\tEntered and retrieved personal information using multiple automated information systems to aid higher supervisors with accountability.", "location": "Colorado Springs, Colorado", "title": "12B Combat Engineer, Rear Detachment Medical Platoon Sergeant", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 756424709, "new": false, "current": false, "endedOn": {"month": 5, "year": 2006}, "companyName": "Wheaton Volunteer Rescue Squad, Inc.", "description": "Emergency Medical Technicians-Basic (EMT-B) who responded to emergency calls, provided efficient and immediate care to the critically ill and injured, and transported patients to medical facilities in a timely and safe manner. Possesses a basic understanding of stress response, stress management and methods to ensure personal well-being; knowledgeable of body substance isolation (BSI) techniques and understands basic medical-legal principles. \nâ\u0080¢\tFunctions within the scope of care as defined by state, regional and local regulatory agencies; complies with regulations on the handling of the deceased, notifies authorities and arranges for protection of property and evidence at the scene.\nâ\u0080¢\tAssesses scene safety at auto accidents to determine the mechanism of injury or nature of illness; conducts triage of injured patients to determine treatment priority; renders emergency and or trauma care to adults, children and infants based on assessment findings. Duties include: \nâ\u0080¢\tResponds to airway obstructions, breathing emergencies and respiratory arrest emergencies, which may require opening patients' airways using the head-tilt maneuver and jaw-thrust maneuver, and securing a patients' airway using oropharyngeal and nasopharyngeal airways (mechanical breathing aids). \nâ\u0080¢\tPerforms pulmonary resuscitation (rescue breathing) if breathing fails to start spontaneously upon the opening of the airway, using such techniques as mouth-to-mouth, mouth-to-nose and Bag-Valve-Mask (BVM) ventilation techniques. \nâ\u0080¢\tResponds to cardiac arrest emergencies and if needed, performs cardiopulmonary resuscitation (CPR) and defibrillation to patients using an automated external defibrillator (AED) as necessary. \nâ\u0080¢\tAccurately determines blood pressure readings to be used in conjunction with a variety of symptoms to identify the nature of the shock. Treats patients appropriately according to state and local protocols.", "location": "2400 Arcola Ave, Silver Spring, MD 20902", "title": "Emergency Medical Technician", "startedOn": {"month": 1, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:695036"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/christopher-burrow-5a7255110", "location": "Colorado Springs, Colorado"}