{"lastName": "Foster", "objectUrn": "urn:li:member:68075601", "contactInfo": {"websites": [{"category": "COMPANY", "dataSource": "LINKEDIN", "url": "http://Klauerlaw.com"}]}, "crmStatus": {"imported": false}, "industry": "Law Practice", "educations": [{"endedOn": {"year": 2010}, "fieldsOfStudy": ["Law"], "school": "urn:li:fs_salesSchool:18345", "degree": "J.D., May 2010", "schoolName": "Indiana University Robert H. McKinney School of Law", "startedOn": {"year": 2007}, "eduId": 45692788}, {"endedOn": {"year": 2003}, "fieldsOfStudy": ["Exercise Physiology"], "school": "urn:li:fs_salesSchool:18120", "degree": "B.S.", "schoolName": "University of Florida", "startedOn": {"year": 1999}, "eduId": 45692823}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAQOwFEBcaz34MPAtEnSzRSp8t4kNKEomPs,NAME_SEARCH,undefined)", "numOfConnections": 34, "showTotalConnectionsPage": false, "headline": "Attorney", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Specialties: Languages:Spanish, German, and Italian", "pendingInvitation": false, "defaultPosition": {"posId": 832310929, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Greater Los Angeles Area", "title": "Assistant Chief Counsel / Trial Attorney", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Kelly A. Foster", "positions": [{"posId": 832310929, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Greater Los Angeles Area", "title": "Assistant Chief Counsel / Trial Attorney", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 703152665, "new": false, "current": false, "endedOn": {"month": 6, "year": 2016}, "companyName": "Arizona Attorney General's Office", "description": "-First Chair at trial in cases related to abuse and neglect of minors including physical and sexual abuse by parents, parental substance abuse, mental illness and abandonment.\n-Conducted all aspects of severance and dependency actions including, preliminary hearings, oral arguments, evidentiary hearings, motion practice, mediations and trial.\n-Preparation of lay and expert witnesses including physicians, police officers, witnesses, social service providers and child protection workers.", "title": "Assistant Attorney General/Trial Attorney", "startedOn": {"month": 1, "year": 2015}}, {"posId": 703153269, "new": false, "current": false, "endedOn": {"month": 12, "year": 2014}, "companyName": "Slaton & Sannes", "description": "-State and federal court litigation in the following areas: Commercial, Contracts, Construction, and Real Estate.\n-Conducted all aspects of litigation from intake through trial/settlement negotiations.\n-First or second chair at trials, hearings and arbitrations.\n-Represented clients in arbitrations, mediations and settlement negotiations.\n-Drafted and responded to discovery, strategized for trial and hearings with senior attorneys, drafted and prepared responses to dispositive motions.\n-Advised corporate clients on business decisions affecting their organizations including mergers, acquisitions, and licensing issues.\n-Drafting and review of transactional documents including general business contracts, deeds of trust,\npromissory notes/loan agreements, general contractor (construction) and subcontractor agreements.\n-Appellate brief writing.\n", "title": "Associate Attorney", "startedOn": {"month": 7, "year": 2014}}, {"posId": 179141090, "new": false, "current": false, "endedOn": {"month": 6, "year": 2014}, "companyName": "Law Office of Richard L. Klauer", "description": "-Practice Areas: Employment (Employer and Employee Representation), Business Transactions, Contracts, Real Estate, and Wills & Trusts.\n-Litigation of state and federal cases in the above-mentioned areas.\n-Advised corporate clients on federal employment regulations including FMLA, FLSA and state-specific regulations, employee versus independent contractor decisions and consequences, formation of company-wide employment procedures, etc.\n-Negotiation and drafting of contracts and business agreements including non-disclosures, non-compete, licensing, acquisitions, mergers, addendums, modifications, letters of interests, letters of intent, settlement agreements, etc.\n- Advised clients on rights and obligations under current contracts and agreements, recommendations for best practices under existing contracts and agreements.\n- Drafting and negotiating of real estate agreements including deeds, deeds of trust, mortgages, promissory notes, commercial lease, land use agreements, etc.\n-Representation of nursing and healthcare facilities and their employees in business disputes such as mergers, acquisitions, and breach of contract.\n-Representation of clients in licensing issues such as Registrar of Contractors, Board of Nursing, Board of Accountancy.\n- Development and implementation of discovery, settlement efforts, and trial strategies.\n- First or second chair at trial, including jury trials.\n- Representation of clients in arbitration, mediation and settlement negotiations.\n- Supervision of staff including paralegals and law clerks.", "title": "Associate Attorney", "startedOn": {"month": 12, "year": 2010}}, {"posId": 111010999, "new": false, "current": false, "endedOn": {"month": 5, "year": 2010}, "companyName": "Ladendorf & Ladendorf", "description": "- Second Chair at medical malpractice trials representing Plaintiffs.\n- Led background investigations of physicians and other health care providers through use of court records, medical licensing records, database and other electronic research to show prior malpractice, crimes and/or fraudulent behavior.\n- Compiled background information into reports to be used in deposition and at trial.\n- Assisted with appellate work in Indiana Supreme Court decision McCabe v Indiana Patientâ\u0080\u0099s Compensation Fund where the court held that attorneyâ\u0080\u0099s fees are recoverable for a Plaintiff who brings a medical malpractice action under the Indiana Adult Wrongful Death Statute. \n- Drafted motions, memos, discovery, complaints and responses.\n- Medicare Statute Interpretation.\n- Medicare, Medicaid and Tri-Care subrogation.\n- Spanish translation.", "title": "Certified Legal Intern", "startedOn": {"month": 3, "year": 2009}}, {"posId": 111011871, "new": false, "current": false, "endedOn": {"month": 3, "year": 2009}, "companyName": "Indiana Legal Services", "description": "-Conducted interviews of Spanish-speaking clients seeking help with issues such as divorce, custody, domestic violence, assault and battery and immigration.", "title": "Law Clerk", "startedOn": {"month": 1, "year": 2009}}, {"posId": 111011378, "new": false, "current": false, "endedOn": {"month": 8, "year": 2008}, "companyName": "Indiana Legal Services-Migrant Farmworker Law Center", "description": "- Performed outreach to migrant farmworkers across Indiana.\n- Drafted client communications (English and Spanish), complaints and demands.\n- Participated in investigations of employment, labor, safety and housing code violations.\n- Recorded and gathered evidence for trial through in person interviews, photographs, and video.\n- Researched relevant case law related to Fair Labor Standards Act, and Seasonal Agricultural Protection Act\n\n.", "title": "Intern/Law Clerk", "startedOn": {"month": 5, "year": 2008}}, {"posId": 139844207, "new": false, "current": false, "endedOn": {"month": 8, "year": 2007}, "companyName": "SapientNitro", "description": "-Manager of Citifinancial and CompuCredit Sports Marketing (Autoracing) Accounts, Citifinancial Retail Merchandising.\n-Analyzed Return on Investment and logistics, implementation of micro sites and email campaigns.\n-Implementation of online, point of purchase, and offline media campaigns; drafted press releases.\n-Management of national sweepstakes, participated in creation of pitches to new clients.\n-Interface directly with Sapient production department to negotiate costs and expectations for client needs.\n-Liaison/Mediator between client and agency working toward the goal of insuring both party's needs are met. \n-Provided guidance and leadership to client throughout the advertising process; from creative brief through production, editing and finished product.", "title": "Account Manager", "startedOn": {"month": 2, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:32745"}, {"posId": 139844214, "new": false, "current": false, "endedOn": {"month": 8, "year": 2005}, "companyName": "Hendrick Motorsports", "description": "-Created opportunities to extent the Hendrick brand through national sweepstakes, direct marketing and loyalty club.\n-Development of re-launch of public website, attended events to provide hospitality to clients.\n-Wrote, produced and published content for public company website and private client web portal.", "title": "Marketing Coordinator", "startedOn": {"month": 12, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:58978"}, {"posId": 139844216, "new": false, "current": false, "endedOn": {"month": 8, "year": 2002}, "companyName": "Homestead-Miami Speedway", "description": "-Authored press releases related to special events.\n-Wrote, produced and published content for IRL and NASCAR event guides.\n-Hospitality at  IRL and NASCAR events to provide hospitality to clients.", "title": "Media Relations Intern", "startedOn": {"month": 5, "year": 2002}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Kelly A.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/kelly-a-foster-72996b1a", "location": "Greater Los Angeles Area"}