{"lastName": "Jalelian", "objectUrn": "urn:li:member:53279791", "contactInfo": {"websites": [{"category": "COMPANY", "dataSource": "LINKEDIN", "url": "http://www.ice.gov/index.htm"}]}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1992}, "school": "urn:li:fs_salesSchool:18463", "degree": "Doctor of Law (J.D.)", "schoolName": "Boston University School of Law", "startedOn": {"year": 1989}, "eduId": 37473415}, {"endedOn": {"year": 1989}, "fieldsOfStudy": ["Political Science"], "school": "urn:li:fs_salesSchool:18524", "degree": "Bachelor of Arts (B.A.), Magna cum Laude", "schoolName": "Tufts University", "startedOn": {"year": 1985}, "eduId": 37473377}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAMs_C8BrR-79rMdqBHqvkJ9g4yW2-w-8I8,NAME_SEARCH,undefined)", "numOfConnections": 362, "showTotalConnectionsPage": false, "headline": "Assistant Chief Counsel at United States Department of Homeland Security, Immigration and Customs Enforcement", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Immigration enforcement. Criminal prosecution. Post-conflict area rule of law development.  Post-Soviet area rule of law.", "pendingInvitation": false, "defaultPosition": {"posId": 88089268, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "U.S. Immigration and Customs Enforcement (ICE) is the largest investigative arm of the Department of Homeland Security. The Office of Principal Legal Advisor (OPLA) provides legal advice, training and services and prosecutes immigration and customs law violators.\n\nRepresent the United States of America in Executive Office of Immigration Review (Immigration Court) at deportation and removal proceedings. \n\nProsecute individual detained and non-detained immigration removal cases including Asylum, Cancellation of Removal, Temporary Protected Status, NACARA, Voluntary Departure and Adjustment of Status applications. Prepare and argue bond.  Organize, manage and run master calendar case calls of multiple \"pre-trial\" hearings. Research and write motions and briefs before the Board of Immigration Appeals.  Review and respond to requests for motions to reopen proceedings.  Provide legal training and ethics guidance to ICE personnel.  Review Notices to Appear for legal sufficiency.  Serve as daily duty attorney as required. \n\nAs member of Denaturalization Team, provide legal advice and review cases for possible referral of unlawfully naturalized U.S. citizens to U.S. Department of Justice for civil or criminal denaturalization proceedings.  \n\nAs a member of Human Rights Team, provide legal advice on false claims by individuals who have committed acts of torture, genocide or extra-judicial killings.  \n\nContinue to advise Homeland Security Investigations Special Agents on as needed basis.", "location": "Boston, Massachusetts", "title": "Assistant Chief Counsel, Office of Principal Legal Advisor", "startedOn": {"month": 10, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Lincoln Jalelian", "positions": [{"posId": 88089268, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "U.S. Immigration and Customs Enforcement (ICE) is the largest investigative arm of the Department of Homeland Security. The Office of Principal Legal Advisor (OPLA) provides legal advice, training and services and prosecutes immigration and customs law violators.\n\nRepresent the United States of America in Executive Office of Immigration Review (Immigration Court) at deportation and removal proceedings. \n\nProsecute individual detained and non-detained immigration removal cases including Asylum, Cancellation of Removal, Temporary Protected Status, NACARA, Voluntary Departure and Adjustment of Status applications. Prepare and argue bond.  Organize, manage and run master calendar case calls of multiple \"pre-trial\" hearings. Research and write motions and briefs before the Board of Immigration Appeals.  Review and respond to requests for motions to reopen proceedings.  Provide legal training and ethics guidance to ICE personnel.  Review Notices to Appear for legal sufficiency.  Serve as daily duty attorney as required. \n\nAs member of Denaturalization Team, provide legal advice and review cases for possible referral of unlawfully naturalized U.S. citizens to U.S. Department of Justice for civil or criminal denaturalization proceedings.  \n\nAs a member of Human Rights Team, provide legal advice on false claims by individuals who have committed acts of torture, genocide or extra-judicial killings.  \n\nContinue to advise Homeland Security Investigations Special Agents on as needed basis.", "location": "Boston, Massachusetts", "title": "Assistant Chief Counsel, Office of Principal Legal Advisor", "startedOn": {"month": 10, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 525436258, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "ICE - Homeland Security Investigations", "description": "While an Assistant Chief Counsel, assigned as one of nineteen assistant chief counsels nationwide picked for a one year, full time detail as an embedded attorney/agency counsel to the Homeland Security Investigations Office of the Special Agent in Charge for New England. \n\nAdvised management, staff, and approximately 200 Homeland Security Investigations Special Agents. Provided guidance and legal opinions on criminal case preparation, ongoing investigations, border searches, confidential informants and witnesses, information disclosure, civil and criminal forfeitures, narcotics matters, counter proliferation, immigration issues, sufficiency of Title III wiretaps applications, contracts and memoranda of understanding. \n\nCoordinated, designed and provided training to Special Agents and foreign and local law enforcement on criminal and constitutional law and investigative techniques. Serve as intermediary with United States Attorneyâ\u0080\u0099s Offices in New England regarding specialized Customs matters, investigations, affidavits, reports and testimony.", "location": "Boston, Massachusetts", "title": "Agency Counsel - Embedded Attorney", "startedOn": {"month": 5, "year": 2012}}, {"posId": 87603278, "new": false, "current": false, "endedOn": {"month": 9, "year": 2009}, "companyName": "Massachusetts Attorney General's Office", "description": "Criminal Bureau, Special Projects and Appeals. \n\nLed multi-jurisdictional investigation by Massachusetts State Police and Boston Police Department of narcotics distribution by violent street gang utilizing multiple investigative techniques culminating in multiple wiretaps, grand jury indictments, and prosecutions of numerous violent gang members. \n\nResearch and wrote oppositions to federal habeas corpus petitions filed in the U.S. District Court challenging Massachusetts convictions, and appeals in the First Circuit Court of Appeals from decisions on these petitions.\n\nContinued as Special Attorney for United States Department of Justice for investigation and prosecution of international cigarette smuggling and money laundering case.", "location": "Boston, Massachusetts", "title": "Assistant Attorney General", "startedOn": {"month": 2, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:2925861"}, {"posId": 87603279, "new": false, "current": false, "endedOn": {"month": 2, "year": 2008}, "companyName": "U.S. Department of Justice, Criminal Division", "description": "Represented the United States of America in United States District Courts.\n\nInvestigated and prosecuted national and international organized crime cases.\n\nProsecuted La Cosa Nostra racketeering, public corruption, multinational narcotics, interstate transportation of stolen property, multinational cigarette smuggling, money laundering, possible human smuggling, and Albanian organized crime cases at all prosecution stages including Title III wiretaps,  search warrants, the use of informants, obtaining and reviewing tax records, grand jury practice, arraignments, bail, pretrial hearings and jury trials.\n\nTried three jury trials in United States District Courts as first chair.\n\nTwice chosen as â\u0080\u009ctaintâ\u0080\u009d attorney for review of privileged documents seized by search warrants from law offices. \n\nProvided numerous trainings to international prosecutors and judges both in the United States and abroad on United States organized crime prosecution techniques.\n\nAssigned as a Special Prosecutor, FBI Art Crime Team to advise and handle cases as assigned. Initiated forfeiture action on two 18th Century Peruvian Cuzco paintings which were eventually forfeited and returned to the Government of Peru.\n\nSole United States Department of Justice delegate on United States Department of State Diplomatic Mission to 2006 Organization of American States Inter-American Committee against Terrorism, (CICTE) Sixth Regular Session in Bogota, Colombia.\n\nDetailed to United States Department of State as Department of Justice Intermittent Legal Advisor, United States Embassy, Bishkek, Kyrgyz Republic, April - August, 2006.\n\nContributor to Department of Justice Law Enforcement Strategy to Combat International Organized Crime (IOC Strategy).\n\nCoordinated with United States Department of Treasury, Office of Foreign Asset Control, Specially Designated Nations and Blocked Persons List in designating â\u0080\u0098Ndrangheta Organization, Italy on the list.", "location": "Washington D.C., Detroit, MI, Newark, NJ, Miami, FL, Brussels, Belgium.", "title": "Trial Attorney, Organized Crime and Racketeering Section", "startedOn": {"month": 1, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:2854041"}, {"posId": 87783274, "new": false, "current": false, "endedOn": {"month": 8, "year": 2006}, "companyName": "U.S. Department of State", "description": "Detailed to United States Department of State as Department of Justice Intermittent Legal Advisor, United States Embassy, Kyrgyzstan.  \n\nSole, direct advisor to U.S. Ambassador on all legal matters and any non-legal matter as requested by the Ambassador.  Served as advisor to Deputy Chief of Mission, Heads of Embassy Sections and U.S. Agency for International Development. Member, Country Team. \n\nDeveloped technical and developmental Rule of Law assistance designed to enhance the capabilities of Kyrgyz justice sector institutions and law enforcement personnel including public prosecutors, investigative judges and National Police.  \n\nDesigned and provided training on U.S. organized crime prosecution techniques.  \n\nConducted survey and evaluation on Kyrgyz banking system related to anti-corruption mechanisms.  \n\nAdvised human resources section of U.S. Embassy on sensitive personnel issue.  \n\nProvided legal advice to Foreign Service Officers on a variety of personal and professional legal matters.", "location": "Bishkek, Kyrgyzstan", "title": "Intermittent Legal Advisor", "startedOn": {"month": 4, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:3100"}, {"posId": 1138821737, "new": false, "current": false, "endedOn": {"month": 1, "year": 2004}, "companyName": "Middlesex District Attorney", "description": "As an Assistant District Attorney, continued to handle felony Superior Court caseload before and after foreign assignment. September, 2001 through March, 2002 and May, 2003 through January, 2004. \n\nDetailed to United States Department of Justice as a Special Attorney and Resident Legal Advisor to the United States Department of State, United States Office, Pristina, Kosovo and as a Legal Trainer at The Kosovo Judicial Institute, Pristina, Kosovo, April, 2002 - April, 2003.", "location": "Cambridge, Massachusetts", "title": "Assistant District Attorney", "startedOn": {"month": 9, "year": 2001}, "companyUrn": "urn:li:fs_salesCompany:7997974"}, {"posId": 87603298, "new": false, "current": false, "endedOn": {"month": 4, "year": 2003}, "companyName": "U.S. Department of Justice", "description": "United States Department of Justice, United States Office of Overseas Prosecutorial Development Assistance and Training.  \n\nSpecial Attorney, United States Department of Justice. \n\nResident Legal Advisor to the United States Department of State, United States Office, Pristina, Kosovo. \n\nLegal Trainer at The Kosovo Judicial Institute, Pristina, Kosovo. \n\nAssisted Kosovars and United Nations Mission in Kosovo in the development of mechanisms to replace inquisitorial systems and laws during post-conflict United Nations Administration. Helped strengthen independent judiciary, and improved prosecutorial capacity to combat high-priority criminal activity.\n\nDesigned, organized, and implemented trainings for Kosovar and Serb prosecutors and judges on applicable local laws, United Nations regulations, and the European Code of Human Rights. \n\nAssessed criminal justice institutions and procedures and reviewed and commented on legislation and criminal enforcement policy in conjunction with the international community.  Provided technical assistance to prosecutors, judges, and other justice sector personnel working in the field by providing case analyses and assistance to Office of Chief Prosecutor of Municipal Court of Pristina and United Nations Mission in Kosovo. \n\nPublished \"Applicable Narcotics Laws in Kosovo\" in Kosovo Law Centre, Legal Journal, Spring, 2003.", "location": "Pristina, Kosovo", "title": "Resident Legal Advisor", "startedOn": {"month": 4, "year": 2002}, "companyUrn": "urn:li:fs_salesCompany:3564"}, {"posId": 87603309, "new": false, "current": false, "endedOn": {"month": 9, "year": 2001}, "companyName": "Bromberg and Sunstein, LLP", "description": "Handled trademark applications at United States Patent and Trademark Office. Trademark litigation.", "location": "Boston, Massachusetts", "title": "Associate", "startedOn": {"month": 1, "year": 2001}}, {"posId": 87603310, "new": false, "current": false, "endedOn": {"month": 1, "year": 2001}, "companyName": "Middlesex District Attorney", "description": "1994 District Attorney John A. Droney Award for Special Achievement and Excellence.\n\nSuperior Court - Felony Caseload/Special Investigations Unit.\n\nTried fourteen Superior Court Felony jury trials.  Represented Commonwealth in felony cases including murder, narcotics trafficking, white collar crime, and identity fraud cases from initial investigation to final disposition.\n\nAppeals and Training Bureau - Supervisor. \nResearched, wrote and argued approximately fifty-five appellate briefs before Supreme Judicial Court of Massachusetts and Massachusetts Appeals Court. Handled all post-conviction motions. Nineteen published opinions in Supreme Judicial Court of Massachusetts and Massachusetts Appeals Court.\nMember 24 hour Search Warrant Team.\nMember Open Meeting Law Team. \n\nDistrict Court - Supervisor\nTried approximately one hundred and twenty-five bench trials and more than fifty-five misdemeanor jury trials. Represented Commonwealth in all aspects of prosecution on cases including vehicular homicides.", "location": "Cambridge, Massachusetts", "title": "Assistant District Attorney", "startedOn": {"month": 12, "year": 1992}, "companyUrn": "urn:li:fs_salesCompany:7997974"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Lincoln", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/lincoln100", "location": "Boston, Massachusetts"}