{"pendingInvitation": false, "defaultPosition": {"posId": 620763038, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provided assistance to senior specialists in the collection of intelligence information to identify trends, patterns, profiles, estimates and studies. Reviewed data, researched and conducted analysis to develop and produce intelligence products. Assisted in the implementation of intelligence collection plans by carrying out specified portions or segments of specific projects. Processed and evaluated volumes of intelligence information from a variety of sources. Identified and recommended solutions to analytical problems. Disseminated intelligence products using prescribed methods. Prepared preliminary and finished intelligence products and disseminate the products to the appropriate officials. Participated in liaison activities. Ensured that intelligence data is properly classified, stored and handled in accordance with pertinent directives. Utilized a wide variety of research sources as well as direct liaison to develop an intelligence base of information from which to draw inferences and summaries. Provided forecasts of the level and types of activities that impact the law enforcement communities. Provided briefings to law enforcement and intelligence officials on techniques and procedures involved in research and analysis activities.", "title": "Intelligence Research Specialist", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "objectUrn": "urn:li:member:393384226", "contactInfo": {}, "crmStatus": {"imported": false}, "degree": -1, "fullName": "", "industry": "Law Enforcement", "positions": [{"posId": 620763038, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provided assistance to senior specialists in the collection of intelligence information to identify trends, patterns, profiles, estimates and studies. Reviewed data, researched and conducted analysis to develop and produce intelligence products. Assisted in the implementation of intelligence collection plans by carrying out specified portions or segments of specific projects. Processed and evaluated volumes of intelligence information from a variety of sources. Identified and recommended solutions to analytical problems. Disseminated intelligence products using prescribed methods. Prepared preliminary and finished intelligence products and disseminate the products to the appropriate officials. Participated in liaison activities. Ensured that intelligence data is properly classified, stored and handled in accordance with pertinent directives. Utilized a wide variety of research sources as well as direct liaison to develop an intelligence base of information from which to draw inferences and summaries. Provided forecasts of the level and types of activities that impact the law enforcement communities. Provided briefings to law enforcement and intelligence officials on techniques and procedures involved in research and analysis activities.", "title": "Intelligence Research Specialist", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 620759493, "new": false, "current": false, "endedOn": {"month": 11, "year": 2014}, "companyName": "Bexar County Sheriff Office", "description": "Volunteered to become a member of the Special Emergency Response Team. Responded to incidents to preserve the safety and security of the facility. Developed leads and Intelligence information to find weapons, tattoo machines, drugs and alcohol that threaten the safety and security of officers and inmates. Gained intelligence information and leads from inmates. Observed conduct and behavior of inmates to prevent disturbances and escapes. Inspected all areas of assigned work areas. Maintained direct contact with inmates in order to provide prompt resolution to their problems. Supervised and maintains housekeeping procedures established by facility policies and procedures. Continual training and flexibility to adapt to various duty assignments. Wrote detailed reports in regards to incidents and/or events within the facility. Performed intricate functions within the IMIS, CJIS computer systems. Employed force when necessary to maintain discipline and order among inmates when necessary. Performed other duties as directed.", "title": "Detention Officer", "startedOn": {"month": 2, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:9153837"}, {"posId": 620763185, "new": false, "current": false, "endedOn": {"month": 9, "year": 2012}, "companyName": "Six 3 Systems", "description": "Created a daily classified briefing book for the Southwest Border (SWB), giving Immigration Customs Enforcement offices and other Department of Homeland Security a broad picture of criminal activities along the SWB. Produced a weekly drug seizure report of California which identified Human and Narcotics smuggling trends and other Modus Operandi being used by criminal enterprises operating in that area. Compiled statistics on the type of drugs entering the United States through California and developed trends. Researched using multiple Department of Homeland Security databases. Analyzed drug seizure information to determine trends and patterns. Proofread and edited the drug seizure reports for the director of the Southwest Border Intelligence Coordination Unit. Knowledgeable of the Department of Homeland Security systems. Have had experience using TECS, ATS-L, ATS-P, ATS-N, IFS, SEN, ICE Gangs, ENFORCE, US VISIT, ADIS, ISRS, TDEX, CLEAR, I-2 Analyst notebook, and Palantir for research and developing intelligence products. Attended Palantir training. Conducted research and analysis to develop intelligence information for Homeland Security Investigations managers. Utilized Google Earth imagery to identify and map locations of Special Interest Aliens in support of Homeland Security Investigations. Attended multiple interviews of Special Interest Aliens with Immigration Customs Enforcement agents. Created a questioning guideline for Special Interest Aliens. Wrote Homeland Intelligence Reports (HIR). Aided and assisted Immigration Customs Enforcement personnel from an Intelligence perspective. Developed intelligence collection plans. Developed link charts and background information on criminal enterprises through intelligence collection, research and analysis of information. Researched open source information that impacts law enforcement communities.", "title": "Intelligence Research Specialist", "startedOn": {"month": 11, "year": 2010}}, {"posId": 620763201, "new": false, "current": false, "endedOn": {"month": 11, "year": 2010}, "companyName": "LG-TEK (formerly LinguaLISTek)", "description": "Escorted workers around a secure facility safely with no incidents. Had to remain with the workers all day and ensured they were doing what they were supposed to be. Reported any security incidents to the site manager and if needed had individuals removed from the work site.", "title": "Security Escort", "startedOn": {"month": 5, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:145786"}, {"posId": 620763231, "new": false, "current": false, "endedOn": {"month": 7, "year": 2010}, "companyName": "US Army", "description": "Supervised a 5 member team of Human Intelligence Collectors providing enemy human intelligence and intelligence analysis for the U.S. Military. Accountable for 2 Mine Resistant Ambush Protected (MRAP), 2 High Mobility Multipurpose Wheeled Vehicle (HMMWV), and personal military equipment valued at over 1.5 million dollars. Member of a multifunctional team. Conducted classroom and hands on training on Human Intelligence Operations and Tactical Operations training over 10 personnel. Analyzed captured media, documents, and communications equipment for intelligence value. Conducted document exploitation on captured enemy documents. Conducted military source operations interviewing and debriefing Special Interest Aliens. Wrote Intelligence Information Reports. Proofread and edited team members Intelligence Information Reports. Targeted and selected Special Interest Aliens for useable and valuable information. Developed trends and patterns which led to the capture of Special Interest Aliens. Developed intelligence collection plans and target folders for Special Interest Aliens. Analyzed and researched reports on wanted Special Interest Aliens. Utilized Google Earth imagery to identify and map locations of Special Interest Aliens and safe houses. Conducted liaison with local military and law enforcement. Referred to intelligence reference materials, dictionaries and computerized terminology banks, as needed to ensure translation accuracy. Disseminated intelligence products to those with a need to know the information. Prepared and briefed the weekly capabilities of the American Intelligence teams and information collected by Human Intelligence for the Infantry Regiments.Trained new Human Intelligence Collectors in Human Intelligence operations. Conducted classes on tactical questioning. Helped other units train with Human Intelligence collectors to give them a better understanding of Human Intelligence capabilities.", "title": "Human Intelligence Collector Supervisor", "startedOn": {"month": 11, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 620760494, "new": false, "current": false, "endedOn": {"month": 11, "year": 2007}, "companyName": "US Army", "description": "Part of a 4 member team of Human Intelligence Collectors providing enemy human intelligence and intelligence analysis. Accountable for a High Mobility Multipurpose Wheeled Vehicle (HMMWV) and personal military equipment valued at over 200 thousand dollars. Proofread, edited, and revised translated materials. Conducted military source operations and wrote 100 Intelligence Information Reports. Wrote 20 SPOT reports which led to the discovery of explosives. Proofread and edited team members Intelligence Information Reports. Interviewed and debriefed Special Interest Aliens. Developed target folders on Special Interest Aliens. Developed leads that led to the seizure of weapons and explosives. Developed trends and patterns which led to the capture of Special Interest Aliens. Developed intelligence collection plans and target folders for Special Interest Aliens. Utilized Google Earth imagery to identify and map locations of Special Interest Aliens and safe houses. Briefed Colonels on time sensitive information and assessments of their area of operations. Conducted liaison with local military and law enforcement. Disseminated intelligence products to those with a need to know the information. Analyzed and researched reports on wanted Special Interest Aliens. Identified and resolved conflicts related to the meanings of words, concepts, practices, and behaviors. Followed ethical codes that protect the confidentiality of information.", "title": "Human Intelligence Collector", "startedOn": {"month": 7, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:1223"}], "educations": [], "pictureInfo": {}, "inmailRestriction": "NO_RESTRICTION", "relatedColleagueCompanyId": 533534, "savedLead": false, "unlocked": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "entityUrn": "urn:li:fs_salesProfile:(ACwAABdykSIBwYkwYTHbZ12WQR07-Yb91BeWWJc,NAME_SEARCH,undefined)", "numOfConnections": 2, "flagshipProfileUrl": "https://www.linkedin.com/in/william-flood-aaa8b0ab", "location": "Converse, Texas", "showTotalConnectionsPage": false, "headline": "Intelligence Research Specialist at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}}