{"lastName": "Tasby", "objectUrn": "urn:li:member:52352021", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2015}, "school": "urn:li:fs_salesSchool:18269", "degree": "Master of Business Administration (M.B.A.)", "schoolName": "Keller Graduate School of Management of DeVry University", "eduId": 417605360}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["Information Technology Management "], "school": "urn:li:fs_salesSchool:18732", "degree": "Master of Arts (MA)", "schoolName": "Webster University", "eduId": 85216995}, {"endedOn": {"year": 2008}, "fieldsOfStudy": ["Project Management"], "school": "urn:li:fs_salesSchool:18269", "degree": "Master of Project Management", "schoolName": "Keller Graduate School of Management of DeVry University", "eduId": 417604930}, {"endedOn": {"year": 2005}, "fieldsOfStudy": ["Acquisition and Contracts Management"], "school": "urn:li:fs_salesSchool:20072", "degree": "Associate's degree", "schoolName": "Strayer University", "eduId": 417606274}, {"endedOn": {"year": 2004}, "fieldsOfStudy": ["Information Management"], "school": "urn:li:fs_salesSchool:20097", "degree": "Associate in Applied Science", "schoolName": "Community College of the Air Force", "eduId": 417607215}, {"fieldsOfStudy": ["Business Administration, Acquisition and Contract Management"], "school": "urn:li:fs_salesSchool:20072", "degree": "Bachelor of Business Administration (B.B.A.)", "schoolName": "Strayer University", "eduId": 417605404}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAMe1BUBfN9aHg0Ftw26Kf3ADj-15Hg-Kbc,NAME_SEARCH,undefined)", "numOfConnections": 108, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGfNu052RpjfA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=M4xJOuFXpYw3P0NPm5IZkvFW0YcrNB6JnIUeceA0fS8", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGfNu052RpjfA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=pJ7kvPgDySSMi0b65a5ZpgeVimMZBXu-K-kqsAhfU4M", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGfNu052RpjfA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=2_pcz2I9el0wo1aiFdNcRo_Rm40fAQ6xE2e6ysU0R4g", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGfNu052RpjfA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=kZZyGLfgBDqZ108EWVJy_vWlRKRoYU7G4qcO39Og5JY", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Supervisory Mission Support Specialist", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Dedicated and technically skilled human resources manager with experience in human resources, employee relations, operations, consulting, analysis, research, report preparation, information management, program management, policy, plans, programs, contracting, and budgeting. Expert in planning and managing resources to successfully complete project goals and objectives. Manages programs/projects and policies that impact the Department of Homeland Security, the Department of Defense (DoD) and the United States Air Force. A dynamic, resourceful, and energetic individual who is comfortable being the point of contact for administrative and human resource functions. Excellent communicator with strong aptitude in office administration, financial management, financial reports, and analysis. Excels in resolving employer challenges with innovative solutions, systems and process improvements proven to increase efficiency, customer satisfaction and business revenue. Adept at managing large-scale training projects whilst simultaneously providing administrative support. \n", "pendingInvitation": false, "defaultPosition": {"posId": 979414290, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As a Supervisory Mission Support Specialist in the Houston Field Office, I serve as the first line supervisor for a staff of 8 (at times a staff of 16) Mission Support Specialist in different locations throughout the area.  In addition, I establish guidelines and performance expectations for the staff; provide feedback and evaluate employeeâ\u0080\u0099s performance.  Provide advice, counseling and/or instruction to staff members.  Recommend appointments, selections or reassignments to positons appropriate to the selection authority delegated. I oversee a variety of complex administrative duties to include but not limited to budget, financial management, fleet management, property management, and purchase card.  I also conduct studies and engage in projects designed to improve the overall efficiency and effectiveness of the Houston Field Office.\nâ\u0080¢Accountability and steward of government funds and property.  Disposed of government property with a certified government recycler.  Responsible for over $20M in assets and vehicles for the Houston area of responsibility, managing approximately 5,300 total both assets and vehicles.  Identified procedures and processes that improved the efficiency and effectiveness of managing the assets and providing top-notch customer service.  \nâ\u0080¢Plan, develop, execute, manage and reconcile the spend plan of an approximately $68M dollar budget with multiple lines of accounting and numerous purchases using ICEâ\u0080\u0099s financial system, checking obligations and expenditures and resolving any problems.  I formulate and execute the budget for but not limited to detention facilities, security guard contracts, utilities, and maintenance.\nâ\u0080¢Organize budget data according to appropriation account, object class, and line item codes.  Input all accounting items on budget spreadsheets, collecting data for special reports to leadership, verifying billings and payment, and audits. \n", "location": "Houston, TX", "title": "Supervisory Mission Support Specialist", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Katrina Tasby", "positions": [{"posId": 979414290, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As a Supervisory Mission Support Specialist in the Houston Field Office, I serve as the first line supervisor for a staff of 8 (at times a staff of 16) Mission Support Specialist in different locations throughout the area.  In addition, I establish guidelines and performance expectations for the staff; provide feedback and evaluate employeeâ\u0080\u0099s performance.  Provide advice, counseling and/or instruction to staff members.  Recommend appointments, selections or reassignments to positons appropriate to the selection authority delegated. I oversee a variety of complex administrative duties to include but not limited to budget, financial management, fleet management, property management, and purchase card.  I also conduct studies and engage in projects designed to improve the overall efficiency and effectiveness of the Houston Field Office.\nâ\u0080¢Accountability and steward of government funds and property.  Disposed of government property with a certified government recycler.  Responsible for over $20M in assets and vehicles for the Houston area of responsibility, managing approximately 5,300 total both assets and vehicles.  Identified procedures and processes that improved the efficiency and effectiveness of managing the assets and providing top-notch customer service.  \nâ\u0080¢Plan, develop, execute, manage and reconcile the spend plan of an approximately $68M dollar budget with multiple lines of accounting and numerous purchases using ICEâ\u0080\u0099s financial system, checking obligations and expenditures and resolving any problems.  I formulate and execute the budget for but not limited to detention facilities, security guard contracts, utilities, and maintenance.\nâ\u0080¢Organize budget data according to appropriation account, object class, and line item codes.  Input all accounting items on budget spreadsheets, collecting data for special reports to leadership, verifying billings and payment, and audits. \n", "location": "Houston, TX", "title": "Supervisory Mission Support Specialist", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 979413224, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "Transportation Security Administration (TSA)", "description": "Oversee and coordinate all administrative support for Building Management Services (BMS), consisting of 6 pieces of real estate in the National Capital Region.  Plan, develop, execute, manage and reconcile the spend plan of an approximately $47M dollar budget with multiple lines of accounting and numerous purchases, using TSAâ\u0080\u0099s financial system, Core Accounting System, checking obligations and expenditures and resolving any problems. Serve as a liaison between program managers and staff offices. Works with other Federal agencies to ensure correct and accurate payments are made on contracts. Gather, review, analyze, and interpret data and develop alternate solutions for procedures when necessary.  Developing analytical and statistical reports of program data; analyzing existing procedures to ensure they comply with internal policies; analyzing existing procedures to identify more efficient and effective methods for accomplishing work; preparing audit reports and following-up on corrective items.  Applies a variety of purchasing regulations, methods, and procedures to acquire services and supplies using purchase orders, blanket purchase agreements, or fixed-prices negotiated contracts.\nâ\u0080¢Document findings and prepare recommendations for implementation of new systems, procedures, or organizational changes. Use Excel spreadsheets to track leases, contracts, and projects and the changes made to them on an as needed basis. \nâ\u0080¢Create/maintain an assortment of documents including presentations, logs, databases, graphs, and charts. Answer Data Calls on leases, contracts, and projects. Review and approve incoming/outgoing miscellaneous obligations, purchase card requests, and procurement requests; identifying nonstandard requisitions requiring special financial management treatment and to assure that all financial management data is available, properly recorded, internally consistent, and aligned with related financial, supply, and procurement control systems.  ", "location": "Arlington, VA", "title": "Administrative Officer", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 86064194, "new": false, "current": false, "endedOn": {"month": 4, "year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I served as the Staff Assistant, Department of Homeland Security, Immigration and Customs Enforcement, Office of Asset Administration, under the Office of the Chief Financial Officer, Washington DC.  Reviewed, analyzed and evaluated OAAsâ\u0080\u0099 Reimbursable Work Authorizations (RWAs) and Service Level Agreements (SLAs).  Monitored and submitted time and attendance reporting, reviewed travel authorizations and vouchers.  Served as purchase card holder and validated monthly billing statements.  Reviewed front office budget reports and reported status to senior management. Monitored and track the OAA Tracking System to ensure incoming and outgoing tasks were submitted on-time and accurately.  Managed the Director of OAAâ\u0080\u0099s calendar, and travel arrangements.  Communicated both oral and written presentations to OAAâ\u0080\u0099s Senior Leadership.\nâ\u0080¢Supported the Office of the Chief Financial Officer, Project Management Office team as a liaison managing OAMs critical projects, Financial Action Plans and management initiatives.  \nâ\u0080¢Monitored progress of fleet vehicle sales transactions; updated the vehicle disposal database.  Maintained acquisition and disposal data to ensure financial accuracy.  Reviewed fleet reports of survey and maintained the database consisting of data used to perform program specific evaluations.  Served as the Home-to-Work POC and communicated updates to other divisions.  Served as the Assistant Project Manager ensuring vehicle accountability and regulation compliance for over 8000 law enforcement agents and officers. \n", "location": "Washington D.C. Metro Area", "title": "Staff Assistant", "startedOn": {"month": 4, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 224033139, "new": false, "current": false, "endedOn": {"month": 4, "year": 2010}, "companyName": "Jacobs Technology", "description": "I served as the senior Office Manager providing administrative and security management support for the Secretary of the Air Force/Directorate of Space Acquisition.  Supported the daily administrative and security activities of 22 SCIF personnel.  Administered the information, personnel, and physical security program functions for Special Access Programs (SAPs) and Sensitive Compartmented Information (SCI).  Prepared administrative and security program operations and procedures manuals to assist management in operating more efficiently.\nâ\u0080¢Interfaced with other security professionals on best practices for facility security, information security, and communication security.  Managed records, checklists, and inspection records for organizations authorized open storage of classified information to include COMSEC material.\nâ\u0080¢Determined organizational security goals and objectives for preventative measures ensuring safe keeping of national security information.\nâ\u0080¢Played an integral part as the point of contact for a new Sensitive Compartmented Information Facility (SCIF), coordinated aspects of the build out and information technology infrastructure.\nâ\u0080¢Assisted in the development of life cycle cost and analyses of project cost for the SCIF; performing cost benefit evaluation.\n", "location": "Arlington, VA", "title": "Office Manager", "startedOn": {"month": 9, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:4018"}, {"posId": 224033397, "new": false, "current": false, "endedOn": {"month": 8, "year": 2006}, "companyName": "United States Air Force", "location": "Various", "title": "Information Manager", "startedOn": {"month": 8, "year": 1998}, "companyUrn": "urn:li:fs_salesCompany:157235"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Katrina", "numOfSharedConnections": 0, "memberBadges": {"premium": true, "openLink": true, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/katrina-tasby-38564815", "location": "Tomball, Texas"}