{"lastName": "Giles", "objectUrn": "urn:li:member:7484111", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Public Safety", "educations": [{"endedOn": {"year": 2001}, "fieldsOfStudy": ["Sociology with a minor in Society and Justice"], "school": "urn:li:fs_salesSchool:19657", "degree": "Bachelors of Art", "schoolName": "University of Washington", "startedOn": {"year": 1996}, "eduId": 3922709}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAByMs8BeMD3zMjxKY_2D7pxdkJk8fRhbJ0,NAME_SEARCH,undefined)", "numOfConnections": 1218, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGy72nOCYvcwA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=9RmT57Rn29Uc6qa-6PGtofcAAxMxxXfZWb5Ga0mUgqM", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGy72nOCYvcwA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=2M2to5aCbpPJIfAocdn24ye8JateBPvogNoSvZzegdY", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGy72nOCYvcwA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=Ou9zuiFV-VlGr0vL9UiBvgT2Zn4B0QWRnffsPsiCGcQ", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGy72nOCYvcwA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=F5azkgPZ0f5ZNkBX0e56pdRO-NtbBN5LZ5YhdVE0VfE", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Deputy Field Office Director at DHS", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I am an expert at building, influencing, and leading high-profile coalitions in the establishment of collaborative relationships working towards common goals. I am skilled at developing long-term relationships with emergency services, law enforcement agencies, and government departments, as well as political leaders and distinguished community leaders/members. I have spearheaded and conducted outreach to many community groups, which included private attorneys, political figures and distinguished community members that focused on immigration issues and detention policies.\n\nI have a consistent history of resolving complex issues, establishing and directing critical programs, creating contingency plans, and formulating necessary policies and procedures, to include full management and administration of government contracts throughout its life-cycle. Able to identify critical skills and abilities required for positions within functions and offer opportunities for growth and development of staff. I am experienced in Homeland Security, Law Enforcement, and Public Safety.\n\nMy skills include public speaking and representing various programs/initiatives to outside organizations and influencing public opinion. I have many experiences in supporting and influencing key partners to support up to date government programs and initiatives and able to effectively communicate in difficult settings. \n\nI excel at building and leading top-performing teams. I have been recognized for developing systems, processes and procedures to streamline operations, including fostering change, incorporating innovation, and implementing strategies throughout all levels of organization. My exceptional team leadership skills include effective coaching, motivating, and empowering team members.", "pendingInvitation": false, "defaultPosition": {"posId": 1115884225, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Greater Los Angeles Area", "title": "Deputy Field Office Director", "startedOn": {"month": 3, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Thomas P. Giles", "positions": [{"posId": 1115884225, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Greater Los Angeles Area", "title": "Deputy Field Office Director", "startedOn": {"month": 3, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 749893787, "new": false, "current": false, "endedOn": {"month": 3, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Managed nationâ\u0080\u0099s fourth largest field office, including 400+ government employees, contract staff of ï\u0081¾800, and 2,650 detention beds.\nAccountable for all operational and enforcement functions throughout entire state of Arizona, comprised of main office in Phoenix, and sub-offices in Tucson and Yuma, plus two large detention centers in cities of Florence and Eloy.\n- Site security of staff and individuals detained at all ICE detention centers in Arizona.\n- Office construction projects with budgets ranging from $500K to $2M.\n- Union negotiations related to working conditions, policies and procedures.\n- â\u0088\u0092\tConsistently reviewed investigative reports and determines appropriate action for employee misconduct\n- Outreach in local communities with local law enforcement and community-based non-governmental organizations.\n- Public and community awareness regarding immigration and border security via public speaking engagements.\n- Provided technical expertise as liaison in developing and maintaining relationships with stakeholders in Federal Government, private industry, Non-Governmental Organizations, and state and local law enforcement.\n- Responded\n to media inquiries to educate public about EROâ\u0080\u0099s mission, provides numerous tours of the detention facilities to outside organizations, and publicizes operational achievements within the field office.", "location": "Phoenix, Arizona", "title": "Deputy Field Office Director ", "startedOn": {"month": 6, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 763683186, "new": false, "current": false, "endedOn": {"month": 6, "year": 2014}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Assisted Executive Associate Director in direction, coordination, and management of ERO. Lead integrator of senior staff in all program areas. Maintained working relationships with various executive-level individuals, i.e. members of Congress and staff, legislative, executives, and judicial agencies, executives of major corporations, and staff of non-governmental organizations.\n\n- > Selected to lead team in special projects from conception to successful completion.\n-> Orchestrated process to defend and maintain overtime pay at national level when under Congressional scrutiny, result being that pay in question was not removed for thousands of federal law enforcement officers. Prepared speaking points and analytics for Director of ICEâ\u0080\u0099s testimony before Congress on major immigration issues.\n-> Educated Legal Advisors and Office of Human Capital and strategized on importance of Administratively Uncontrollable Overtime (AUO) premium pay to critical operation and morale.\n-> Conducted detailed and in-depth position-by-position review that justified use and operational need for AUO premium pay.\n-> Established/implemented national standards and justification form for entire ICE workforce nationwide to use allowing AUO premium pay to be continued with changes acceptable to all interested parties.\n ", "location": "ICE Headquaraters, Washington D.C.", "title": "Chief of Staff - Enforcement and Removal Operations (ERO)", "startedOn": {"month": 5, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 763683108, "new": false, "current": false, "endedOn": {"month": 4, "year": 2014}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Executive leader of staff of 210 with oversight of all functions and enforcement programs covering 128 counties in North Texas and entire state of Oklahoma. Partnered with local government officials, law enforcement officials/leaders and elected officials to further explain and promote ICEâ\u0080\u0099s mission.\n\n-> Accepted responsibility for errors made previously by division on improper release of aliens. Established/launched operational methodologies with numerous built-in safeguards to ensure errors do not reoccur and no one would be released with outstanding warrant.\n", "location": "Dallas, TX", "title": "Acting Field Office Director - Dallas Field Office", "startedOn": {"month": 2, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 763681679, "current": false, "endedOn": {"year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Served as ICE Deputy Directorâ\u0080\u0099s team lead on all ERO matters, while also increasing experience and understanding of ICEâ\u0080\u0099s other operational programs.\n\nDeveloped networks across organizational boundaries; built alliances and leveraged strategic relationships while representing ICE. Reviewed all policy and operational issues at national level and assisted in preparing/writing materials for operational issues for high-level/senior classified official briefings. Regularly attended briefings and completed various special projects.\n\n-> Led team in conducting comprehensive, politically sensitive review of release of criminal aliens from ERO custody (Feb. 2013) due to risk of allocation overspend, and that instantly drew national attention from Congress, White House, national media, and law enforcement agencies. Developed responses for Directorâ\u0080\u0099s response to testify before Congress.\n-> Review determined that ï\u0081¾50 aliens were released in error and had to be arrested again.\n-> Briefed both Director and Deputy Director on results, as well as members of Congress to shape clear, concise, accurate, and consistent agency-wide messaging regarding all releases.\n-> Field offices received training with set standard operating procedures.\n-> Recognized agency-wide as Subject Matter Expert for ERO releases and is often contacted for advice and review.\n", "location": "ICE Headquarters, Washington D.C.", "title": "ICE Deputy Chief of Staff | ERO Deputy Chief of Staff", "startedOn": {"year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 763681730, "new": false, "current": false, "endedOn": {"month": 2, "year": 2012}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Managed 12 supervisory and ï\u0081¾60 officers and mission support staff of all enforcement operations in Washington State, including managing Seattle Field Office Training Program. Worked with key stakeholders and political figures in large forums/public venues across Washington State to promote ICE.\n\n-> Applied personal initiative to correct negative, inaccurate, and sensitive perceptions of Secure Communities (SC) program held by many officials in Washington State. Proactively met with each sheriff, numerous elected officials, non-governmental organizations, and public across state, as well as attended open public forums to influence stakeholders to implement use of program in advance of statewide activation.\n-> Built coalitions with multiple interest groups; convinced six sheriffs to voluntarily begin early activation process that demonstrated benefits and served as force multiplier in counties where ERO had not yet established Criminal Alien Program.\n-> As result of early activation, ERO Seattle Field Office Command Center had more than 1,000 SC bio-metric matches in nine-months, allowing appropriate enforcement action to be determined for each case.\n-> Early implementation of SC has allowed ICE to remove additional dangerous criminals from local communities, reducing potential for crime and supporting ICEâ\u0080\u0099s goals and mission of maintaining public safety.\n", "location": "Seattle, WA", "title": "Assistant Field Office Director | Enforcement Operations", "startedOn": {"month": 12, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 763682509, "new": false, "current": false, "endedOn": {"month": 12, "year": 2010}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Managed 30 government staff and 300 contractors at Northwest Detention Center (NWDC) in Tacoma, WA. Planned, directed, managed and coordinated all operational functions related to apprehension, transportation, and case management of individuals housed at NWDC. Leader of outreach and community group, which included private attorneys, political figures and distinguished community members that focused on immigration issues and detention policies.\n\n-> Primary Subject Matter Expert and negotiator for new five-year, $300M detention contract achieving ï\u0081¾$40K/day savings compared to national averages, as well as saving $720K+ in overtime costs.\n-> Using cost benefit analysis, designed/implemented new case management system that streamlined current process, increasing productivity by 40% while simultaneously reducing unnecessary costs.\n-> Due to increase in productivity, cut average six to seven/month wrongful custody lawsuits/month to less than one.\n-> Negotiated better price for detainee bed day-rate that was all-inclusive, eliminating overtime costs and well below national average daily detention costs of $122/day.\n-> Added component into new NWDC contract that resulted in transferring vast majority of transportation workload from ICE to contractor with provision that allowed ICE officers/agents to work in jails to identify foreign-born criminals. \n", "location": "Tacoma, WA", "title": "Officer in Charge | Business Development", "startedOn": {"month": 10, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 763684292, "new": false, "current": false, "endedOn": {"month": 10, "year": 2008}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Managed supervisory ICE law enforcement officers and approximately 18 officers/agents and support staff for 1575-bed Northwest Detention Center. Served as governmentâ\u0080\u0099s contracting officerâ\u0080\u0099s technical representative and accountable for all aspects of $45M contract, including monitoring all expenditures and routinely reviewing justifications for purchases.\n\n-> Initiated meetings to educate and enhance communication with American Immigration Lawyers Association, numerous Non-Governmental Organizations, pro-bono organizations, private attorneys, and community leaders.\n-> Collaborative process initiated ability for detainees to obtain case-related materials into secure areas of facility that has ultimately led to aliensâ\u0080\u0099 cases proceeding at faster pace.\n", "location": "Tacoma, WA", "title": "Supervisory Detention and Deportation Officer", "startedOn": {"month": 4, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 763683383, "new": false, "current": false, "endedOn": {"month": 4, "year": 2007}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Member of first Fugitive Operations Team in Seattle Field Office. Investigated multiple immigration fraud and criminal alien cases and led team in arrests each year.  Member of Seattle ERO Special Operations Team for Seattle Field Office that provided security and crowd control responsibilities during public demonstrations related to immigration issues.", "location": "Seattle, WA", "title": "Deportation Officer | Fugitive Operations Team Leader", "startedOn": {"month": 7, "year": 2001}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 749893859, "new": false, "current": false, "endedOn": {"month": 10, "year": 2004}, "companyName": "Seattle Mariners", "description": "Provided high quality service to visiting teams to ensure their needs were met in responsive professional manner, as well as broad range of clubhouse duties. Accountable for four players during 2001 MLB All Star Game.", "location": "Seattle, WA", "title": "Visiting Clubhouse Assistant", "startedOn": {"month": 3, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:165901"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Thomas P.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/thomaspgiles", "location": "Greater Los Angeles Area"}