{"lastName": "Maly", "objectUrn": "urn:li:member:176022113", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1999}, "fieldsOfStudy": ["Scientific and Technical Intelligence"], "school": "urn:li:fs_salesSchool:20313", "degree": "Master's Degree of Systems Engineering", "schoolName": "Naval Postgraduate School", "startedOn": {"year": 1998}, "eduId": 107678714}, {"endedOn": {"year": 1994}, "fieldsOfStudy": ["Electrical, Electronic and Communications Engineering Technology/Technician"], "school": "urn:li:fs_salesSchool:19008", "degree": "Bachelor of Engineering Techology", "schoolName": "Rochester Institute of Technology", "startedOn": {"year": 1990}, "eduId": 107980176}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAp94mEBXtL5sg4mARIgRpf9AkTZqxVmOqo,NAME_SEARCH,undefined)", "numOfConnections": 245, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHTeCrDrW_cfA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=fE7Tk9XHwgIWCk4nFkFaEW8eyFpTApwCWc4xa6mZ5Tc", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHTeCrDrW_cfA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=PdXMhJiiNnyloJPWN5oOCDSu0W6Ulxjf9fx5HUz_8O4", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHTeCrDrW_cfA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=x8LG6cjaeoGzWGQstDQ4V895X7UmDxJkeWzVn2b7C_w", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHTeCrDrW_cfA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=xzTeSD-9Sh3Ane7vQSs_rgmt7c10IXcZH31iliN5mKY", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Unit Chief, Trade and Financial Crime Analysis", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "â\u0080¢\tDiverse 24-year career supporting federal law enforcement (LE), counterintelligence (CI), combating terrorism (CT), force protection (FP), fleet operations, submarine warfare, reconnaissance, C4I, and carrier-based power projection missions areas\nâ\u0080¢\tSixteen-years supervisory intelligence experience with military, government civilian, and contractor employees; mentored intel teams of up to 40 people in all-source threat analysis; edited written products and constructively critiqued oral presentations\nâ\u0080¢\tRepeatedly restored intelligence element reputation within assigned commands by effective team building\nâ\u0080¢\tActive TS/SCI Security Clearance (PR completed February 2015) with CI polygraph (July 2007)\nâ\u0080¢\tFinisher, Cincinnati Flying Pig Marathon (2015)\nâ\u0080¢\tFive-years participatory and mentorship experience with Toastmasters International; Advanced Communicator Bronze and Competent Leader", "pendingInvitation": false, "defaultPosition": {"posId": 620795764, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "* Adds value to the overall mission of the Analysis Division within the Homeland Security Investigations Office of Intelligence through the by leading eight intelligence analysts in the responsible for characterizing threats posed to homeland through the illicit movement of people and goods in diverse subject areas such as national security, counter-proliferation, and commercial fraud across U.S. borders.\n* Managed the systematic review and in-depth analysis of three intelligence products; ensured that products reflect research, analysis and fusion of law-enforcement operational data with intelligence community reporting and open sources.\n* Coordinated Unit inputs to DHS Theater Intelligence Assessment that supports Southwest Borders and Approaches Campaign.\n* Affected editorial review of 10 intelligence notes and homeland security intelligence reports that convey findings of analytic effort to ICE, DHS, and intelligence community/law enforcement partners.\n* Continues to rapidly learn ICE statutory authorities and task organization so as to affect efficient collaboration within own agency.\n* Executes full supervisory responsibilities for assigned personnel, which include timekeeping, performance management, travel management, materiel inventory, awards submission, and disciplinary action.", "location": "Washington D.C. Metro Area", "title": "Analytic Unit Chief", "startedOn": {"month": 12, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Keith Maly", "positions": [{"posId": 620795764, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "* Adds value to the overall mission of the Analysis Division within the Homeland Security Investigations Office of Intelligence through the by leading eight intelligence analysts in the responsible for characterizing threats posed to homeland through the illicit movement of people and goods in diverse subject areas such as national security, counter-proliferation, and commercial fraud across U.S. borders.\n* Managed the systematic review and in-depth analysis of three intelligence products; ensured that products reflect research, analysis and fusion of law-enforcement operational data with intelligence community reporting and open sources.\n* Coordinated Unit inputs to DHS Theater Intelligence Assessment that supports Southwest Borders and Approaches Campaign.\n* Affected editorial review of 10 intelligence notes and homeland security intelligence reports that convey findings of analytic effort to ICE, DHS, and intelligence community/law enforcement partners.\n* Continues to rapidly learn ICE statutory authorities and task organization so as to affect efficient collaboration within own agency.\n* Executes full supervisory responsibilities for assigned personnel, which include timekeeping, performance management, travel management, materiel inventory, awards submission, and disciplinary action.", "location": "Washington D.C. Metro Area", "title": "Analytic Unit Chief", "startedOn": {"month": 12, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 575129545, "new": false, "current": false, "endedOn": {"month": 12, "year": 2014}, "companyName": "Naval Criminal Investigative Service", "description": "- Selected ahead of two eligible GS-15 and eight GS-14's by Deputy Director to serve as Interim Senior Intelligence Officer to bridge the gap between Defense Intelligence Senior Level appointments.\n- Personally coached and mentored many of the 130 intelligence analysts and 30 supervisory intelligence specialists at NCIS in intelligence tradecraft, threat understanding, and personnel management processes, and leadership so as to improve performance, increase awareness, and resolve issues in these disparate functions.\n- Facilitated the provision of intelligence regarding foreign intelligence entity, terrorism, and criminal activity affecting the Navy, Marine Corps, and NCIS to the NCIS Director, Deputy Director, and Executive Staff via twice weekly Executive Staff meetings; weekly intelligence briefings; and via over 150 succinct, unclassified emergent issues summaries.\n- Engaged senior managers from National-level elements, such as the NCTC, Department of Homeland Security, and Navy Staff in order to provide NCIS intelligence professionals the benefit of their agencies work.\n- Chaired seven monthly Strategic Analysis Working Group meetings; that are intended to improve interoperability through improved information sharing and resource pooling between tenant commands housed in the Russell-Knox Building. Participants included senior intelligence representatives from DIA Office of Counterintelligence, Air Force Office of Special Investigations, Defense Security Service, and US Army Criminal Investigation Command, US Army Protective Security Battalion, and Pentagon Force Protection Agency. \n- Served as NCIS representative to NAVINTEL enterprise (primarily OPNAV N2N6 and NMIC) on matters pertaining to CI/CT/CRIM intelligence analysis; and intelligence plans, policy, and manpower since January 2013. In concert with NCIS N2N6 representative has devised at least one strategic analytic plans so complementary NCIS/NMIC/NAVINTEL mission objectives are mutually supported.", "location": "Quantico, Virginia", "title": "Supervisory Intel Specialist", "startedOn": {"month": 3, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:392107"}, {"posId": 276266219, "new": false, "current": false, "endedOn": {"month": 3, "year": 2013}, "companyName": "Naval Criminal Investigative Service", "description": "- Supervised a team of 2 government civilians, 3 contractors, and 1 intern responsible for transforming policies/plans, training, and technology insertion affecting intelligence and information sharing efforts.\n- As a recognized SME regarding information sharing policy between the law enforcement and defense intelligence communities, drove the formation and first six-months of operations of the eight-person DoD Joint Counterterrorism Coordination Cell (JC3); awarded ODNI Certificate of Distinction for effort in May 2013.\n- Redesigned NCIS' implementation of DCIPS performance management in FY13 so as to better align with USDI and NAVINTEL policy requirements while increasing overall transparency and standardization.\n- Authored systems requirements documents and evaluated technologies, such as Palantir, CCDI, TAC, and the Directorate internal SharePoint portal to enhance analytic capability and improve collaboration; coordinated technical support to increase systems availability; worked closely with stakeholders to develop schema for Palantir usage.\n- Coordinated completion of 300+ policy reviews and data call requests from Intelligence Community, Defense Department, and Department of the Navy stakeholders so as to ensure that policy enabled NCIS intelligence analysis and collection efforts.\n- Applied substantive programmatic expertise to leading change initiatives that enhance intelligence support to DON through technology integration to improve NCIS ability to deliver intelligence regarding terrorism, foreign intel, and criminal threats in furtherance of operations, investigations, threat warning, and analytic efforts.\n- DoN program lead for FBI eGuardian system since 2010 inception; key tasks included oversight of workflow development, hiring staff, managing access, and providing training for 300+ users at 40+ locations; co-authored policy guidance with so as to better explain agency data management responsibilities relative to investigative/operational actions.", "location": "Quantico, VA", "title": "Intelligence Program Management Division Chief", "startedOn": {"month": 2, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:392107"}, {"posId": 491158404, "new": false, "current": false, "endedOn": {"month": 2, "year": 2012}, "companyName": "Naval Criminal Investigative Service", "description": "June 2007 â\u0080\u0093 April 2010: MTAC Watch and Current Intelligence Division Chief as Military Officer \nApril 2010 â\u0080\u0093 Feb 2012: MTAC Americas Division Chief as Government Civilian\nâ\u0080¢\tSupervised efforts of one GG-13 supervisory intelligence specialist and 5 military/ civilian/contract analysts who characterized asymmetric threats affecting Navy/Marine Corps in the Western Hemisphere that produced 270 threat assessments, 140 daily threat articles, and 12 special memoranda regarding specific CI/CT/CRIM threats; developed innovative product formats to maximize impact of finished intelligence.\nâ\u0080¢\tWorked closely with 7 NCIS Field Offices within the United States to ensure that intelligence communicated to the Navy/Marine Corps was consistent with investigative findings while preserving integrity of LE/CI operations and investigations; exercised full supervisory responsibility for subordinate employees by planning work assignments, assigning work schedules, identifying training needs, and evaluating performance.\nâ\u0080¢\tRoutinely served acting (GS-15) supervisor responsible of 50-person MTAC for periods of up to 90 days; supervised efforts of 24/7 intelligence watch, 4 geographic-aligned divisions, and production divisions; senior editor for overall NCIS intelligence product line.\nâ\u0080¢\tDeveloped impacting assessments on diverse topics while introducing collaborative analytic methodologies at all security classification levels on CT/CI/CRIM threats; topical examples include: Congressional inquiries re:Guam and terrorism; counterintelligence threats to acquisitions; transnational and homegrown violent extremist terrorist threats to the Navy; and evolution of maritime counterintelligence threats in the US.\nâ\u0080¢\tAdvocated threat understanding with Navy commands (CNO Staff, Fleet Forces, Naval Regions, Fleets, and Installations); Marine Corps Commands (HQMC, Operating Forces, and Supporting Establishment); Joint Commands (NORTHCOM, SOUTHCOM); and Defense Agencies (DIA, JITF-CT, DTRA, Attaches).", "location": "Quantico, VA", "title": "Multiple Threat Alert Center Division Chief", "startedOn": {"month": 6, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:392107"}, {"posId": 276864575, "current": false, "endedOn": {"year": 2007}, "companyName": "Commander, US Seventh Fleet Staff", "description": "â\u0080¢\tLed and mentored 3 officers and 7 enlisted in intelligence operations that supported U.S. Fleet Commander's Information needs in the U.S. Pacific Command (PACOM) AOR\nâ\u0080¢\tRewrote every major intelligence process affecting routine/crisis intelligence operations involving US and allied Maritime Forces in the PACOM AOR, which included Fleet OPTASK Intel, Maritime Intelligence Support Concept for Supporting Plan 5077, and Intel Requirements Management\nâ\u0080¢\tIntelligence Readiness: Developed measures for assessing readiness levels for fleet intelligence; established requirements, coordinated scheduling, and hosted mobile training teams for Japan-based intelligence elements; coordinated installation, accreditation, and maintenance of intel system capabilities on USS BLUE RIDGE, USS KITTY HAWK, and USS ESSEX\nâ\u0080¢\tCommand Post Exercise (CPX) Participation: Managed all aspects of departmental involvement in over eleven major CPX; Directed forty-person strong Joint Intelligence Support Element (JISE) / Maritime Intelligence Center (MIC) during CPX execution\nâ\u0080¢\tLed four-person enlisted watch team as Fleet Intelligence Watch Officer; Conducted operational intelligence (OPINTEL) analysis that provided fleet commander the maritime threat force disposition and intentions in the U.S. Pacific Command Area of Responsibility", "location": "Japan", "title": "Intelligence Operations Manager", "startedOn": {"year": 2005}}, {"posId": 276864737, "current": false, "endedOn": {"year": 2005}, "companyName": "Patrol and Reconnaissance Wing TWO", "description": "â\u0080¢\tPrepared 4 intelligence officers and 17 junior enlisted, apportioned to four subordinate squadrons, for tactical intelligence duties on deployment to the U.S. Central Command (CENTCOM) AOR\nâ\u0080¢\tAligned standard for U.S. Navy P-3C AIP Aircraft Imagery Intelligence (IMINT) collection and exploitation qualification with deployed tasking in the CENTCOM AOR\nâ\u0080¢\tEnhanced Squadron Operational Readiness Exams (ORE) with scenarios that provided realistic context for P-3C combat operations and lessons learned from forward deployed operations\nâ\u0080¢\tWing Foreign Disclosure Officer: interpreted standing body of guidance related to maritime patrol aircraft to provide guidance to squadrons engaging foreign mission partners\nâ\u0080¢\tForward Deployed Task Force Intelligence Officer: led 1 officer and 4 enlisted temporarily during crisis operations in the CENTCOM and PACOM AORs for periods of up to 30 days; applied SME knowledge of AIP ISR capabilities and collection requirements management to properly scope aircrew tasking", "location": "Kaneohe, Hawaii", "title": "Intelligence Adviser / Instructor", "startedOn": {"year": 2003}}, {"posId": 276921986, "current": false, "endedOn": {"year": 2003}, "companyName": "Office of Naval Intelligence", "description": "â\u0080¢\tSCI Global Command and Control System- Integrated Intelligence and Imagery (GCCS-I3) Project Officer (2001-2002): Built team, processes to support accreditation, installation, and technical support; established fully accredited capabilities at 10 sites, representing a 600% increase over chartered FY02 baseline\nâ\u0080¢\tPMO Assistant Operations Officer (2000): Managed 3 enlisted and 3 contractors in the conduct field computer installations and remote technical support for systems accredited for use on JWICS; created trade show displays â\u0080\u0093 handling all aspects of equipment logistics, program brochures, and command briefings; managed $2.4M fund cite that provided minor ADP equipment to tactical intelligence elements based on validated U.S. Navy intelligence requirements", "location": "Suitland, MD", "title": "Joint C4I Project Manager", "startedOn": {"year": 2000}, "companyUrn": "urn:li:fs_salesCompany:1331"}, {"posId": 276922263, "current": false, "endedOn": {"year": 1998}, "companyName": "Helicopter ASW Squadron 14", "description": "â\u0080¢\tLed 4 officers, 8 enlisted Carrier Air Wing FIVE Mission Planning Support aboard USS INDEPENDENCE; critical functions included tactical briefing/debriefing, mission report writing, and mission planning support\nâ\u0080¢\tSecurity Manager. Maintained inventory and 100% accountability for classified material; coordinated personnel security actions and annual refresher training for all squadron personnel\nâ\u0080¢\tAir Wing Isolated Personnel Report (ISOPREP) Manager; collected information for all Carrier Air Wing FIVE aircrew for ISOPREP reports; maintained 100% accountability for all Battle Group Blood Chits", "location": "Japan", "title": "Air Intelligence Officer", "startedOn": {"year": 1996}}, {"posId": 276922460, "current": false, "endedOn": {"year": 1995}, "companyName": "Naval Recruiting District Miami", "description": "Coordinated prospective applicant interviews and package submissions.\n\nSupported command through completion of JAGMAN investigations and serving as member of summary court marshal", "title": "Assistant Officer Recruiter", "startedOn": {"year": 1995}}, {"posId": 276922585, "current": false, "endedOn": {"year": 1994}, "companyName": "Rochester Institute of Technology", "description": "- While attending RIT as a full-time student, served as a University's representative to peer student residents. \n- Principal responsibilities included setting a dormitory atmosphere conducive to study; understanding campus policies and regulations and taking action to correct undesirable behavior, as appropriate; orienting students to university life with an emphasis on assisting in their emotional and academic adjustment.", "title": "Resident Advisor", "startedOn": {"year": 1991}, "companyUrn": "urn:li:fs_salesCompany:165762"}, {"posId": 276922748, "current": false, "endedOn": {"year": 1990}, "companyName": "US Navy", "description": "- Learned all of the ship's electronic, mechanical, pneumatic, and electrical systems with an emphasis on Reactor Controls Division (RC-Div) equipment. Operated and performed organizational-level maintenance on submarine nuclear propulsion plants reactor control systems. \n- Adjusted controls to position rod height and to regulate flux level, coolant temperature, and rate of power flow, following standard procedures. \n- Responded to system or unit abnormalities. \n- Monitored all systems for normal running conditions and recorded operating data. \n- Implemented operational procedures such as those controlling start-up and shut-down activities.", "location": "USS TREPANG", "title": "Submarine Reactor Operator", "startedOn": {"year": 1988}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Keith", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/keith-maly-795b484a", "location": "Washington D.C. Metro Area"}