{"lastName": "Baden", "objectUrn": "urn:li:member:149818205", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Information Technology and Services", "educations": [{"endedOn": {"year": 2009}, "fieldsOfStudy": ["Criminology/Criminal Justice"], "school": "urn:li:fs_salesSchool:19585", "degree": "Bachelor of Science (BS)", "schoolName": "Longwood University", "startedOn": {"year": 2004}, "eduId": 87233307}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAjuC10BZrO0FCgR-E5CcxkqG4jy2LouHhc,NAME_SEARCH,undefined)", "numOfConnections": 543, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHrIjRonBz1gw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=6ZGHcKFR8Uqy5g_E1oA6Ntqyd1VXzlftIeoPF7VO1uM", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHrIjRonBz1gw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=3L9KAc2WZxJpEwVUMvzL2WqOLus5bQ9Y8aSS12fkgRc", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHrIjRonBz1gw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=sWfoanpcmEC3CNzU9s9tAs_lPIAbThfThcv-R7_j1RM", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHrIjRonBz1gw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=3M2xKUVPgTdmNIzUZi7DYYQ8_SfnIHvFiFxz8e5Ytog", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "IT Program Manager with ICE", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Alex is known for being a great Leader and Technologist and thrives in a fast paced, agile environment.  He is currently an IT Project Manager with the General Services Administration (GSA), Office of the Chief Information Officer, GSA-IT.  He serves as an IT Project Manager/Scrum Master, where he manages multiple projects using the Agile Scrum methodology.  He is currently managing the re-platforming of multiple applications to a new AWS Cloud environment, while also managing the development of the GSA Acquisition Gateway.  In addition to his role as Project Manager, Alex is the admin for multiple enterprise tools, including Rally Dev, GitHub, Google Analytics, and Flowdock.  In the past he has managed the development of multiple applications using the Force.com platform along with creating customized data Dashboards using Tableau and Salesforce. \n\nPrior to his work with the GSA-IT, Alex was a Program Analyst for 2 years with the GSAs Early Career Professional Development Program (ECPDP).  Here he participated in five 3-4 month rotational assignments and an intensive training curriculum to earn his Masters Certification in Business Analysis from George Washington University.", "pendingInvitation": false, "defaultPosition": {"posId": 1325175637, "new": true, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington D.C. Metro Area", "title": "IT Program Manager", "startedOn": {"month": 6, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Alex Baden", "positions": [{"posId": 1325175637, "new": true, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington D.C. Metro Area", "title": "IT Program Manager", "startedOn": {"month": 6, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 435600015, "new": false, "current": true, "companyName": "GSA", "description": "â\u0080¢Effectively lead meetings with Senior Management and Executives to brief them on the ongoing status of multiple Projects/Programs\nâ\u0080¢Identify risks and possible roadblocks and work with appropriate team members to create strategies to help mitigate and avoid them\nâ\u0080¢Evaluating and recommending the acquisition of, implementation of, and dissemination of IT security tools, procedures and practices to protect information assets  \nâ\u0080¢Recommending actions that will minimize security risks\nâ\u0080¢Troubleshooting IT security problems that affect the availability of applications.\nâ\u0080¢Lead the successful development of multiple System Security Plans and ATOs.  \nâ\u0080¢Coordinate with the ISSM and ISSO on a weekly basis to ensure that all development is within the security guidelines.\nâ\u0080¢Manage the planning, tracking, scope, cost, schedule, quality, and risk throughout multiple software development projects\nâ\u0080¢Implemented and manage our Business Rules Engine to help optimize our application workflows.  Reduced cost/effort of contractor support by 10% when implementing application workflow changes/updates.\nâ\u0080¢Assisted in the development of a plan to reduce the cost of application authentication licenses by 25% \nâ\u0080¢Manage the full life-cycle development of multiple complex systems/applications.\nâ\u0080¢Lead multiple project teams ranging from 7-15 developers, testers, architects, product owners, etc.\nâ\u0080¢Coached multiple teams during the transition from classic Waterfall to Agile Scrum project management. \nâ\u0080¢Manage the design, development, and deployment of multiple projects using different Agile Methods (SAFe, Kanban, Scrum) \nâ\u0080¢Successfully managed the migration/re-platforming of multiple applications to a new AWS cloud environment/platform \nâ\u0080¢Identify and resolve all outages in a timely manner so that the application is not down for an extended  period\nâ\u0080¢Managed the creation of the SATCOM Datamart which was completed 2 weeks early and saved approx. $8,000 from the original budget.", "location": "1800 F St. NW, Washington, D.C.", "title": "IT Project Manager with the GSA-IT", "startedOn": {"month": 7, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:5353"}, {"posId": 1157633162, "new": false, "current": false, "endedOn": {"month": 6, "year": 2018}, "companyName": "GSA", "description": "Detail assignment to assist Small and Medium Agencies transition to the new EIS contract. \n Provide transition assistance from expiring Networx, WITS 3, and LSA contracts to EIS.  Meet regularly with Agencies to go over Transition Plan, review/scrub inventory, provided modernization recommendations, assist in building Agencies SOW, etc.", "location": "Washington D.C. Metro Area", "title": "Agency Manager (Detail)", "startedOn": {"month": 11, "year": 2017}}, {"posId": 229165033, "new": false, "current": false, "endedOn": {"month": 7, "year": 2013}, "companyName": "GSA", "description": "â\u0080¢Served as a consultant to both internal and external customers by providing timely and efficient support and technical guidance. \nâ\u0080¢Project Lead/Support for the implementation of a business line executive dashboard, which involved gathering and documenting business intelligence/dashboard requirements, and identifying and mapping all of the data elements. \nâ\u0080¢Project Lead/Manager for the implementation of Salesforce.com Applications (Project Management, Application Inventory, ITS Navigator, etc.). These applications provided more reliable consistently with tracking business operations. Completed these projected through the new office Agile software life cycle development methodology. Some responsibilities included: customer relationship management, gathering and refining client requirements, developing and executing Salesforce solutions, delivering and developing end user training, and driving user adoption. \nâ\u0080¢Served as an application tester, though multiple applications to proactively resolve issues before released into production. \nâ\u0080¢Used Microsoft SQL Server for several major data imports and developed new reports. Performed administration duties to maintain up to date data and reports. \nâ\u0080¢Conducted User Acceptance Testing (UAT) on the 3 Salesforce Applications and developed the Configuration Guides.\nâ\u0080¢Project Lead for Advantage! Search Weights testing. Required me to perform quantitative analysis with qualitative work.\nâ\u0080¢Captured requirements and development an in depth Google Site for upper management regarding the creation of a GSA External Award Repository to help promote increased employee morale and motivation.\nâ\u0080¢Technical Point of Contact for large enterprise collaboration platform roll out (Salesforce Chatter).\nâ\u0080¢Provided project management support for the infrastructure conversion of an overseas Global Supply retail store.\nâ\u0080¢Facilitated and recorded 3 day ITS Training for the National Customer Services Center (NCSC).", "location": "Crystal City", "title": "Program Analyst", "startedOn": {"month": 2, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:5353"}, {"posId": 241456859, "new": false, "current": false, "endedOn": {"month": 7, "year": 2011}, "companyName": "Touchtel Communications DBA Sprint", "description": "â\u0080¢Responsible for the hiring, firing, and training of all employees\nâ\u0080¢Maintain all employee schedules and payroll\nâ\u0080¢Review and explain contracts with customers\nâ\u0080¢Consult with customers, and provide advice about cell phones and cell phone plans\nâ\u0080¢Resolve problems with customerâ\u0080\u0099s cell phones, plans, bills, and service\nâ\u0080¢Responsible for ordering all phones and accessories for company\nâ\u0080¢Complete end of day work (count register, count inventory, clean store, and lock down store) and take deposits to the bank\nâ\u0080¢Number one Sales Associate for Touchtel Communications", "location": "Fredericksburg, VA", "title": "General Manager", "startedOn": {"month": 10, "year": 2009}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Alex", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/alex-baden-42521042", "location": "Washington D.C. Metro Area"}