{"lastName": "Sanders", "objectUrn": "urn:li:member:310563368", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2019}, "fieldsOfStudy": ["Recreation Administration; American Sign Language  "], "school": "urn:li:fs_salesSchool:18860", "degree": "Bachelor of Science Degree (In Progress)", "schoolName": "Kean University", "startedOn": {"year": 2017}, "eduId": 473171728}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Business Administration"], "school": "urn:li:fs_salesSchool:20072", "degree": "Bachelor of Science Degree (Courses Taken - 9 Credits)", "schoolName": "Strayer University", "startedOn": {"year": 2011}, "eduId": 491380536}, {"endedOn": {"year": 2003}, "fieldsOfStudy": ["Nursing"], "school": "urn:li:fs_salesSchool:20502", "degree": "Associates in Science Degree (Courses Taken - 40 Credits)", "schoolName": "Union County College", "startedOn": {"year": 2001}, "eduId": 491383014}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABKC0igBMFZFjfdCcRw6Q86QfHhg9tuJbZw,NAME_SEARCH,undefined)", "numOfConnections": 43, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQH3eNC-P89_EQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=0RuD7ZfNXTM56fXhHOCDrJKvBNmssPA3NiIrohlx77M", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQH3eNC-P89_EQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=9bdf_DbLYC0xh9XtACJXELfPcYjSLGOVjsD_4m3Qx3E", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQH3eNC-P89_EQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=JJedsDXLZ-pOcbqpyNEMBufhzXglkCxZGXncw7-I2rU", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQH3eNC-P89_EQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=jcxTV8yvJ-V-xILxRBZ8001e1e7dLCPXDEqUVBqdp6A", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Government Associate  | Program Specialist  |  Office Manager", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Highly motivated, results-oriented specialist with 8 yearsâ\u0080\u0099 expertise in a focused-approach to developing and delivering organizational objectives. Talented team leader with notable success defining and driving process improvements and working with diverse cultures. Superior ability to collaborate with colleagues and stakeholders, deliver the best-in-class customer service, and exceed performance expectations. Outstanding written and oral communication skills and technological savvy, coupled with strong knowledge of the Federal Emergency Management Agency, United States Department of Homeland Security, and Internal Revenue Service policies and procedures. Extensive personnel management and administrative experience, including demonstrated proficiency in handling classified information, dynamic problem solving, and decision-making with a high level of integrity.", "pendingInvitation": false, "defaultPosition": {"posId": 1193402964, "new": false, "current": true, "companyName": "FEMA", "description": "â\u0080¢\tSupport the DSA mission in an effort to build and sustain an expeditionary cadre to establish a timely presence in disaster impacted areas, while focusing on addressing the needs of disproportionately impacted populations and disaster survivors. \nâ\u0080¢\tOffer accessible, in-person case-specific information and referrals. \nâ\u0080¢\tProvide survivors with referrals to whole community partners as needed. \nâ\u0080¢\tIdentify disability-inclusive public information needs so strategic messaging can be developed and disseminated.\nâ\u0080¢\tMaintain case status updates, inquiries, and on-site survivor information. \nâ\u0080¢\tProvide basic information about application status and other eligible assistance. \nâ\u0080¢\tCollect and review new information or documents while updating case files.\nâ\u0080¢\tCoordinate the on-site registration intake process. \nâ\u0080¢\tRegister survivors for disaster assistance, provide guidance through registration, and provide an overview of FEMA disaster assistance. \nâ\u0080¢\tConduct survivor need assessments and engage disaster survivors and local officials in identifying immediate unmet needs for a quick resolution via FEMA and/or our whole community partners.\nâ\u0080¢\tConduct community outreach and create partnerships with the local and state emergency managers, disability partners, private sector, voluntary agencies, faith-based and community-based organizations to foster a culture of strengthened alliances to support the delivery of inclusive, equitable services to survivors.\nâ\u0080¢\tAssess, inform, and report critical and emerging disaster needs to the Operations Section and other Joint Field Office (JFO) leadership for decision-making purposes.", "location": "Disaster Survivor Assistance (DSA) â\u0080\u0093 Recent Deployment, Florida Region", "title": "Disaster Survivor Assistant Specialist ", "startedOn": {"month": 6, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:2995"}, "degree": 3, "fullName": "J'Anice Sanders", "positions": [{"posId": 1193402964, "new": false, "current": true, "companyName": "FEMA", "description": "â\u0080¢\tSupport the DSA mission in an effort to build and sustain an expeditionary cadre to establish a timely presence in disaster impacted areas, while focusing on addressing the needs of disproportionately impacted populations and disaster survivors. \nâ\u0080¢\tOffer accessible, in-person case-specific information and referrals. \nâ\u0080¢\tProvide survivors with referrals to whole community partners as needed. \nâ\u0080¢\tIdentify disability-inclusive public information needs so strategic messaging can be developed and disseminated.\nâ\u0080¢\tMaintain case status updates, inquiries, and on-site survivor information. \nâ\u0080¢\tProvide basic information about application status and other eligible assistance. \nâ\u0080¢\tCollect and review new information or documents while updating case files.\nâ\u0080¢\tCoordinate the on-site registration intake process. \nâ\u0080¢\tRegister survivors for disaster assistance, provide guidance through registration, and provide an overview of FEMA disaster assistance. \nâ\u0080¢\tConduct survivor need assessments and engage disaster survivors and local officials in identifying immediate unmet needs for a quick resolution via FEMA and/or our whole community partners.\nâ\u0080¢\tConduct community outreach and create partnerships with the local and state emergency managers, disability partners, private sector, voluntary agencies, faith-based and community-based organizations to foster a culture of strengthened alliances to support the delivery of inclusive, equitable services to survivors.\nâ\u0080¢\tAssess, inform, and report critical and emerging disaster needs to the Operations Section and other Joint Field Office (JFO) leadership for decision-making purposes.", "location": "Disaster Survivor Assistance (DSA) â\u0080\u0093 Recent Deployment, Florida Region", "title": "Disaster Survivor Assistant Specialist ", "startedOn": {"month": 6, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:2995"}, {"posId": 849687252, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢\tResearch detainee history using multiple sources which include EAGLE, Central Index System (CIS), ENFORCE Removal Module (EARM) to establish identity/citizenship and manage detained dockets. \nâ\u0080¢\tProvide administrative support to managers, supervisors and staff members by assisting in daily management of officeâ\u0080\u0099s activities.\nâ\u0080¢\tSummarize and tabulate detainee information from various reports, utilizing a variety of databases and automated systems. \nâ\u0080¢\tGenerate and verify detainee reports, encounters, charging documents, data quality and create/revise spreadsheets. \nâ\u0080¢\tLog detainee requests submitted to Detention Officers in preparation for audits. \nâ\u0080¢\tSearch federal, state, and local law enforcement records and databases. \nâ\u0080¢\tCompile, evaluate, and report actionable intelligence information to senior level officers. \nâ\u0080¢\tPrepare travel presentations for detainees by uploading Judge Orders for removal along with passport photos and fingerprints in the Electronic Travel Document (eTD) system, used to communicate with a variety of Consulates to return aliens to their appropriate country.\nâ\u0080¢\tGather inventory of vacancies in detention facilities along with new transfers to submit on the evening report for the Assistant Field Office Director (AFOD). \nâ\u0080¢\tSubmit requests for Judgment of Conviction (JOC) and Plea Transcripts to various superior courts preparing files for deportation of detainees.\nâ\u0080¢\tObtain and analyze the validity of foreign identity documents to obtain a travel document, and enforce the departure of aliens from the U.S. through the execution of final removal orders. \nâ\u0080¢\tCollect data and assist Deportation Officer in order to prepare and issue 205/294 forms (warrant of removal/deportation and warning to alien ordered removed documents).", "location": "Detained Unit, Newark, NJ ", "title": "Enforcement Removal Assistant ", "startedOn": {"month": 3, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 604281180, "new": false, "current": false, "endedOn": {"month": 3, "year": 2015}, "companyName": "Internal Revenue Service", "description": "â\u0080¢\tGenerated and analyzed reports and inputted hours charged to cases for multiple teams comprised of 20 agents. \nâ\u0080¢\tEntered tax deficiencies or penalties in ERCS for managerâ\u0080\u0099s approval. \nâ\u0080¢\tProvided correct disposal code for the preparation of case processing. \nâ\u0080¢\tCompleted Integrated Data Retrieval System (IDRS) requests and submitted via email using MultiPrint. \nâ\u0080¢\tProcessed reports weekly using Issue Based Management Information System (IBMIS) to maintain correct hours charged to cases by agents in ERCS.\nâ\u0080¢\tAssisted other group secretaries with technical questions regarding case closures, including but not limited to understanding the issues, identifying the problem, and recommending solutions. \nâ\u0080¢\tContacted agents via email, Office Communicator, and telephone, providing their locations for the day in order to reconcile hours with SETR.\nâ\u0080¢\tReviewed and inputted time and attendance records for 7 employees on a biweekly basis using SETR. \nâ\u0080¢\tInvestigated employee conduct cases in conjunction with the Employee Communication and Correspondence Office (ECCO), which included analyzing the allegations, interviewing all parties involved, summarizing the facts, and recommending possible disciplinary actions. \nâ\u0080¢\tComplied with the Personal Identification Information (PII) policy by immediately filing any forms that possess taxpayer information, while securing locked file cabinets.", "location": "Self-Employment/Small Business Division, New York, NY", "title": "Secretary", "startedOn": {"month": 9, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:4922"}, {"posId": 1193403798, "new": false, "current": false, "endedOn": {"month": 11, "year": 2014}, "companyName": "Internal Revenue Service", "description": "â\u0080¢\tAssisted Program Manager in remote location with documenting and editing mid-year reviews and end of year assessments for 8 Managers throughout the eastern states (performed all duties while simultaneously working regular functions as Secretary).\nâ\u0080¢\tGenerated reports requested on the Examination Return Control System (ERCS) on a biweekly basis for 9 groups. \nâ\u0080¢\tComposed and managed territories gain/loss report monthly. \nâ\u0080¢\tPrepared memoranda of appreciation and responses for final approval. \nâ\u0080¢\tReviewed all managers 1204 responses, certifying to the Commissioner each quarter, ensuring no tax enforcement were violated in any manner. \nâ\u0080¢\tInputted personnel action requests via Human Resources (HR Connect) for temporary promotions, detail assignments, power recruitments, and mid-year assessments. \nâ\u0080¢\tSecured travel arrangements for hotel, airfare, and prepared travel vouchers for approval. \nâ\u0080¢\tMaintained and scheduled Supervisorâ\u0080\u0099s calendar with priority actions and appointments.\nâ\u0080¢\tCompiled monthly briefings from 9 different groups for submission to the Chief. \nâ\u0080¢\tDiscussed administrative updates during monthly territory meetings with the Territory and Group Managers via conference call. \nâ\u0080¢\tSubmitted minutes to the Program Manager regarding monthly territory meetings.\nâ\u0080¢\tInputted and reconciled time and attendance records for 15 employees on a biweekly basis using Single Entry Time Reporting System (SETR). ", "location": "Self-Employment/Small Business Division â\u0080\u0093 East Territory, New York, NY ", "title": "Acting Territory Secretary ", "startedOn": {"month": 2, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:4922"}], "pictureInfo": {}, "relatedColleagueCompanyId": 2995, "savedLead": false, "firstName": "J'Anice", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/j-anice-sanders-20801088", "location": "Greater New York City Area"}