{"objectUrn": "urn:li:member:345851106", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Security and Investigations", "educations": [{"endedOn": {"year": 2015}, "fieldsOfStudy": ["Investigated Forensic Science"], "school": "urn:li:fs_salesSchool:18574", "degree": "Bachelor of Science (BS)", "schoolName": "University of Maryland University College", "startedOn": {"year": 2012}, "eduId": 222302103}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABSdROIBTj2coBLl9Hb6j6p4XjroX52Lm8M,NAME_SEARCH,undefined)", "numOfConnections": 21, "showTotalConnectionsPage": false, "headline": "Student at University of Maryland University College", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Security/Law Enforcement Professional: Seven years comprehensive experience in law enforcement, mobile patrol operations, investigations, incident reporting, emergency response team procedures, Information Protection, Basic understanding and knowledge of Sensitive Compartmented Information Facility (SCIF) security and, anti-terrorism, counter-terrorism, and force protection procedures; executive protection, with a strong emphasis on Executive Protection, Surveillance Detection, Information, Personnel, Physical, and Operational Security Procedures and Operations.  Highly refined communication and interpersonal skills cultivated throughout several high-profile, operationally critical leadership positions. Certified Department of Defense Executive Protection Physical Security Specialist/ Nationally Certified National Crime Information Center (NCIC) Operator/Department of Defense Database Biometric Identification Systems Certified.  Dynamic leader; excels in high-pressure environments â\u0080\u0093 proactive and results oriented.  Physical security/vulnerability identification/mitigation expert.  Decisive â\u0080\u009cproblem solverâ\u0080\u009d with highest level of personal and professional integrity.", "pendingInvitation": false, "defaultPosition": {"posId": 775376594, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "San Diego, California", "title": "ERA", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 775376594, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "San Diego, California", "title": "ERA", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 619135610, "new": false, "current": false, "endedOn": {"month": 6, "year": 2015}, "companyName": "USPTO", "title": "Legal Instrument Examiner", "startedOn": {"month": 9, "year": 2014}}, {"posId": 542873057, "new": false, "current": false, "endedOn": {"month": 6, "year": 2013}, "companyName": "G4S Security Services", "description": "â\u0080¢ Possesses ability to identify security deficiencies during inspections, physical security patrols, and surveys.  Able to recommend procedures to correct deficient areas.  Performs anti-terrorism and crime threat vulnerability assessments.\nâ\u0080¢ As Senior Emergency 9-1-1 Dispatcher, conducts physical security checks by utilizing the Close Circuit Television (CCTV) System, responsible for monitoring 150 different camera angles, 200 electronic alarm penetration/ exit points.\nâ\u0080¢ Responsible for monitoring/securing U.S. Government Accountability Officeâ\u0080\u0099s alarmed facilities utilizing the C-Cure System and Simplex Fire Alarm System.\nâ\u0080¢ Applies anti-terrorism/force protection (AT/FP) and crime deterrent methodology to conduct critical vulnerability and threat risk assessments pertaining to the companyâ\u0080\u0099s Electronic Badging Access Control System (EBACS).\nâ\u0080¢ Responsible for command and control of emergency and criminal situations that occur on U.S. Government property and inside the facilities.  Properly dispatches, monitors, and coordinates the responses of Special Police Officers (SPOs) and mobile patrols, to alarms, suspicious activities, and any emergency situations coordinating with local fire and police emergency services as needed.", "title": "Alarm Monitor", "startedOn": {"month": 7, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:5355"}, {"posId": 542871598, "new": false, "current": false, "endedOn": {"month": 7, "year": 2012}, "companyName": "United States Air Force", "description": "â\u0080¢ Force Protection Specialist, ensured safety/security/communication remained intact between Air Force One/Air Force 2/Air Force Headquarters/US Embassy Officials/US Secret Service/US State Department/foreign security agencies/civilian law enforcement.\nâ\u0080¢ Inspected and Ensured all Anti-Terrorism, Counter Terrorism, and Force Protection Measures were enforced, correcting deficiencies and recommending and or implementing approved security regulations and procedures.\nâ\u0080¢ Entrusted with Top Secret/Secret Compartmented Information Clearance and provided physical security for over $2.5 billion in government aircraft and safeguarded over $5 million in Air Force One/Presidential assets and equipment vital to national security.\nâ\u0080¢ Controlled, dispatched, monitored, and coordinated security, law enforcement, and fire/emergency medical services operations for over 65 mobile security/police patrols and security access control post entrances.\nâ\u0080¢ Verified the residency, status, and warrants/records check of all Local Nationals and Third Country Nationals with the use of the Biometric Automated Toolset (BATS), which the system communicated and coordinated with Air Force Office of Special Investigations (AF OSI), Central Intelligence Agency, National Security Agency, Defense Intelligence Agency, Federal Bureau of Investigations, and International Criminal Police Organization (ICPO/INTERPOL) data base systems.\nâ\u0080¢ On a daily basis, personally processed approximately 250 exceptions to policy request letters and oversaw an office that processed nearly 700 exceptions to policy request letters a day.", "title": "Executive Protection Supervisor/Physical Security Specialist", "startedOn": {"month": 9, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:157235"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/maria-loredo-3969a997", "location": "Hyattsville, Maryland"}