{"lastName": "Yglesias", "objectUrn": "urn:li:member:81959295", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Public Relations and Communications", "educations": [], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAATimX8BPTe6LmFEn9_Ei-QdOrMNWAQ_FAI,NAME_SEARCH,undefined)", "numOfConnections": 851, "showTotalConnectionsPage": false, "headline": "Public Affairs Officer at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Media Specialist with over 24 years of experience in media relations, communication, crisis management, and community outreach. Managed media and community outreach programs across multiple media platforms including print, radio, TV, and web.", "pendingInvitation": false, "defaultPosition": {"posId": 197026506, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Mr. Yglesias is responsible for ICE's external communications in support of the agency's mission and serves as the spokesman for the agency covering areas from Key West to Indian River County. He handles press inquiries, develops and distributes news releases and provides multimedia services. He is also a part of the South Florida Human Trafficking Task Force providing key communication strategies for local and state media outlets.", "location": "Miami", "title": "Public Affairs Officer", "startedOn": {"month": 6, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Nestor Yglesias", "positions": [{"posId": 197026506, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Mr. Yglesias is responsible for ICE's external communications in support of the agency's mission and serves as the spokesman for the agency covering areas from Key West to Indian River County. He handles press inquiries, develops and distributes news releases and provides multimedia services. He is also a part of the South Florida Human Trafficking Task Force providing key communication strategies for local and state media outlets.", "location": "Miami", "title": "Public Affairs Officer", "startedOn": {"month": 6, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 188696678, "new": false, "current": false, "endedOn": {"month": 6, "year": 2011}, "companyName": "N.Y. News Services", "description": "N.Y. News Services provides Broadcast and Media Consulting.", "title": "President", "startedOn": {"month": 4, "year": 2011}}, {"posId": 132360759, "new": false, "current": false, "endedOn": {"month": 4, "year": 2011}, "companyName": "South Florida Water Management District", "description": "Develop and implement media, communication, and community outreach strategies that successfully deliver the South Florida Water Management Districtâ\u0080\u0099s mission; create a yearly media plan detailing possible story ideas including elements for the story and interviews to be conducted; provide appropriate responses to inquiries; also served as the on camera bilingual spokesperson for media; coordinate interviews, plan press conferences, gather information for press releases; assess news stories online and in media tracking software to compile timely, appropriate and meaningful daily news clips, disseminate news clips via media software to Governing Board, Executive Office, District Managers, and selected staff; maintain a current list of all local print, radio, TV, and web media; craft messages regarding droughts, flooding, water conservation and public awareness on these issues; quarterly visits to all media outlets pitching various story ideas; represent the SFWMD at various county and local city meetings addressing the members on the importance of water conservation and receiving proclamations", "location": "Miami", "title": "Media Relations Specialist", "startedOn": {"month": 10, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:19994"}, {"posId": 132362126, "new": false, "current": false, "endedOn": {"month": 10, "year": 2006}, "companyName": "CBS News", "description": "Manage the day to day news desk operations for all of CBS 4 newscasts; coordinate information between reporters, producers, anchors, and editors; manage a staff of assignment desk editors, reporters, photographers, and live truck operators; responsible for determining when to move crews to breaking news stories; ensure accuracy of news content; work with community leaders on stories that impact the CBS 4 viewing market; develop daily story ideas including special project pieces; provide conflict resolution among staff members; coordinate assignment desk staff schedules; manage one of the most successful internship programs in the CBS owned and operated company; work in conjunction with local, state, and federal officials during times of emergencies; coauthor a Master plan outlining news strategies to be implemented in the event of Fidel Castroâ\u0080\u0099s death", "location": "Miami", "title": "Assignment Manager", "startedOn": {"month": 3, "year": 2001}, "companyUrn": "urn:li:fs_salesCompany:7246"}, {"posId": 132492031, "new": false, "current": false, "endedOn": {"month": 2, "year": 2001}, "companyName": "Executive Office of the Governor", "description": "Represent the Governor at various functions within city, county, state, and federal governments; work on local and state issues in the Governorâ\u0080\u0099s Miami field office; attend various county and local municipality commission or council meetings; address constituent needs; attend local community outreach meetings and gatherings; met with local elected officials regarding issues pertaining to state government; advance the Governors visits to Miami with both the Office of External Affairs and the Florida Department of Law Enforcement; coordinate and attend Bill signings by the Governor in Miami; develop lists of concerns and pertinent issues for the Governor prior to his visits to Miami", "title": "Special Assistant to the Governor State of Florida", "startedOn": {"month": 3, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:871031"}, {"posId": 132492411, "new": false, "current": false, "endedOn": {"month": 3, "year": 2000}, "companyName": "WORLD CHAMPIONSHIP WRESTLING", "description": "Play by play announcer for World Championship Wrestling to South America", "title": "Spanish Announcer", "startedOn": {"month": 7, "year": 1998}}, {"posId": 132492158, "new": false, "current": false, "endedOn": {"month": 3, "year": 2000}, "companyName": "Univision", "description": "Coordinate information between reporters, producers, and anchors, worked with a staff of assignment desk editors, reporters, photographers, and live truck operators. Responsible for ensuring accuracy of news content, working with community leaders on stories that impacted WLTVâ\u0080\u0099s  viewing area. Planned and coordinated major events such as Super Bowl coverage, Calle Ocho Festival, and Noche de Carnaval, field produced all major local news events such as state and local election coverage, organized full coverage of various elections both at the local and state level; produced, co-wrote and edited special projects news stories.", "title": "News Assignment Editor, Special Events Planner, Field Producer", "startedOn": {"month": 10, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:5775"}, {"posId": 132493165, "new": false, "current": false, "endedOn": {"month": 10, "year": 1996}, "companyName": "Univision", "description": "Produce local sport segments which included Spanish Sport shows for the Miami Heat and the Florida Marlins; coordinate information between reporters, producers, and anchors; work with a staff of assignment desk editors, reporters, photographers, and live truck operators", "title": "Sports Producer/Assignment Desk Editor", "startedOn": {"month": 6, "year": 1995}, "companyUrn": "urn:li:fs_salesCompany:5775"}, {"posId": 132493572, "new": false, "current": false, "endedOn": {"month": 6, "year": 1995}, "companyName": "WRFM RADIO 830 AM", "description": "Spanish Play by Play Voice of the University of Miami Hurricanes football and baseball teams; host of a two-hour Spanish Sports Talk show called  Onda Deportiva; main broadcaster for sport segments in the WRFM newscasts", "title": "Senior Sports Broadcaster", "startedOn": {"month": 6, "year": 1994}}, {"posId": 132494170, "new": false, "current": false, "endedOn": {"month": 6, "year": 1994}, "companyName": "Univision Network", "description": "Assist in the production of a sports wrap up show entitled Titulares Deportivos; producer of Univisionâ\u0080\u0099s Major League Spring Training Coverage in the state of Florida; interview professional athletes for stories; produce nightly sports briefs for the network", "title": "Associate Producer/Field Producer", "startedOn": {"month": 3, "year": 1991}, "companyUrn": "urn:li:fs_salesCompany:5775"}, {"posId": 132494350, "new": false, "current": false, "endedOn": {"month": 3, "year": 1991}, "companyName": "Univision Television Group", "description": "Assist the assignment desk and producer in news gathering efforts for the nightly newscast", "title": "Desk Assistant and Associate Producer for News", "startedOn": {"month": 8, "year": 1989}, "companyUrn": "urn:li:fs_salesCompany:5775"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Nestor", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/nestor-yglesias-19354623", "location": "Miami/Fort Lauderdale Area"}