{"lastName": "Kreibich", "objectUrn": "urn:li:member:29380057", "contactInfo": {"websites": [{"category": "OTHER", "dataSource": "LINKEDIN", "url": "http://www.dhs.gov/index.shtm"}]}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2007}, "fieldsOfStudy": ["Psychology"], "school": "urn:li:fs_salesSchool:17769", "degree": "Bachlor of Arts", "schoolName": "Arizona State University", "startedOn": {"year": 2004}, "eduId": 24203824}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAHATdkBt_7ILGRwQTuGy4kf7ZbAdlSN-y8,NAME_SEARCH,undefined)", "numOfConnections": 131, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFxfq1xkhBmfw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=OaBgQHASBoLbJFBHGPCL1QfvO26-EX2x6GCfCoaERYw", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFxfq1xkhBmfw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=fal7l7ysWKoWVwebIg5sxIfmVSp9QdzYuU_K3xBS9iA", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFxfq1xkhBmfw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=gnei7pIpzxGr53vrLcF72coeLyA0eobswIEH-h5pYNw", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFxfq1xkhBmfw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=-c4oVl485Cf4ilK9PimktCGP9i061kxJLLHgW2e0ZBs", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Special Assistant to Field Office Director", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Briana Kreibich currently works as the Special Assistant to the Phoenix Field Office Director for U.S. Immigration and Customs Enforcement.\n\nPrior to her current position, she served as a Policy Analyst liaison to the Office of the Director within U.S. Department of Homeland Security, U.S. Immigration and Customs Enforcement. Her job included providing assessments, evaluations, and recommendations on new or proposed policy initiatives, Department priorities, programs and operations at the national level. Briana was responsible for communicating Senior Leadership policy initiatives within the Department, interagency, state, local, tribal and community-based agencies.  She synchronized the development and public release of Department level strategies and reports. \n\nBrianaâ\u0080\u0099s previous experience includes serving as a Policy Analyst at the U.S. Department of Homeland Security, Office of Counternarcotics Enforcement. Her job included coordinating counternarcotics policy and operations within the Department, inter-agency, state, local and tribal agencies. Briana synchronized the development of strategic level U.S. Government strategies to combat transnational criminal organizations and stop illegal drugs from entering the United States. \n\nIn addition, Briana served as the Project Director for the Strategic Prevention Framework -State Inventive Grant and oversaw the implementation of Arizonaâ\u0080\u0099s Methamphetamine Initiative within the Arizona Governorâ\u0080\u0099s Office for Children, Youth and Families. \n\nBriana holds a B.A. in Psychology from Arizona State University with an emphasis in women studies and child development. She is an affiliate member of the American Psychological Association.\n\nSpecialties: Interagency and Intergovernmental Coordination and Communication; Law Enforcement Policy Analysis and Development; Drug Policy; Border Security; Immigration Policy; Public Affairs; Strategic Planning and Research; and Program Implementation and Management.", "pendingInvitation": false, "defaultPosition": {"posId": 900603930, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Phoenix, Arizona Area", "title": "Special Assistant to Field Office Director", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Briana Kreibich", "positions": [{"posId": 900603930, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Phoenix, Arizona Area", "title": "Special Assistant to Field Office Director", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 692212787, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Serves as the supervisor overseeing eight administrative personnel implementing a variety of programs including budget, finance, procurement, property, logistics, human resources and travel. Responsible for providing senior level advice on a variety of policy areas including administrative, law enforcement, immigration and emergency response. Prepares briefings, project papers, talking points, data excel sheets and other correspondence for senior leadership. Researches and analyzes the impact of national and state legislation for the office. Represents the field office on the Joint Task Force â\u0080\u0093 West Arizona J1 Support Section.", "location": "Phoenix, Arizona Area", "title": "Supervisory Mission Support Specialist", "startedOn": {"month": 4, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 318925533, "new": false, "current": false, "endedOn": {"month": 4, "year": 2015}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Prepares briefings, project papers, and correspondence on new or proposed administrative policy initiatives to Senior Leadership. Coordinates the development and delivery of training for officers regarding administrative and law enforcement policy within the Phoenix Area of Responsibility. Reviews, researches, and analyzes the efficiency and effectiveness of program operations carried out by administrative and professional personnel. Responsible for providing senior level advice on a variety of administrative areas. Prepares talking points, speeches, briefings and other media materials for Senior Leadership. Communicates Senior Leadership policy initiatives within the Department, interagency, state, local, tribal and community-based agencies. Provides support to the development and public release of Department level policies. Serves as a liaison between the Office and outside vendors, agencies, and stakeholders.", "title": "Mission Support Specialist", "startedOn": {"month": 4, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 231877319, "new": false, "current": false, "endedOn": {"month": 4, "year": 2012}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Served as the Office of Policy liaison to the Office of the Director providing guidance and recommendations to the Senior Counselor to the Director. Provided assessments, evaluations, and recommendations on new or proposed policy initiatives, Agency priorities, programs and operations at the national level. Represented the Agency in senior level meetings with the Department and interagency on proposed policy and legislative initiatives. Synchronized the development and public release of reports including the response to the Homeland Security Advisory Council, Task Force on Secure Communities and the Office of the Inspector General review of Secure Communities. Coordinated the development and public release of press releases, fact sheets, newsletters and other briefing materials. Prepared speeches, talking points, testimony, briefings and other correspondence for senior leadership. Communicated policy initiatives within the Department, interagency, state, local, tribal and community-based agencies. Monitored and reported to senior leadership on immigration related data trends. Reviewed, researched, and analyzed the impact of legislation and regulations for the Agency.", "title": "Policy Analyst", "startedOn": {"month": 11, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 127980645, "new": false, "current": false, "endedOn": {"month": 11, "year": 2011}, "companyName": "US Department of Homeland Security", "description": "Coordinated counternarcotics policy, budget and operations within the Department, interagency, state, local and tribal agencies. Synchronized the development and public release of the Departments equities in the National Security Strategy to Combat Transnational Criminal Organizations and the National Drug Control Strategy. Oversaw the Departmentâ\u0080\u0099s Counternarcotics Coordinating Council policy agenda. Provided high-level briefings to senior leadership and Congressional staff on a variety of counternarcotics policy, budget and operations. Reviewed, researched, and analyzed the impact of drug-related legislation and regulations for the Department. Served as one of the Departments two representatives on the Drug Endangered Children Task Force that was chaired by the Deputy Attorney General. Communicated Senior Leadership policy initiatives within the Department, interagency, state, local, tribal and community-based agencies. Presented on behalf of the Department at the National Sheriffs Association, Community Anti-Drug Coalitions of America and National Alliance of State Drug Enforcement Agencies conferences. Monitored and reported to senior leadership on national drug related data trends.", "title": "Policy Analyst, Office of Counternarcotics Enforcement", "startedOn": {"month": 6, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 64185995, "new": false, "current": false, "endedOn": {"month": 6, "year": 2010}, "companyName": "Office of the Governor Janice Brewer", "description": "Provided overall support and coordinated the activities of the Strategic Prevention Framework State Incentive Grant. Staffed Sub- Committees of the Arizona Substance Abuse Partnership including the Underage Drinking Prevention Committee, Community Advisory Board and the Methamphetamine Task Force to ensure that goals and objectives are met. Managed federal grant dollars to support community substance abuse coalitions, contractors and evaluators to ensure implementation of environmental strategies.", "title": "SPF- SIG Project Director", "startedOn": {"month": 1, "year": 2009}}, {"posId": 64185686, "new": false, "current": false, "endedOn": {"month": 1, "year": 2009}, "companyName": "Office of the Governor Janet Napolitano", "description": "Provided overall support and coordinated the activities of the Strategic Prevention Framework State Incentive Grant. Staffed Sub- Committees of the Arizona Substance Abuse Partnership including the Underage Drinking Committee and Workforce Development Committee to ensure that goals and objectives are met. Managed federal grant dollars to support community substance abuse coalitions, contractors and evaluators to ensure implementation of environmental strategies.", "title": "SPF-SIG Project Coordinator", "startedOn": {"month": 12, "year": 2008}}, {"posId": 46570233, "new": false, "current": false, "endedOn": {"month": 12, "year": 2008}, "companyName": "Office of the Governor Janet Napolitano", "description": "Provided overall support and coordinated the activities of the Anti-Methamphetamine Initiative. Staffed the Methamphetamine Task Force to ensure that goals and objectives were met. Managed state grant dollars to support anti-methamphetamine coalitions, contractors and evaluators to ensure implementation of environmental strategies.", "title": "Anti-Methamphetamine Initiative Program Administrator", "startedOn": {"month": 1, "year": 2008}}, {"posId": 46571665, "new": false, "current": false, "endedOn": {"month": 12, "year": 2007}, "companyName": "Office of the Governor Janet Napolitano", "title": "Administrative Coordinator", "startedOn": {"month": 8, "year": 2007}}, {"posId": 46572150, "new": false, "current": false, "endedOn": {"month": 5, "year": 2007}, "companyName": "Arizona State University", "title": "Research Assistant", "startedOn": {"month": 1, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:4292"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Briana", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/brianakreibich", "location": "Phoenix, Arizona"}