{"lastName": "Weibel", "objectUrn": "urn:li:member:46614528", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Security and Investigations", "educations": [{"fieldsOfStudy": ["Intelligence"], "degree": "Bachelor of Science", "schoolName": "National Intelligence University (NIU)", "eduId": 41669344}], "inmailRestriction": "DISABLED", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAALHSAABytPSgt_gaX7U37Io_RJGaYHo0W4,NAME_SEARCH,undefined)", "numOfConnections": 124, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGLs7k0Wbj9FQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=oSushrmJwJ0DEZqGq7ADgJe2sfDzuTWgTubj0SaAG18", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGLs7k0Wbj9FQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=TFUdW2hhCiYneuXzwzLMQcRcu7mh1T_ECfkB5TWXlxg", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGLs7k0Wbj9FQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=z0tWCH9OIXGlEZoebxKXsqq4pdIihvkVQQQRH0gXZ_o", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQGLs7k0Wbj9FQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=W2IKzOLT8_gRvmNztz159MNIqggf2hUZxAn_pufs2bU", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Analyst at US Department of Homeland Security (DHS), Homeland Security Investigations (HSI)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "â\u0080\u0093 25 years of federal government experience in intelligence and operations at Homeland Security Investigations, Transportation Security Administration, International Criminal Police Organization, and Drug Enforcement Administration; almost nine years of military intelligence experience in the US Air Force Reserve, including two years of active duty.  \n\nâ\u0080\u0093 Senior-level intelligence analyst with five years of joint duty experience in two interagency detail assignments at the Human Smuggling and Trafficking Center and the Department of Homeland Security Human Smuggling Cell.\n\nâ\u0080\u0093 Successful experience performing intelligence analysis identifying emerging threats to national security.\n\nâ\u0080\u0093 Bachelor of Science in Intelligence from the National Intelligence University; over 2,000 hours of intelligence-related training at federal and military schools.\n\nâ\u0080\u0093 Recipient of numerous awards for superior performance throughout federal and military career in intelligence, including the Air Forceâ\u0080\u0099s Outstanding Reserve Duty Intelligence Noncommissioned Officer of the Year Award.", "pendingInvitation": false, "defaultPosition": {"posId": 673798126, "new": false, "current": true, "companyName": "US Department of Homeland Security (DHS), Homeland Security Investigations (HSI)", "title": "Analyst", "startedOn": {"month": 5, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Vernon Weibel", "positions": [{"posId": 673798126, "new": false, "current": true, "companyName": "US Department of Homeland Security (DHS), Homeland Security Investigations (HSI)", "title": "Analyst", "startedOn": {"month": 5, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 75789249, "new": false, "current": false, "endedOn": {"month": 5, "year": 2015}, "companyName": "DHS, Transportation Security Administration (TSA)", "description": "â\u0080\u0093 Last served as the senior agency representative to the Human Smuggling and Trafficking Center (HSTC). Enhanced TSAâ\u0080\u0099s integration and information sharing efforts among the intelligence, law enforcement, and diplomatic communities to prevent terrorist travel. Provided the HSTC with subject matter expertise in travel system infrastructure vulnerabilities and access to TSA resources. Provided the TSA access to HSTC resources and data to identify document fraud trends, terrorist travel tactics, and organizations that seek to exploit travel system infrastructure for criminal purposes. Researched, analyzed, and produced value-added intelligence products on behalf of the HSTC and the TSA. Collaborated with allied foreign governments and international organizations in producing joint strategic threat assessments on migration trends and risks.\n\nâ\u0080\u0093 Produced value-added intelligence products supporting operational and policy decision making by TSA senior leadership. Produced intelligence products focused on domestic and international transportation threats. Awarded the TSA Office of Intelligence and Analysis Performer of the Quarter. \n\nâ\u0080\u0093 Presented threat briefings to TSA senior leadership, field operators, colleagues, technical experts, and industry stakeholders of varying size and position.\n\nâ\u0080\u0093 Provided collaborative analysis, substantive review, and insightful comments of draft products produced by DHS and other IC partners with transportation-related mission equities.\n\nâ\u0080\u0093 Participated or led involvement at inter and intra-agency working groups, committees, and meetings.\n\nâ\u0080\u0093 Provided threat scoring supporting TSA-level, congressionally-mandated risk analysis projects. Coupled threat scores with vulnerability and consequence analysis enabling TSA to assess risks posed by a variety of threat scenarios. Honored with the TSA Honorary Team Award for Transportation Sector Security Risk Assessment.", "title": "Analyst", "startedOn": {"month": 12, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 100697729, "new": false, "current": false, "endedOn": {"month": 1, "year": 2005}, "companyName": "US Air Force Reserve", "description": "â\u0080\u0093 Mobilized for Operation Enduring Freedom (OEF) supporting the Global War on Terrorism between 4/2002â\u0080\u00932/2004. Independently managed numerous daily activities within the intelligence office. Named the 2002 Air Force Outstanding Reserve Duty Intelligence NCO of the Year for successfully turning around the office.\n\nâ\u0080\u0093 Researched and analyzed all-source information used to develop and present various types of intelligence briefings. Provided current intelligence briefings to command staff and aircrew on global developments impacting organizational missions. Created comprehensive profiles of terrorism, foreign intelligence, criminal, and military threats at destination airfields for pre-mission and pre-deployment briefings.\n\nâ\u0080\u0093 Provided intelligence input to mission planning and aircrew preparation for employment missions. Collaborated closely with tactics personnel and aircrew, assessed threats along mission routes, and assisted development of effective mission flight profiles. Coordinated and conducted post-mission aircrew intelligence debriefings to obtain valuable, time-sensitive information on mission results. Prepared and submitted intelligence reports to disseminate debriefed information for follow-on crews.\n\nâ\u0080\u0093 Performed research and analysis of organizational intelligence programs, procedures, and policies to provide improved intelligence support to wing exercises.  \n\nâ\u0080\u0093 Planned, prepared, and conducted training of aircrew and intelligence personnel. Provided formal training to aircrew on various topics during annual block training. Oversaw the career progression and training for enlisted intelligence personnel. Appointed to leading intelligence positions to include: the internal and external trainer; anti-terrorism officer; intelligence oversight monitor; security manager; communications security (COMSEC) responsible officer; and evasion and recovery program manager.", "title": "Intelligence Noncommissioned Officer", "startedOn": {"month": 12, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:1343"}, {"posId": 100696672, "new": false, "current": false, "endedOn": {"month": 12, "year": 2003}, "companyName": "International Criminal Police Organization (INTERPOL) â\u0080\u0093 US National Central Bureau (USNCB)", "description": "â\u0080\u0093 Received, responded to, and followed-up on incoming requests of a criminal justice, humanitarian, or other law enforcement-related nature. Initiated contacts and performed liaison with US and foreign law enforcement organizations; gathered facts and obtained statements. Ensured domestic law enforcement agencies carried out police action in the United States for National Central Bureaus of INTERPOL member countries. \n\nâ\u0080\u0093 Handled urgent law enforcement requests for international criminal investigative and humanitarian assistance through independent actions and tasking. Assisted in halting international parental abductions in progress, pursued child abductors, and located victim children. Processed humanitarian requests involving suicide prevention, death notification, and health and welfare checks on US citizens overseas or foreign nationals in the United States. \n\nâ\u0080\u0093 Worked closely with law enforcement officials from US border agencies to ensure the identification of international criminals and fugitives presenting themselves for inspection and admission into the United States. Played key role in the arrest and extradition of international fugitives.", "title": "Analyst", "startedOn": {"month": 2, "year": 2001}, "companyUrn": "urn:li:fs_salesCompany:164427"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Vernon", "numOfSharedConnections": 0, "memberBadges": {"premium": true, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/vernon-weibel-00074013", "location": "United States"}