{"objectUrn": "urn:li:member:322093924", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2015}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:18075", "degree": "Doctor of Business Administration", "schoolName": "Wilmington University", "startedOn": {"year": 2012}, "eduId": 206376882}, {"endedOn": {"year": 2004}, "fieldsOfStudy": ["Organizational Management"], "school": "urn:li:fs_salesSchool:17787", "degree": "Masters of Arts", "schoolName": "University of Phoenix", "startedOn": {"year": 2001}, "eduId": 206375980}, {"endedOn": {"year": 2002}, "fieldsOfStudy": ["Criminology"], "school": "urn:li:fs_salesSchool:18812", "degree": "Master's degree", "schoolName": "Minot State University", "startedOn": {"year": 2000}, "eduId": 206379319}, {"endedOn": {"year": 2000}, "fieldsOfStudy": ["Criminal Justice/Police Science minot Information Management"], "school": "urn:li:fs_salesSchool:18812", "degree": "Bachelors of Science", "schoolName": "Minot State University", "startedOn": {"year": 1997}, "eduId": 206378405}, {"endedOn": {"year": 2001}, "fieldsOfStudy": ["Instructor Technology"], "school": "urn:li:fs_salesSchool:20097", "degree": "Associate of Arts (A.A.)", "schoolName": "Community College of the Air Force", "startedOn": {"year": 2001}, "eduId": 206378440}, {"endedOn": {"year": 1996}, "fieldsOfStudy": ["Vehicle Maintenance and Repair Technologies"], "school": "urn:li:fs_salesSchool:20097", "degree": "Associate of Arts (A.A.)", "schoolName": "Community College of the Air Force", "startedOn": {"year": 1995}, "eduId": 206378432}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABMyw2QBtDmJbis7D38j90CuPgHLDOOTzE0,NAME_SEARCH,undefined)", "numOfConnections": 108, "showTotalConnectionsPage": false, "headline": "Visionary Rain Maker", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Rich mix of human resource management, safety operations, business development, and finance for multi-million dollar organization.  Diversely experienced from start up to work out, turnaround and rapid growth â\u0080\u0093 resolving long-standing problems and creating solutions that improve business and operation efficiency.  Leverage expert analysis and insights to promulgate lean approach and team empowerment that drives organizational improvements and instills best practices.  Objective and progressive with dynamic leadership and business acumen to produce extraordinary results.  Selfless advocate and masterful persuader.  Able to tackle any task with precise deployment of management tactics and diversified resolutions.", "pendingInvitation": false, "defaultPosition": {"posId": 856429638, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Management and Program Analyst", "startedOn": {"month": 9, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 856429638, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Management and Program Analyst", "startedOn": {"month": 9, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 508624292, "new": false, "current": true, "companyName": "State of Delaware", "description": "Motor Vehicle Lane Manager â\u0080\u0093 Providing First Class Service to the First State. Oversees 59 personnel in four work centers.  Lead by example by carrying out work duties in a professional and ethical manner.  Learn new information and processes through various forms of training or from co-workers and supervisors.  Maintain the confidentiality of personal information provided.  Assess and identify staff training needs.  Reviews/administers annual appraisal reports Communicate effectively in writing to employees, the public, government agencies, and other stakeholders.  Delegate work assignments and appropriate level of responsibility to staff.  Establish priorities and maintain service levels in the work unit/office or division.  Evaluate and document the work of staff to ensure that it meets quality, quantity, and timeliness expectations.  Evaluate problems and issues relating to work unit/office programs, procedures, business processes, and/or policies.  Read and comprehend written documents of varying complexity including departmental policy manuals and guides, legislative mandates, instructional guides, written correspondence, analytical reports, and printouts  Enforces the REAL ID program standards to ensure customers meet federal security, authentication, and issuance procedures standards for the state driver's licenses and identification cards, as well as various immigration issues pertaining to terrorism.  Deal with challenging customers, while providing satisfactory service.  Provide superior customer service by implementing continuous improvement practices within the work unit.  Reason logically and creatively while utilizing a variety of analytical techniques to resolve complex problems.", "title": "Lane Manager", "startedOn": {"month": 7, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:10256"}, {"posId": 508635700, "new": false, "current": true, "companyName": "Wesley College", "title": "Adjunct Associate Professor", "startedOn": {"month": 9, "year": 2005}}, {"posId": 508635720, "new": false, "current": false, "endedOn": {"month": 8, "year": 2011}, "companyName": "United States Air Force", "description": "More than twenty-one years experience as Heavy Mobile Equipment Mechanic/Supervisor.  Leads 81 reserve, military, and civilian personnel providing logistical support directly to top leadership from 12 work-centers valued at $13M.  Orchestrates operation compliance and maintenance requirements for both preventative and corrective actions of a 973 vehicles/318 pieces equipment account in excess value of $137M.  Manages $5.1M annually budget program to include conducting audit quarterly audit inspections.  Monitors receipts, storage, invoices, and issues for all parts procured with the Government Purchase Card.  Monitors and controls the flow of all vehicles down for parts and mission capable parts work orders.  Oversees the consolidation of work order residue, working stock and bench stock items.  Analyzes monthly performance indicators to identify deficient areas in manpower, training, and overall organizational efficiency.  Determines fleet vehicle serviceability, overall condition and need for repair.  Schedule maintenance for industrial machines and equipment, and keep equipment service records.  Provide technical assistance and training to lower grade employees.  Leads the implementation of the Air Forceâ\u0080\u0099s safety and health program and processes specific to Department of Defense, Air Force, federal, state, and local authorities throughout 39 work centers.  Tracks and communicates safety performance metrics including the core safety processes to include work center audits and monthly training, and goals for Air Force Safety and Voluntary Protection Program offices.  Initiate safety and environmental inspections, identifying issues and developing corrective action plans to insure compliance with applicable safety, health and environmental regulations including OSHA, EPA, HAZMAT, DOD, and state and local regulations.", "title": "Master Sergeant", "startedOn": {"month": 4, "year": 1990}, "companyUrn": "urn:li:fs_salesCompany:157235"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/joseph-nicolai-b44a508b", "location": "Camden Wyoming, Delaware"}