{"lastName": "Lukens", "objectUrn": "urn:li:member:129011846", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Program Development", "educations": [], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAewkIYBK7CGWVYyTLMrOWsMwXEvOxiFByA,NAME_SEARCH,undefined)", "numOfConnections": 120, "showTotalConnectionsPage": false, "headline": "Component Acquisition Executive Planning and Governance Professional  at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 897581850, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Guide national level Acquisition Programs through the DHS requirements validation and acquisition governance processes. Work directly with program managers and the DHS Joint Requirements Council to ensure critical thinking and program planning processes are efficiently and effectively completed. Work experience in acquisition strategy and acquisition plan development. Apply practical knowledge of product development/acquisition, from initial gap analysis and identification to creation of operational requirements generation to industry solicitation to final solution selection. Perform analysis of acquisition program strategies and acquisition program artifacts to support major program milestone decisions. Apply extensive knowledge of program cost, schedule and performance management and challenges associated with program risk manage. Apply knowledge of product development activities such a system design, life cycle cost estimating, integrate logistics support. Utilize program management experience to advise program managers and program offices on the executability of program plans, and acquisition review schedules. Ensure that all Acquisition Programs are planned and executed within the context of the Federal Acquisition Regulations (FAR). Prepare for and respond to Government Accountability Office (GAO) and Inspector General (IG) Audit requests and queries. Prepare input for Congressional hearings and other legislative interactions regarding program development efforts and pathway-specific issues. Establish and maintain effective working relationships with staff members and managers to gain their support for program planning and coordination activities. Guiding processes refinement through implementation of the JRIMS process to reduce organizational impacts and increase department benefit.\n\nCertifications and Level:\nFederal Acquisition Certification Program/Project Manager Level 3\nFederal Acquisition Institute Contracting Officer Representative Certification Level 3", "location": "Washington DC, DC   20001 United States", "title": "Component Acquisition Executive Planning and Governance Professional", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Joel Lukens", "positions": [{"posId": 897581850, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Guide national level Acquisition Programs through the DHS requirements validation and acquisition governance processes. Work directly with program managers and the DHS Joint Requirements Council to ensure critical thinking and program planning processes are efficiently and effectively completed. Work experience in acquisition strategy and acquisition plan development. Apply practical knowledge of product development/acquisition, from initial gap analysis and identification to creation of operational requirements generation to industry solicitation to final solution selection. Perform analysis of acquisition program strategies and acquisition program artifacts to support major program milestone decisions. Apply extensive knowledge of program cost, schedule and performance management and challenges associated with program risk manage. Apply knowledge of product development activities such a system design, life cycle cost estimating, integrate logistics support. Utilize program management experience to advise program managers and program offices on the executability of program plans, and acquisition review schedules. Ensure that all Acquisition Programs are planned and executed within the context of the Federal Acquisition Regulations (FAR). Prepare for and respond to Government Accountability Office (GAO) and Inspector General (IG) Audit requests and queries. Prepare input for Congressional hearings and other legislative interactions regarding program development efforts and pathway-specific issues. Establish and maintain effective working relationships with staff members and managers to gain their support for program planning and coordination activities. Guiding processes refinement through implementation of the JRIMS process to reduce organizational impacts and increase department benefit.\n\nCertifications and Level:\nFederal Acquisition Certification Program/Project Manager Level 3\nFederal Acquisition Institute Contracting Officer Representative Certification Level 3", "location": "Washington DC, DC   20001 United States", "title": "Component Acquisition Executive Planning and Governance Professional", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 199125365, "new": false, "current": true, "companyName": "US Department of Homeland Security/ICE", "description": "Responsible for directing and leading the collection of performance metrics of a national programâ\u0080\u0099s IT portfolio. Responsible for directing the preparation of analysis summaries and briefs for senior management regarding the business health of the portfolio this national program relies on to meet its national mission. Information analyzed includes: planned life cycle cost estimates, actual costs when available, changes in future year plans and how they will impact cost, schedule and performance of the programs. Direct the execution of the acquisition governance program for a national program working closely with the Component Acquisition Executive and his office to ensure compliance with DHS guidelines and procedures. Developed and manage the process used to validate potential new requirements increasing the visibility of IT procurements and proposals requiring acquisition program management oversight and management. Responsible for directing and leading assistance to successfully complete the requirements of the DHS Acquisition Program Management processes for program approval to proceed. Responsible for leading our outreach effort to our internal and external stakeholders in an effort to effectively share critical information required in all acquisition management and procurement processes. Responsible for directing and leading program support in the development of their budget and future cost estimation efforts, market research and procurement planning. Strive to understand managementâ\u0080\u0099s priorities, goals and objectives to better meet the mission needs as defined. Encourage self-improvement of personnel through training, education and certifications enabling the office to perform our mission.\nCertifications and Level: \nFederal Acquisition Certification Program/Project Manager Level 3\nFederal Acquisition Institute Contracting Officer Representative Certification Level 3", "title": "Program Management Analyst", "startedOn": {"month": 9, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 377178876, "new": false, "current": false, "endedOn": {"month": 9, "year": 2009}, "companyName": "US Department of Homeland Security/FEMA", "description": "Managed the delivery of Logistics Services during emergency operations including: Internal Communications (telephone, network connections, etc.), Food Services, Medical Services, and Lodging for the deployed responders. Each service included plans to support transition into continuity of operations should it be required to respond to a natural or man-made disasters. Participated in and participated in the planning of emergency response exercises within and in joint operations with other DHS components. Participated in the planning, implementing, and administering during the preparations for potential natural or man-made disasters. This included the preparations and execution of contingency plans for the 2008 Presidential Inauguration. Deployed to multiple disaster Joint Field Offices (JFO) concentrating on communications requirements and structure required to facilitate FEMA and our joint partner operation. Lead and participated in the set-up of Disaster Recovery Center (DRC) communications network using voice and data connectivity from a FEMA Mobile Disaster Recovery Center (MDRC). Oversaw the establishment of the first four Base Camps using the FEMA Base Camp contracts requiring extensive coordination with property managers, contractors, and FEMA Hq Logistics Management Division. FEMA First Responder camp establishment required coordination for compliance with environmental, historic preservation, and hazardous item regulation management. Assisted in the establishment of a National Logistics Staging Area (NLSA) and the essential services functions required for effective long term operations. Developed emergency action plans accounting for evacuation requirements and task requirements to ensure operational safety requirements were met. Briefed senior level managers on program status, risks, and feasibility based on known plans and limitations.", "location": "Washington, DC", "title": "Logistic Management Specialist Supervisory", "startedOn": {"month": 5, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 377180192, "new": false, "current": false, "endedOn": {"month": 9, "year": 2007}, "companyName": "U.S. Air Force", "description": "Pararescue mission area program manager and adviser to the commandâ\u0080\u0099s senior leadership relating to requirements and capabilities. Provided authoritative advice relating to the complex issues relating to rescue operations, emergency management and response to natural and man made disasters. Directed and coordinated collection of metrics then provided analysis of requirements to guide program with several geographically separated operating locations and global reach. Directed strategic planning for future operational requirements, managed manpower assignment levels, authorized equipment and mobilization programs. Built and maintained collaborative relationships with internal and external partners to ensure comprehensive policy development and compliance relating to; operations planning, requirement identification and validation of equipment, communications, information technologies and manpower management. Directed developed training standards and policy for special operations operators relating to parachuting and sub-surface diving operations. Directed manpower requirement studies based on operational needs. Directed the review and ensured emergency response guidance and programs complied with policy. Directed and validated the collection and analysis of information following operations and operational training with specific emphasis on best practices, equipment suitability and capability gaps. Directed development of requirements for mission area technologies, training programs, and standardized logistics packages to meet the requirement. Led the development of new communications and information technology for use during emergency response. Integrated Project Team member in development through fielding of a web based software package which provided an automated worldwide inventory management tool. Directed and oversaw the development of operational requirement metrics, and detailed operational deployment duty task lists for evaluation by manpower specialist. ", "title": "AFSOC Pararescue Functional Area Manager", "startedOn": {"month": 6, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:157235"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Joel", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/joel-lukens-77225737", "location": "Washington D.C. Metro Area"}