{"lastName": "Penn", "objectUrn": "urn:li:member:219029211", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"school": "urn:li:fs_salesSchool:17883", "schoolName": "National University", "eduId": 240526789}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAA0OHtsBANCrAbPSH-LV-J0hXjrYHv2io9o,NAME_SEARCH,undefined)", "numOfConnections": 139, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEf69OTqlZl-w/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=mq_WQh4-hzwTK1rD5vc7EI7wVNCtn-lSAA4QuE206KI", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEf69OTqlZl-w/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=fBqyVmL9WRxKr4xRgXnffheDHyr5DrxqKRUxIm1GkMA", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEf69OTqlZl-w/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=KeYc18qFLup0h-ASB6DtsisBQpDZSJlnZLp4f35WLaQ", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQEf69OTqlZl-w/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=ZHdON4nwvdL5f7T68NsL-xnmqR5_13m456TrFMG6l1k", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Department of Homeland Security", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "I have 12 years of military experience and 8 years of law enforcement experience. The strengths and qualities I have acquired over the years include strong leadership, counseling, and solving problems within tight deadlines. I have served a combat deployment as a Field Artillery soldier in Iraq and have gained valuable experience in working in a high-stress environment. I have developed great interpersonal communication, conflict resolution skills, and unique correctional experience while working for Bureau of Prisons as a Senior Officer.\n\nI am highly interested in pursuing a career in investigative work in law enforcement.", "pendingInvitation": false, "defaultPosition": {"posId": 794099681, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "--Provide support and perform the following segments of work related to immigration investigation, custody, identification and location, arrest, prosecution and deportation\n--Assist with the apprehension of individuals that are accused of violating immigration or related laws\n--Assist with preparing investigative reports in sufficient detail and accuracy to support possible prosecution and/or administrative action\n--Perform law enforcement support duties such as taking fingerprints and photographs\n--Conduct routine interviews; using various law enforcement methods and techniques (e.g., observation, interviews, document inspection, data analysis, etc.) to respond to a variety of immigration inquiries and complaints\n--Document, transport, deport, and/or escort criminal and non-criminal aliens under the guidance of a more senior officer. Initiate both criminal and civil prosecutions and deport aliens to foreign countries as well as performing various aspects of custodial operations related to civil immigration enforcement.", "title": "Deportation Officer", "startedOn": {"month": 4, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Lucas Penn", "positions": [{"posId": 794099681, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "--Provide support and perform the following segments of work related to immigration investigation, custody, identification and location, arrest, prosecution and deportation\n--Assist with the apprehension of individuals that are accused of violating immigration or related laws\n--Assist with preparing investigative reports in sufficient detail and accuracy to support possible prosecution and/or administrative action\n--Perform law enforcement support duties such as taking fingerprints and photographs\n--Conduct routine interviews; using various law enforcement methods and techniques (e.g., observation, interviews, document inspection, data analysis, etc.) to respond to a variety of immigration inquiries and complaints\n--Document, transport, deport, and/or escort criminal and non-criminal aliens under the guidance of a more senior officer. Initiate both criminal and civil prosecutions and deport aliens to foreign countries as well as performing various aspects of custodial operations related to civil immigration enforcement.", "title": "Deportation Officer", "startedOn": {"month": 4, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 341726864, "new": false, "current": true, "companyName": "CAARNG 40th MP Company", "description": "-Provide law enforcement operations within the Federal/military jurisdiction as ordered. \n-Execute civil disturbance and riot control missions as needed; maintain order and protect life and property. \n-Set-up and operate detainee internment camps. \n-Arrest and detain suspects. \n-Standby for emergency disaster and nuclear situations as Quick Reaction Force for Southern California region. \n-Train and operate with local Federal, State and/or Local law enforcement agencies. \n-Responsible for performance evaluation of teams during training exercises and qualifications. \n-Supervise team during daily tasks and drills for law and order operations. \n-Receive orders from immediate supervisors and implement military standards and training doctrines to teams. \n-Ensure that tasks were initiated and executed per standards given and completed withing tight deadlines. \n-Develop training plans and teach in classroom, field and operational settings.\n-Mitigate risk by developing a safety matrix and management system; implement in training.\n-Conduct mission plans by following a set of troop leading procedures and steps that allow higher mission success.\n\nOperation Enduring Freedom Guantanamo Bay Deployment\n\n-Conduct detainee operations on a daily basis with high security detainees\n-Execute orders according to Standard Operating Procedures from higher command\n-Command and supervise 4-13 soldiers during correctional/detainee, external security force or any operations in support of Operations.\n-Screen and/or search areas of operations for contrabands\n-Screen and/or search areas of operations for unauthorized personnel, escapees, threats or suspicious activities\n-Write detailed reports on daily or serious incident reports for higher.", "location": "Bell, California", "title": "Military Police Sergeant", "startedOn": {"month": 8, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1226"}, {"posId": 584641287, "new": false, "current": false, "endedOn": {"month": 4, "year": 2016}, "companyName": "Federal Bureau of Prisons", "description": "-Provide supervision of inmate population. \n-Insure safety of public by maintaining security of institution. \n-Work different posts or jobs that may involve escorting inmates, supervising visitation with the public, guarding the perimeter of the institution while armed, and/or providing internal security. \n-Supervised inmates utilizing command presence, voice and orders to inmate population to abide by strict rules and standards; being accountable and aware of equipment and personnel. \n-Address needs of inmates and provide solutions to problems within the unit inside the institution.\n-Respond to emergencies and utilize radio or telephone to communicate to control the status of emergencies or situations.\n-Prepares and drafts incident reports, daily reports and inventory while adhering to Bureau of Prisons policies, guidelines and regulations. \n-Become familiar with Federal policy, laws and operations of institutions.\n-Insure that strict rules, regulations, policies and laws are followed by supervising inmates on a routine basis throughout the shift.\n-Maintain situational awareness, identify and gather intel on prison gangs, gang members, unauthorized activity, and report to appropriate supervisor.\n-Train and maintain qualification on lethal and non-lethal weapons\n", "title": "Senior Correctional Officer", "startedOn": {"month": 6, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:12787"}, {"posId": 438179656, "new": false, "current": false, "endedOn": {"month": 5, "year": 2014}, "companyName": "Allied Barton", "description": "Secure premises by denying or allowing access to authorized personnel on the Boeing site. \n-Protect and insure the safety of Boeing employees. \n-Protect proprietary and export material from unauthorized access. \n-Work inside highly classified areas performing locks and unlocks of doors. \n-Provide customer service in building lobbies. \n-Verify employee clearances and issue sensitive access items according to the Proper Operating Procedures.\n-Insure that Boeing employees, visitors and security personnel are complying with export laws and identify foreign visitors who may be in breach of security protocols suchs as: wrong or no security clearance, does not meet 'need-to-know' policy, unauthorized area access, and foreign visitors.", "location": "El Segundo, Ca", "title": "Security Officer", "startedOn": {"month": 5, "year": 2013}}, {"posId": 438179114, "new": false, "current": false, "endedOn": {"month": 8, "year": 2011}, "companyName": "US Army", "description": "-Conduct law enforcement patrols on federal/military installations and enforcing UCMJ laws. \n-Protect and insure safety of soldiers and civilians who are on federal installations. \n-Execute riot control measures during civil disturbance situations. \n-Control traffic and security. Perform non-lethal measures on combative subjects. \n-Utilize radio communication to provide situation awareness to leadership. \n-Train on combat first aid for wounded subjects and victims.\n\n-Secured Top Secret areas and conduct surveillance within premises. \n-Screen visitors through Joint Personnel Adjudication System. \n-Searched individual belongings and seized unauthorized material or equipment. \n-Prepare security documents and routine reports within strict standard operating procedures. \n\n\nTrain in:\n\nBasic warrior skills and use of firearms\nMilitary/civil laws and jurisdiction\nInvestigating and collecting evidence\nTraffic and crowd control\nArrest and restraint of suspects", "location": "Joint Based Lewis-McChord", "title": "Military Police", "startedOn": {"month": 10, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 438178924, "new": false, "current": false, "endedOn": {"month": 10, "year": 2008}, "companyName": "US Army", "description": "-Integral member of a crew that operates high technology cannon artillery weapon systems. \n-Loads and fires howitzers. \n-Employs rifles, machine guns, and grenade and rocket launchers in offensive and defensive operations. -Drives and operates heavy and light wheeled trucks and tracked vehicles. \n-Participated in reconnaissance operations to include security operations and position preparation. \n-Operates in reduced visibility environments with infrared and starlight enhancing night vision devices and other equipment. \n-Communicates using voice and digital wire and radio equipment. \n-Uses critical combat survival skills to operate in a hostile environment. \n-Maintains operational readiness of vehicles and equipment. \n\nUnit Armorer:\n\nDuties:\n\n-Receive, inspect, and maintain inventory of all sensitive items to include: weapon systems, aiming devices, lasers, heavy machineguns, night vision goggles, etc. \n-Insure physical security of the Arms Room is met according to the standards of the US Army Physical Security Program. \n-Update and maintain records on weapon status. \n-Responsible for accountability of items daily.", "location": "Vilseck, Germany", "title": "Cannon Crewmember", "startedOn": {"month": 9, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:1223"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Lucas", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/lucas-penn-02342961", "location": "Stockton, California"}