{"pendingInvitation": false, "defaultPosition": {"posId": 415690777, "new": false, "current": true, "companyName": "US Immigration and Customs Enforcement", "description": "As a Deportation Officer, I have conducted legal research to support decisions on deportation/exclusion cases and assisted Assistant U.S. Attorneys in representing the Government in court actions. I have worked with other Federal, state and local law enforcement officials to identify locate and/or apprehend aliens. I have prepared, presented and defended deportation or exclusion proceedings. During the deportation process I have had to prepare documents for and interact with government officials and consulates of countries from around the world. I have ensured the physical removal of aliens from the United States. I have worked with both criminal and/or non-criminal aliens in the United Sates at various stages of their deportation/exclusion proceedings. This has included applying a variety of investigative techniques, analyzing evidence, preparing reports, arranging for the detention or release of individuals. My assignments usually involve complex deportation proceedings and/or difficult or sensitive cases. I have also served as secondary Juvenile Coordinator. In the absence of the coordinator I have handled all aspects of juvenile deportation cases, including both local and out of town placements as well as releases and situations such as juvenile escapes.  \n\nAs member of the Violent Criminal Alien Section I have conducted extensive investigations in order to locate at large criminal aliens in the local communities.  I have conducted research using Law Enforcement data bases as well as open source information.  I have conducted surveillance and executed arrest warrants.", "title": "Deportation Officer", "startedOn": {"month": 1, "year": 2006}}, "objectUrn": "urn:li:member:268652660", "contactInfo": {}, "crmStatus": {"imported": false}, "degree": -1, "fullName": "", "industry": "Government Administration", "positions": [{"posId": 415690777, "new": false, "current": true, "companyName": "US Immigration and Customs Enforcement", "description": "As a Deportation Officer, I have conducted legal research to support decisions on deportation/exclusion cases and assisted Assistant U.S. Attorneys in representing the Government in court actions. I have worked with other Federal, state and local law enforcement officials to identify locate and/or apprehend aliens. I have prepared, presented and defended deportation or exclusion proceedings. During the deportation process I have had to prepare documents for and interact with government officials and consulates of countries from around the world. I have ensured the physical removal of aliens from the United States. I have worked with both criminal and/or non-criminal aliens in the United Sates at various stages of their deportation/exclusion proceedings. This has included applying a variety of investigative techniques, analyzing evidence, preparing reports, arranging for the detention or release of individuals. My assignments usually involve complex deportation proceedings and/or difficult or sensitive cases. I have also served as secondary Juvenile Coordinator. In the absence of the coordinator I have handled all aspects of juvenile deportation cases, including both local and out of town placements as well as releases and situations such as juvenile escapes.  \n\nAs member of the Violent Criminal Alien Section I have conducted extensive investigations in order to locate at large criminal aliens in the local communities.  I have conducted research using Law Enforcement data bases as well as open source information.  I have conducted surveillance and executed arrest warrants.", "title": "Deportation Officer", "startedOn": {"month": 1, "year": 2006}}, {"posId": 490016254, "new": false, "current": false, "endedOn": {"month": 9, "year": 2011}, "companyName": "Immigration and Customs Enforcement, National Council 118, AFGE", "description": "I served on the executive board of the National Union Council, representing the employees of Immigration and Customs Enforcement.  I served in a full time capacity splitting my time between working at home and traveling nationwide, which included a great deal of time in Washington D.C..  I participated in National level contract and policy negotiations with ICE and Homeland Security Management.  Some of my duties included meetings with Congressmen and Senators in order to express the Unions interests in policy and legislation.\n\nSome of my duties included reading and analyzing policy to interpret impact on employees, I also wrote contract language and proposals, was well as read and interpreted contract proposals made by managers.  I participated in active negotiations with high level managers including the heat of the Agency and Assistant Secretary of Immigration and Customs Enforcement and his staff.", "title": "National Vice President", "startedOn": {"month": 4, "year": 2009}}, {"posId": 415691225, "new": false, "current": false, "endedOn": {"month": 1, "year": 2007}, "companyName": "US Customs and Border Protection", "description": "As a Supervisory Border Patrol Agent I am responsible for the execution of all station functions and operations. As such, I direct activities aimed at preventing the illegal entry of aliens into the United States by land and water in urban and rural areas; seeking out and apprehending aliens who are illegally in the United States; apprehending smugglers or aliens; and enforcing the criminal provisions of the Immigration and Nationality laws. Additionally, I am responsible for all normal functions involved in supervising personnel, including the approval of leave, resolving disciplinary problems, and preparing annual performance appraisals. \n\nMy supervisory duties have included creating schedules, mustering agents, and managing field operations. As a supervisor I have managed pursuits and significant incidents as well as completed all the necessary paperwork for submission through the chain of command. I gained experience in resolving labor/management relations problems. I have also had experience in dealing with problems between agents as well as complaints from the public. As a Supervisor I have reviewed Agents casework for completeness and suggested corrections when necessary. Day to day paperwork includes creating A-files, reinstatement of Deportation and or Removal, I-44's, G-166's and I-213. These cases require my signature for approval before being submitted. \n\nI also have experience in fleet management, including the use of purchase orders for repairs and retrofitting. I have held a government purchase card for purchasing unit equipment and supplies.\n\nI am a certified Border Patrol recruiter. I have traveled extensively for recruiting events and am comfortable with public speaking, from small classroom settings to large auditoriums. As a Canine Handler also did recruiting and anti-drug presentations. I have spoken to groups ranging in age from young school children to adult organizations.", "title": "Border Patrol Agent", "startedOn": {"month": 9, "year": 1994}}, {"posId": 490007951, "new": false, "current": false, "endedOn": {"month": 9, "year": 1994}, "companyName": "Blazer Financial Services", "description": "Blazer Financial Services specialized in small loans ranging from $100 to $10,000.  As a Loan Officers I sought out new customers, conducted credit checks and completed the application process with customers.  I then submitted the package to the loan manager for a decision.  Upon successful completion I would complete the loan process and close the loan.  On the Collections Officer side of the duties I was responsible for collecting delinquent loans.  This included skip tracing, field visits to residences and business and even collections of secured merchandise.  I was in the manager training program, and towards the end of my tenure I was making decisions on smaller loans.", "title": "Loan / Collections Officer", "startedOn": {"month": 6, "year": 1992}}], "educations": [{"endedOn": {"year": 2013}, "fieldsOfStudy": ["Project Management"], "degree": "Master of Business Administration (M.B.A.)", "schoolName": "Grantham University", "startedOn": {"year": 2008}, "eduId": 167299613}, {"endedOn": {"year": 1992}, "fieldsOfStudy": ["Economics"], "school": "urn:li:fs_salesSchool:19527", "degree": "Bachelor of Business Administration (B.B.A.)", "schoolName": "The University of Texas-Pan American", "startedOn": {"year": 1988}, "eduId": 167299490}], "pictureInfo": {}, "inmailRestriction": "NO_RESTRICTION", "savedLead": false, "unlocked": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "entityUrn": "urn:li:fs_salesProfile:(ACwAABADUHQB-wZNOQdvhTLMGQv-ot_IwuBII4I,NAME_SEARCH,undefined)", "numOfConnections": 61, "flagshipProfileUrl": "https://www.linkedin.com/in/patrick-murray-358b7a75", "location": "Enumclaw, Washington", "showTotalConnectionsPage": false, "headline": "Deportation Officer at US Immigration and Customs Enforcement", "profileUnlockInfo": {"showProfileUnlock": false}}