{"lastName": "Larrimore", "objectUrn": "urn:li:member:131741384", "contactInfo": {"socialHandles": [{"name": "davidlarrimore", "type": "TWITTER", "dataSource": "LINKEDIN"}]}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2005}, "fieldsOfStudy": ["Art"], "school": "urn:li:fs_salesSchool:18556", "degree": "Bachelors", "schoolName": "Salisbury University", "startedOn": {"year": 2001}, "eduId": 76676316}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAfaNsgBYTGyQ8EBW6yZ7mcYODY1Why72Sg,NAME_SEARCH,undefined)", "numOfConnections": 833, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGAoFHbZFtV-A/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=Qjxr_i-9oarUIRhtMu4CwtTzk1bRFLjLvE9YnwsWNM4", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGAoFHbZFtV-A/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=Oa-SmS8hFY2uOFb5JFGTbCj_rpQp6rbpng6hFnB1Iz4", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGAoFHbZFtV-A/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=9QuZofxGQidhlMN2Lswet9ZVjs5j7tfwFRhPZFu0x_Q", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGAoFHbZFtV-A/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=T7pN819NEnGrOOKPcubg7ethpoZ8LtHyFfy6Aa9SIKA", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "CTO @ DHS/ICE , IT Transformation Evangelist, and Technologist.", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Dave Larrimore is the Chief Technology Officer (CTO) for the Immigrations and Customs Enforcement (ICE) component of the Department of Homeland Security (DHS). He wonâ\u0080\u0099t lie to you, he is pretty proud that every day he gets to do what he loves for an organization that has a phenomenal mission. \n\nWith over 10 years of experience in federal IT, Dave is literally bursting at the seams with creativity, innovation, and a positive attitude. Each day brings a new challenge, and each day brings a new opportunity to drive how ICE manages and delivers technology forward.\n\nDave has an extremely diverse background ranging from Cloud Strategy at the U.S. Department of Agriculture (USDA), Data Analytics and Digital Services at the General Services Administration (GSA), and of course IT Operations at Aspex Inc. and the Kennedy Krieger Institute (KKI).\n\nItâ\u0080\u0099s hard to believe that Dave attributes much his ability to constantly drive IT transformation on his Bachelor of Arts degree in Visual Communication from Salisbury University. \n\nâ\u0080\u009cComputers and Technology are binary. They run on yes or no, on or off, true or false, or 1 or 0. But as an artist, we know that binary is merely a medium and the canvas is not paper, but how people get things done. â\u0080\u009d ~ David Larrimore\n\nYou can find Dave in DC, trying to help grow and foster the federal community of IT professionals that help drive this great nation. \n\nHe isnâ\u0080\u0099t shy, so feel free to reach out.\n", "pendingInvitation": false, "defaultPosition": {"posId": 863206530, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As the Chief Technology Officer and director of the Technology Transformation Office (TTO), I have the honor of helping to drive the next generation of IT for Immigration and Customs Enforcement vast portfolio of mission systems. ", "title": "Chief Technology Officer", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "David Larrimore", "positions": [{"posId": 863206530, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As the Chief Technology Officer and director of the Technology Transformation Office (TTO), I have the honor of helping to drive the next generation of IT for Immigration and Customs Enforcement vast portfolio of mission systems. ", "title": "Chief Technology Officer", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 863208189, "new": false, "current": false, "endedOn": {"month": 10, "year": 2016}, "companyName": "USDA", "title": "Cloud Strategist", "startedOn": {"month": 5, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:4746"}, {"posId": 789586331, "new": false, "current": false, "endedOn": {"month": 5, "year": 2016}, "companyName": "General Services Administration", "description": "â\u0080¢ Served as a Product Owner leading a multidisciplinary team to quickly plan and implement end- to-end acquisition portal MVP for partner Agencies.\n\nâ\u0080¢ Served as a Product Owner of internal process improvement project that consolidated 3 legacy systems and created an inter-departmental working group increasing communication, collaboration, and knowledge transfer.\n\nâ\u0080¢ Responsible for developing product vision and roadmaps, along with managing product backlog items.\n\nâ\u0080¢ Coached peers on scrum development methodologies, continuous process improvement, and quality software management.\n\nâ\u0080¢ Provided subject matter expertise in the areas of Cloud migration, agile software development, data warehousing, and analytics. ", "title": "IT Project Manager", "startedOn": {"month": 10, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:5353"}, {"posId": 694925547, "new": false, "current": false, "endedOn": {"month": 10, "year": 2015}, "companyName": "General Services Administration", "description": "â\u0080¢ Supervised team of Government scrum masters as well as managed numerous teams of      contractors in delivering digital services and data management projects for the General Services Administration.\n\nâ\u0080¢ Planned and implemented migration of all division projects from waterfall to agile project management (Scrum & Kanban) and the Scaled Agile Framework (SAFe) methodologies; successfully decreasing time to delivery by 50%, as well as decreased management overhead costs on all Agile projects by over 15%.\n\nâ\u0080¢ Developed, implemented, and managed cloud automation governance model to support cloud based agile testing and automation services.\n\nâ\u0080¢ Provided support for managing contractors, contract related actions, as well as acquisition and funds management.\n\nâ\u0080¢ Managed multi-million dollar budget for executing IT initiatives to support multiple stakeholders groups ranging from program offices to GSA leadership.", "title": "Branch Chief", "startedOn": {"month": 9, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:5353"}, {"posId": 282614974, "new": false, "current": false, "endedOn": {"month": 9, "year": 2013}, "companyName": "GSA", "description": "As an IT Project Manager, at the General Services Administration (GSA), I supported several key technology initiatives. After completing several successful projects, I earned an opportunity to lead the development and management of the Federal Acquisition Service (FAS) enterprise data warehousing as well a serve as an agency data management SME.\n\nâ\u0080¢ Managed contractor relationships and worked with industry partners to advance innovation within the Agency through agile software development practices and leveraging open source technologies.\n\nâ\u0080¢ Lead and supported multiple enterprise-wide data management and analytic initiatives. Stewarded the use of an enterprise-wide data dictionary that now serves as the primer for new systems and data initiatives.\n\nâ\u0080¢ Served as a business partner, working with customers to define long-term roadmaps. These roadmaps became the basis for many customer groups IT budgeting and planning.\n\nâ\u0080¢ Worked with customers and user communities to foster the use of enterprise capabilities throughout the organization. These activities helped identify a requirements overlap that saved over $150,000 in development costs alone.\n\nâ\u0080¢ Managed multiple technology platforms, including; Business Objects XIR4, Pentaho Kettle, MicroStrategy, Drupal, PHP, Oracle (Pl/SQL), Sybase IQ, and MySQL.", "location": "Crystal City, VA", "title": "Project Manager", "startedOn": {"month": 8, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:5353"}, {"posId": 202770094, "new": false, "current": false, "endedOn": {"month": 8, "year": 2011}, "companyName": "US Department of Homeland Security", "description": "As a Program Analyst working under the Chief Financial Officer (CFO) of the Department of Homeland Security (DHS) I have been involved in several programs ranging from small financial applications to Category 1 Acquisitions.\n\nâ\u0080¢ Aligning all milestones and schedules with DHS Acquisition, Systems Engineering Life Cycle (SELC), and Enterprise Architecture (EA) processes and presenting them to program leadership.\nâ\u0080¢ Authoring and coordinating program documentation such as the Test and Evaluation Master Plan (TEMP) and Configuration Management Plan (CM).\nâ\u0080¢ Managing the Test and Evaluation (T&E) of the program, including: coordinating with internal and external groups, establishing and leading a T&E Working Group (WG), authoring T&E documentation, planning the T&E IMS, and reporting up to management on T&E strategy and status.\nâ\u0080¢ Authoring and coordinating Acquisition documentation such as Performance Work Statements (PWS) and Rough order of Magnitude (ROM) requests.\nâ\u0080¢ Creating Life Cycle Cost Estimates (LCCE) for information technology (IT) environments.\nâ\u0080¢ Researching and providing subject matter expertise (SME) on proposed software licenses.\nâ\u0080¢ Working with DHS Components, to gather mission requirements.\nâ\u0080¢ Managing the Federal Law Enforcement Training Center (FLETC) financial system integration project, including: coordinating with internal and external groups, creating an integrated master schedule (IMS), leading meetings, and reporting up to management on the status of the project.\n\nMajor Accomplishments\nâ\u0080¢ Completing the TASC TEMP (2011)\nâ\u0080¢ Establishing relationship with Health and Human Services (HSS) and coordinating the free transfer of integration code saving FLETC over $300,000 in developments costs (2010)\nâ\u0080¢ Completing the FLETC financial system integration project IMS (2010)\nâ\u0080¢ Completing disposition of DHS Component requirements for ETS2 Acquisition (2009)", "title": "Program Analyst", "startedOn": {"month": 9, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 202829008, "new": false, "current": false, "endedOn": {"month": 9, "year": 2009}, "companyName": "Aspex inc.", "description": "As the lead software engineer, I supported the migration, certification & accreditation (C&A), and operations and maintenance (O&M) of the DHS CFOâ\u0080\u0099s Treasury Information Executive Repository (DHSTIER). My responsibilities included:\n\nâ\u0080¢ Migrating DHSTIER application from a Treasury data center to DHS Data Center 1 (DC1).\nâ\u0080¢ Serving as the contractor implementation manager for the project; authoring change requests with all supporting documentation, vetting change requests through all required channels, and presenting the change requests to the DHS infrastructure change control board (ICCB) for approval.\nâ\u0080¢ Coordinating with DHS OCIO groups such as security, engineering, enterprise architecture, and 508 compliance (Accessibility).\nâ\u0080¢ Establishing and managing software and documentation configuration management (CM).\nâ\u0080¢ Hardening all environments to meet DHS security requirements outlined in the DHS 4300a: DHS Sensitive Systems Policy Directive. \nâ\u0080¢ Developing and providing O&M support for entire application, including; software development, systems administration, database administration, auditing, testing and evaluation (T&E), and CM.\nâ\u0080¢ Providing tier 2 and 3 help desk support.\nâ\u0080¢ Authoring technical documentation including, requirements documents, design documents, test plans, test cases, and O&M manuals.\n\nMajor Accomplishments\nâ\u0080¢ Resolved all compliance deficiencies making DHSTIER section 508 compliant (2009)\nâ\u0080¢ Designed and deployed reports engine that drastically improved overall performance and functionality (2009)\nâ\u0080¢ Completed DHSTIER operations manual (2009)\nâ\u0080¢ Successfully migrated DHSTIER application from a Treasury Data Center to DC1 (2008)", "title": "Software Engineer", "startedOn": {"month": 8, "year": 2008}}, {"posId": 202830763, "new": false, "current": false, "endedOn": {"month": 8, "year": 2008}, "companyName": "Kennedy Krieger Institute", "description": "As a Database Engineer for the Kennedy Krieger Institute (KKI) I supported all database related research & development (R&D), support, administration, licensing, and operations & maintenance (O&M). My responsibilities included:\nâ\u0080¢ Researching, documenting, proposing, and implementing database upgrade/migration strategy that incorporated Institute availability and capacity goals.\nâ\u0080¢ Migrating and upgrading Oracle databases.\nâ\u0080¢ Researching, testing, and documenting alternative developer tools.\nâ\u0080¢ Performing database administration, monitoring, and auditing on all Oracle Databases.\nâ\u0080¢ Providing Oracle 10g subject matter expertise (SME).\nâ\u0080¢ Researching, documenting, and proposing Oracle licensing to executive leadership.\n\nMajor Accomplishments\nâ\u0080¢ Saving Kennedy Krieger Institute over 70% in Oracle technology licensing by coordinating the use of Volume Licensing Agreements (VLA) from partner Institutions. (2008)", "title": "Database Administrator", "startedOn": {"month": 3, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:19385"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "David", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/davidlarrimore", "location": "Washington D.C. Metro Area"}