{"lastName": "Bui", "objectUrn": "urn:li:member:88822662", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Practice", "educations": [{"endedOn": {"year": 2011}, "school": "urn:li:fs_salesSchool:18057", "degree": "JD", "schoolName": "University of the District of Columbia - The David A. Clarke School of Law", "startedOn": {"year": 2008}, "eduId": 56362258}, {"endedOn": {"year": 2010}, "fieldsOfStudy": ["International Law Program at Peking University"], "school": "urn:li:fs_salesSchool:11287", "schoolName": "å\u008c\u0097äº¬å¤§å­¦", "startedOn": {"year": 2010}, "eduId": 56364716}, {"endedOn": {"year": 2008}, "fieldsOfStudy": ["Criminology, Law & Society / Psychology, Social Behavior"], "school": "urn:li:fs_salesSchool:17947", "degree": "BA", "schoolName": "University of California, Irvine", "startedOn": {"year": 2004}, "eduId": 56362628}, {"endedOn": {"year": 2006}, "fieldsOfStudy": ["Creative Writing, Digital Photography/Videography"], "school": "urn:li:fs_salesSchool:12726", "schoolName": "University of Sussex", "startedOn": {"year": 2006}, "eduId": 56364715}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAVLU4YBxoEIdsBGye8d_0VG669QO7fszIE,NAME_SEARCH,undefined)", "numOfConnections": 1350, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEZo7BPGf3b1A/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=LrZNqdcF7gnGjt4yLNdbidd9sLvmrk6__WkkVS_rj28", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEZo7BPGf3b1A/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=s6WDISRsB35iji3o3nKH1PXICkpU-Q3mjD4UKsKD9SU", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEZo7BPGf3b1A/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=tEM9dzuUMPR9YvF7sNG0jMUd7rdKyYVjeYH4WIXExWs", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEZo7BPGf3b1A/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=DrxCdHg0NJzVJXjtODzOVZa9EyhNJOxp-_CqRpgcDlo", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Associate Legal Advisor at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Christina is a 2008 graduate from UCI's School of Social Ecology, with a double major in Criminology, Law and Society, and Psychology, Social Behavior.  Having participated in the summer UCDC program, she fell in love with Washington, D.C. and moved out here 2 months after graduation for law school. Her Federal career started as a Presidential Management Fellow, Class of 2011 with the U.S. Department of the Interior, Office of Civil Rights.  Since then, she has also worked with the (1) Department of Justice, Civil Rights Division, Disability Rights Section; (2) the Department of the Interior's Office of Hearing and Appeals, Interior Board of Land Appeals; and (3) the Department of the Interior's Office of the Solicitor, Employment and Labor Law Division.  In 2016, she was selected as a 2016 NextGen Public Service Award Honoree.  She is currently an Associate Legal Advisor with the Labor and Employment Law Division, Office of the Principal Legal Advisor, U.S. Immigration and Customs Enforcement, the Vice President of the UCI Alumni Association - DC Chapter, and a sitting board member of the All UC Alumni Advisory Board.  ", "pendingInvitation": false, "defaultPosition": {"posId": 1200394373, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "This attorney position is located in the Department of Homeland Security (DHS), Immigration and Customs Enforcement (ICE), Office of the Principal Legal Advisor (OPLA), Labor and Employment Law Division (LELD), litigation team, in Washington, D.C.\n\nMy Duties: \n\n- Provide assistance and support to ICE program offices on Federal labor and employment law issues, including matters involving Title VII of the Civil Rights Act of 1964, Family Medical Leave Act, Rehabilitation Act, the Federal Services Labor Management Relations Statute, the Age Discrimination in Employment Act, the Whistleblower Protection Act, and the Uniformed Services Employment and Reemployment Rights Act\n- Serve as agency counsel in proceedings before administrative and judicial forums, including the U.S. Equal Employment Opportunity Commission (EEOC), the U.S. Merit Systems Protection Board (MSPB), and the U.S. Federal Courts", "location": "Washington D.C. Metro Area", "title": "Associate Legal Advisor, Labor and Employment Law Division", "startedOn": {"month": 1, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Christina Bui", "positions": [{"posId": 1200394373, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "This attorney position is located in the Department of Homeland Security (DHS), Immigration and Customs Enforcement (ICE), Office of the Principal Legal Advisor (OPLA), Labor and Employment Law Division (LELD), litigation team, in Washington, D.C.\n\nMy Duties: \n\n- Provide assistance and support to ICE program offices on Federal labor and employment law issues, including matters involving Title VII of the Civil Rights Act of 1964, Family Medical Leave Act, Rehabilitation Act, the Federal Services Labor Management Relations Statute, the Age Discrimination in Employment Act, the Whistleblower Protection Act, and the Uniformed Services Employment and Reemployment Rights Act\n- Serve as agency counsel in proceedings before administrative and judicial forums, including the U.S. Equal Employment Opportunity Commission (EEOC), the U.S. Merit Systems Protection Board (MSPB), and the U.S. Federal Courts", "location": "Washington D.C. Metro Area", "title": "Associate Legal Advisor, Labor and Employment Law Division", "startedOn": {"month": 1, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 995536745, "new": false, "current": false, "endedOn": {"month": 1, "year": 2018}, "companyName": "U.S. Department of the Interior", "description": "AEP is responsible for developing policy and designing, managing, and directing equal access and non-discrimination programs that promote diversity and inclusion within the Department.  Such programs facilitate the recruitment, hiring, and retention of a diverse workforce; and ensure that the diversity of the workforce is valued and respected.  AEP conducts evaluations and reviews employment policies and practices for the purpose of identifying and removing barriers to equal employment opportunity within the Department and provides recommendations to improve the Department's efforts to recruit, hire, and retain a highly skilled and diverse workforce.  \n\nMy Duties:\n\n- Managed the implementation of EEO requirements under Federal law, such as the DOI Management Directive 715  (MD-715) Plan\n- Conducted functional reviews of DOI EEO programs and other internal EEO related requirements (e.g. reasonable accommodation for individuals with disabilities, and Special Emphasis Programs (SEP)), focusing on matters such as recruitment, promotions, and achievement awards\n- Supported internal and external compliance efforts by producing surveys and standardized data collection protocols and analyzing/reporting survey results\n- Provided evaluations for Equal Opportunity (EO)-related programs and initiatives\n- Integrated numerous data sources to provide preventive risk analysis on EO issues\n- Provided technical assistance on data collection/reporting and statistical analysis\n- Initiated research on EO-related issues to support the DOI mission\n- Chaired the Agency-wide Barrier Analysis Team and served as a liaison between the DOI EEO practitioners and contract support staff \n- Represented the EEO Director and Diversity Chief Officer in the Agency-wide working group in response to OPM's call to create a strategic plan to reduce the DOI Federal workforce \n- Served as the Agency liaison for the MSPB Sexual Harassment study ", "location": "Washington D.C. Metro Area", "title": "Senior Team Lead, Affirmative Employment Program, Office of Civil Rights (Detail)", "startedOn": {"month": 2, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:15065"}, {"posId": 826059480, "new": false, "current": false, "endedOn": {"month": 1, "year": 2017}, "companyName": "U.S. Department of the Interior", "description": "The Employment and Labor Law Unit (ELLU) provides advice and counseling to managers, supervisors, and human resources staff on all employment-related issues.Â  Common issues include Equal Employment Opportunity (EEO) claims of discrimination and harassment, employee misconduct and performance issues, reasonable accommodation requests from employees with disabilities, laws governing veteran employment, and regulations involving hiring and promotions.Â ELLU also defends the Agency in litigation brought in federal courts, the Equal Employment Opportunity Commission (EEOC), and the Merit Systems Protection Board (MSPB).Â  ELLU defends against claims related to personnel issues.Â  \n\nMy Duties: \n\n- Represented the agency in hearings before the EEOC, MSPB, and civil district court, and settlement negotiations\n- Performed legal research in order to prepare analyses, arguments, briefs, and analytical documents on areas of law pertinent to ELLU\n- Drafted: pleadings, affidavits, briefs, motions, and requests for/or responses to discovery, and correspondence\n- Prepared new procedures and guides for interpretation resulting from changes in statutory law or new court decisions\n- Prepared memoranda or reports outlining the facts and legal issues, explaining the application of legal principles and precedents, and justifying recommendations or conclusions\n- Supported Departmental and Administration policy priorities through inter-office and inter-agency meetings\n", "location": "Washington D.C. Metro Area", "title": "Attorney-Advisor, Employment and Labor Law Unit, Office of the Solicitor (Detail)", "startedOn": {"month": 7, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:15065"}, {"posId": 546456292, "new": false, "current": false, "endedOn": {"month": 1, "year": 2017}, "companyName": "Department of the Interior", "description": "My Duties (in addition to EEO Specialist duties): \n\n- Conducted training at monthly Complaints Managers meetings on topics such as federal regulation updates, new case law, and proper legal analysis in Final Agency Decision\n- Provided technical assistance on EEO matters to the 8 bureaus and the Office of the Secretary within the Department of the Interior\n- Provided technical advice to the Director, Office of Civil Rights, on cases where the Office of Civil Rights and the Office of the Solicitor share/transfer jurisdiction\n- Reviewed policy for issuance of new Civil Rights Directives\n- Served as first line supervisor for summer legal interns\n- Served as Acting Chief, Employment Complaints and Adjudication Division, when the Acting Chief is out\n- Served as Project Lead on backlogged cases responsible for removing Agency-wide backlog and raising timely issuance of of FADs from less than 2% to over 77% in one fiscal year \n- Served as Project Lead on building the Employment Complaints and Adjudication Processing Google site, a comprehensive EEO resource center utilized by over 150 EEO practitioners across the Department\n- Served on a national training team dispatched across the U.S. to train EEO practitioners on Barrier Analysis Methodology ", "location": "Washington D.C. Metro Area", "title": "Team Lead, Employment Complaints and Adjudication Division", "startedOn": {"month": 5, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:15065"}, {"posId": 257667287, "new": false, "current": false, "endedOn": {"month": 12, "year": 2014}, "companyName": "Department of the Interior", "description": "The Employment Complaints & Adjudication Division within the Office of Civil Rights is responsible for adjudicating employment discrimination complaints under Title 7, ADEA, ADAAA, Rehabilitation Act, GINA, Equal Pay Act, and their amendments. \n\nI was appointed into this position through the Presidential Management Fellowship (PMF) Program (Class of 2011), which was established by Executive Order in 1977 to attract to the Federal service outstanding men and women from a variety of academic disciplines and career paths, who have a clear interest in, and commitment to, excellence in the leadership and management of public policies and programs.\n\nMy Duties: \n\n- Conducted legal sufficiency reviews of draft Procedural Dismissals\n- Drafted Final Agency Decisions (FADs): on the merits, re: compensatory damages, re: attorneys' fees\n- Drafted Agency Responses to Appeals before the Office of Federal Operations (OFO)\n- Drafted decisions on compliance\n- Drafted Agency Responses to Requests for Reconsideration\n- Answered policy questions posed by bureau practitioners \n- Provided advice to the Departmental Office of Civil Rights Director and the Bureau EEO offices", "location": "Washington D.C. Metro Area", "title": "EEO Specialist, Employment Complaints & Adjudication Division, Office of Civil Rights", "startedOn": {"month": 2, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:15065"}, {"posId": 502979084, "new": false, "current": false, "endedOn": {"month": 2, "year": 2014}, "companyName": "U.S. Department of the Interior", "description": "The Interior Board of Land Appeals (IBLA) is an appellate review body that exercises the delegated authority of the Secretary of the Interior to issue final decisions for DOI. Its administrative judges (AJ) decide appeals from bureau decisions relating to the use and disposition of public lands and their resources, mineral resources on the Outer Continental Shelf, and the conduct of surface coal mining operations under the Surface Mining Control and Reclamation Act. IBLA has authority over:\n\nâ\u0080¢ Bureau of Land Management decisions re: mining, grazing, energy development, royalty management, timber harvesting, wildfire management, recreation, wild horse/burro management, cadastral surveys, Alaska land conveyances, rights of way, land exchanges, and trespass actions;\nâ\u0080¢ Office of Natural Resources Revenue and the Deputy Assistant Secretary decisions - Natural Resources Revenue regarding royalty management;\nâ\u0080¢ Bureau of Ocean Energy Management and the Bureau of Safety and Environmental Enforcement decisions;\nâ\u0080¢ Bureau of Indian Affairs decisions re: minerals management on Indian lands;\nâ\u0080¢ Office of Surface Mining Reclamation and Enforcement decisions re: surface coal mining operations; \n\nMy duties:\n\n- Monitored case statuses to ensure timely submission of pleadings, adequacy of service, and ripeness for review.  \n- Ensured prompt/proper action on requests for stays or requests to place decisions into immediate effect pending full consideration by the Board\n-  Gathered relevant records from the agency and drafted appropriate orders for approval by the Chief AJ and Deputy Chief AJ \n- Prepared draft decisions and orders disposing of cases \n- Ensured consistency with procedural guidelines and Board precedent in decisions and orders ", "location": "Washington D.C. Metro Area", "title": "Staff Attorney, Interior Board of Land Appeals, Office of Hearing and Appeals (Detail)", "startedOn": {"month": 1, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:15065"}, {"posId": 321541251, "new": false, "current": false, "endedOn": {"month": 4, "year": 2013}, "companyName": "U.S. Department of Justice", "description": "The Disability Rights Section works to achieve equal opportunity for people with disabilities in the United States by implementing the Americans with Disabilities Act (ADA).  Through its multi-faceted approach toward achieving compliance with the ADA, this Section works to make this goal a reality.  The Section's enforcement, certification, regulatory, coordination, and technical assistance activities, required by the ADA, combined with an innovative mediation program and a technical assistance grant program, provide a cost-effective and dynamic approach for carrying out the ADA's mandates.  The Section also carries out responsibilities under Sections 504 and 508 of the Rehabilitation Act, the Small Business Regulatory Enforcement Fairness Act, and Executive Order 12250.  Section activities affect six million businesses and non-profit agencies, 80,000 units of state and local government, 49 million people with disabilities, and over 100 Federal agencies and commissions in the Executive Branch.\n\nMy Duties: \n\n- Investigated civil rights complaints, including conducting interviews, requesting and reviewing documents, drafting proposed settlement agreements, and participating in the negotiation of such agreements\n- Litigation, including researching legal issues, drafting memos, legal briefs, discovery requests and answers (interrogatories and document production)\n- Drafted technical assistance documents on Title III (public accommodations) and the world wide web \n- Collaborated with United States Attorneys, Assistant United States Attorneys, and attorneys from other federal agencies while leading investigation on para-transit matters in North Carolina ", "location": "Washington D.C. Metro Area", "title": "Trial Attorney, Disability Rights Section, Civil Rights Division (Detail)", "startedOn": {"month": 10, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:3564"}, {"posId": 238951377, "new": false, "current": false, "endedOn": {"month": 12, "year": 2011}, "companyName": "U.S. Department of Labor", "description": "See below.", "location": "Washington D.C. Metro Area", "title": "Law Clerk, AFGE Local 12", "startedOn": {"month": 10, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:5697"}, {"posId": 162201744, "new": false, "current": false, "endedOn": {"month": 4, "year": 2011}, "companyName": "U.S. Department of Labor", "description": "See below.", "location": "Washington D.C. Metro Area", "title": "Law Clerk, AFGE Local 12", "startedOn": {"month": 1, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:5697"}, {"posId": 142932101, "new": false, "current": false, "endedOn": {"month": 12, "year": 2010}, "companyName": "University of the District of Columbia - The David A. Clarke School of Law", "description": "UDC School of Law students and faculty supervisors in the Juvenile and Special Education Law Clinic represent children and parents (or guardians) primarily in special education matters, addressing the problems of delinquency by supplementing traditional delinquency representation with, where appropriate, advocacy to address the special education needs of the children who are the subject of those delinquency proceedings.  Second- and third-year students who are court-certified are responsible for the overall management of special education cases, to include drafting documents, developing and implementing case plans, negotiating, and handling administrative hearings and courtroom representation.  Arranging for children to receive needed special education services ensures that the delinquency system responds appropriately to the children's needs for care and rehabilitation. In a large number of cases, the clinic is able to protect children from punitive responses or to extricate children from the delinquency system altogether.\n\nMy Duties:\n\n- Drafted compensatory education plans and Individualized Education Plans (IEPs) for clients pursuant to the Individuals with Disabilities Education ActÂ (IDEA)\n- Represented clients in IEP compensatory due process hearings at the D.C. Jail\n- Partnered with Morrison Foerster before D.C. Superior Court in delinquency proceedings, focusing on client's special education needs \n- Scheduled and facilitated psychological and educational evaluations at the D.C. Jail \n- Arranged for services under IEPs for clients at the D.C. Jail \n", "location": "Washington D.C. Metro Area", "title": "Student Attorney, Juvenile and Special Education Legal Clinic", "startedOn": {"month": 8, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:2234138"}, {"posId": 142931814, "new": false, "current": false, "endedOn": {"month": 8, "year": 2010}, "companyName": "U.S. Department of Labor", "description": "AFGE Local 12 represents bargaining unit members at DOL and provides assistance in grievance preparation, arbitration representation, labor contract negotiating, preparation of EEO complaints and any filings with the Federal Labor Relations Authority (FLRA), Merit System Protection Board (MSPB), and the Equal Employment Opportunity Commission (EEOC). Â \n\nMy Duties:\n\n- Negotiated/drafted settlement agreements re: performance appraisal grievances \n- Drafted: motion in limine (doctrine of laches) \n- Represented employees in Step 1 and 2 grievance meetings between management and Local 12, arbitration, mediation, and counseling clients for settlements\n- Investigated grievances (e-mail archives, past and present performance appraisals, etc.)\n- Filed unfair labor practice with the Federal Labor Relations Authority\n- Represented AFGE Local 12 in a collective bargaining agreement renegotiation \n- Prepared witnesses, direct examination, and cross-examination questions for arbitration\n- Researched and wrote post-hearing briefs for completed arbitrations based on transcribed testimony, documentary evidence, case law, statutory and regulatory law, and the collective bargaining agreement", "location": "Washington D.C. Metro Area", "title": "Legal Intern, AFGE Local 12", "startedOn": {"month": 6, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:5697"}, {"posId": 142931815, "new": false, "current": false, "endedOn": {"month": 5, "year": 2010}, "companyName": "University of the District of Columbia - The David A. Clarke School of Law", "description": "The HIV/AIDS clinic partners with the Legal Aid Society of D.C. and the Childrenâ\u0080\u0099s Law Center to represent parents inÂ child abuseÂ and neglect cases in the D.C. Superior Court.Â  The Clinic also represents parents and family members infected with or affected by HIV/AIDS to ensure permanency for the children in their care and will prepare standby guardianship petitions; powers of attorney and living wills for clients with HIV/AIDS.\n\nMy Duties: \n\n- Represented clients in neglect hearings as under D.C. Court of Appeal Rule 48 in the D.C. Family Court \n- Represented HIV/AIDS clients with standby guardianship proceedings\n- Drafted: motions for continuance, motion to vacate stipulation, motion for recusal, Interim Status Reports of the client \n- Client correspondence, investigation, legal research", "location": "Washington D.C. Metro Area", "title": "Student Attorney, HIV/AIDS Legal Clinic", "startedOn": {"month": 1, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:2234138"}, {"posId": 142931824, "new": false, "current": false, "endedOn": {"month": 8, "year": 2009}, "companyName": "Congress Heights Community Training & Development Corporation", "description": "Congress Heights Community Training And Development Corporation (CHCTDC) is a 501(c)(3) non-proï¬\u0081t organization, incorporated on April 20, 1988, under the laws of the Government of the District of Columbia. CHCTDC was founded for the purpose of improving the quality of life of residents in Washington, D.C., East of the River, Anacostia, Congress Heights, Southeast D.C. and surrounding parts of Maryland in economically depressed areas by providing job placement opportunities that would aid in the reduction of unemployment and underemployment by promoting self suï¬\u0083ciency. These thrusts would be realized through educational, vocational, job readiness, and job placement opportunities to improve residentsâ\u0080\u0099 capabilities to compete in a competitive job market.\n\nMy Duties: \n\n- Created/implemented street law course in Hope Village half-way home\n- Drafted legal documents: notice to quit, commercial leases, motion to dismiss\nAided business in 501(c)(3) formations", "location": "Washington D.C. Metro Area", "title": "Legal Intern", "startedOn": {"month": 5, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:15981486"}, {"posId": 250747902, "new": false, "current": false, "endedOn": {"month": 12, "year": 2008}, "companyName": "AARP", "description": "Legal Counsel for the Elderly (LCE) handles cases for Washington, D.C. residents who are age 60 and older. We also handle Social Security and Supplemental Security Income disability cases for D.C. residents age 55 and older. LCE handles most types of civil (not criminal) legal matters. \n\nMy Duties:\n\n- Drafted wills, power of attorney documents (both springing and durable), judgment proof letters to creditors, and client counseling letters\n- Facilitated services for elderly clients with insurance and service care providers\n- Went on house visits to bring LCE's services into the community", "location": "Washington D.C. Metro Area", "title": "Legal Intern, Legal Counsel for the Elderly", "startedOn": {"month": 9, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:162230"}, {"posId": 142931816, "new": false, "current": false, "endedOn": {"month": 8, "year": 2007}, "companyName": "Superior Court of the District of Columbia", "description": "The Multi-Door Dispute Resolution Division of the DC Superior Court assists parties to reach agreements that meet their interests, preserve relationships, and save time and money.  Mediators and dispute resolution specialists are trained at Multi-Door to serve in a wide range of cases, from civil to small claims, to family.\n\nMy Duties: \n\n- Handled mediation docket and scheduled mediations based on mediator expertise/area of practice \n- Aided in annual mediator certification training \n- Participated as an ADR neutral in mediation processes\n- Compiled mediator roster and updated court docket", "location": "Washington D.C. Metro Area", "title": "Case Manager Intern, Multi-Door Dispute Resolution", "startedOn": {"month": 6, "year": 2007}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Christina", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/christinabui", "location": "Washington, District Of Columbia"}