{"lastName": "Abercrombie", "objectUrn": "urn:li:member:269932609", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1998}, "fieldsOfStudy": ["Psychology"], "school": "urn:li:fs_salesSchool:18160", "degree": "Bachelor's degree", "schoolName": "Georgia Southern University", "startedOn": {"year": 1995}, "eduId": 244176956}, {"endedOn": {"year": 1995}, "school": "urn:li:fs_salesSchool:17831", "schoolName": "California State University-Northridge", "startedOn": {"year": 1993}, "eduId": 244177890}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABAW2EEBbrJlsvZTfPYMYpcclK06Bz4tLv8,NAME_SEARCH,undefined)", "numOfConnections": 244, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHsqvWKDzq7ng/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=XbMRNdo19XPXj1VZCPoe_TKkqPZO53MaNlSsM-7jsyg", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHsqvWKDzq7ng/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=kMHk-tJkToY_9ERVRpRlk1ghh9jygDOshG2Hdwltm5Q", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHsqvWKDzq7ng/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=rVNaZna5uY53JwTsZRhW15Xm9CazVG8uW0WTttJXIKQ", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQHsqvWKDzq7ng/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=ilDLNeRPSvqDgqCcDIizE6jphEumHnz2Q1L7lEL2vWo", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "SSO - Special Security Officer at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 1186645669, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington D.C. Metro Area", "title": "SSO - Special Security Officer", "startedOn": {"month": 5, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Rodney Abercrombie", "positions": [{"posId": 1186645669, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington D.C. Metro Area", "title": "SSO - Special Security Officer", "startedOn": {"month": 5, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 680390024, "new": false, "current": false, "endedOn": {"month": 5, "year": 2017}, "companyName": "U.S. Department of State", "location": "Washington D.C. Metro Area", "title": "Control Management Officer", "startedOn": {"month": 6, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:3100"}, {"posId": 675063286, "new": false, "current": false, "endedOn": {"month": 6, "year": 2015}, "companyName": "U.S. Army", "title": "Retired", "startedOn": {"month": 1, "year": 1986}}, {"posId": 651537983, "new": false, "current": false, "endedOn": {"month": 5, "year": 2015}, "companyName": "U.S Army", "description": "â\u0080¢\tOversee's the 66th MI BDE SCIFs.  Issues and maintains accountability of SCI courier cards and orders.  Conducts travel briefings, debriefings, and JPAS visitation requests. \nâ\u0080¢\tAssists in T-SCIF approval requests and conducts T-SCIF inspections.  Performs security inspections and staff assistance visits for the compliance of security requirements of Battalions.  Advises subordinate units on security matters.\nâ\u0080¢\tReport, adjudicate and conduct preliminary investigations pertaining to violations.  Research regulations for Personnel Security guidance to determine the appropriate course of action based on individual circumstances. \nâ\u0080¢\tConduct periodic reviews of information security systems to ensure compliance with security regulatory guidance and investigate suspected compromises.  Establish and maintain agreements for alarm maintenance, testing and support for external monitoring and/or response personnel.\nâ\u0080¢\tAdminister and implement the Information Security Program to ensure the current and proper classification, declassification and safeguarding of classified information.  \nâ\u0080¢\tSafeguard classified and sensitive information to remain in compliance of regulations.  Provide advice, technical assistance, and recommendations to senior staff on physical security matters.\nâ\u0080¢\tServe as the personnel security authority for development and implementation of security guidelines, procedures, policy, and programs in support of the Brigade.   \nâ\u0080¢\tManage Personnel Security Program; maintaining data regarding investigations and clearance status for personnel, as well as the designation of civilian position sensitivity levels. \nâ\u0080¢\tAdminister Security Education, Training and Awareness programs within the organization.  \nâ\u0080¢\tProvided mentorship to five physical security staff members, ensuring that all are capable of understanding and being able to execute physical security requirements.", "location": "66th Military Intelligence Bde; Wiesbaden, Germany", "title": "Security Manager & Special Security Officer", "startedOn": {"month": 8, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 797610650, "new": false, "current": false, "endedOn": {"month": 2, "year": 2014}, "companyName": "U.S. Army", "description": "â\u0080¢\tLed an analytical team of 12 military and civilian analysts in providing direct intelligence support to U.S. Army Europe (USAREUR).  Provided counterterrorism intelligence to EUCOM and a CIFC working in a Foreign Allied Nation (FAN) in support of Operation Nomad Shadow (ONS).  Supervised, coordinated and participated in the predictive analysis of enemy activity.  Provided oversight management and quality assurance in the process and distribution of strategic intelligence of dedicated region of interest in assisting in the targeting efforts of CIFC and FAN.    \nâ\u0080¢\tResponsible for more than 35 Branch presentations and briefings.   Led Branch through the development and presentation of more than 140 Intelligence products.  Ensured all intelligence data was properly disseminated within supported command/organization.\nâ\u0080¢\tMonitored an assortment of non-organic metrics of IMINT, SIGINT and HUMINT.\nâ\u0080¢\tAdvised leadership on best solutions and processes regarding analytical manpower, intelligence production and requirements.  Interfaced with higher commands and organizations including to answer intelligence related RFIs and de-conflict or collaborate on any given requirement and reporting\n", "location": "24th Military Intelligence Battalion, Wiesbaden, Germany", "title": "Branch Collections Manager", "startedOn": {"month": 7, "year": 2013}}, {"posId": 417434571, "new": false, "current": false, "endedOn": {"month": 5, "year": 2012}, "companyName": "U.S. Army", "description": "â\u0080¢\tAnti-Terrorism Officer (ATO) of an organization of 1200 personnel. \nâ\u0080¢\tAssessed and identified security/force protection vulnerabilities throughout the organization employing Operational Security, Physical Security, Critical Infrastructure Protection (CIP) and Crime Prevention methodologies and provided recommendations to the organization leadership that mitigate identified risks.\nâ\u0080¢\tReported suspicious incidents, force protection concerns and related information to Battalion leadership, Division Anti-Terrorism section and the affected locations/commands of incidents and concerns, having direct authority to advise immediate preparatory action.\nâ\u0080¢\tDeveloped protection plans that meet the requirements established by the Department of Defense (DOD), and the 3rd Infantry Division orders, policies and directives.\nâ\u0080¢\tRepresented Division Higher Headquarters Battalion (DHHB) at CIP, AT and threat working group (TWG) meetings.\nâ\u0080¢\tConducted an annual Vulnerability Assessment (VA) of the DHHB identifying AT/FP risks to personnel, facilities and equipment.  Led development of hazard, threat, vulnerability, consequence and response capability assessments.\nâ\u0080¢\tLed the development of training, exercise and readiness evaluations to include exercise development, execution and evaluation components.", "location": "DHHB, 3ID, Ft Stewart, Ga.", "title": "Anti-Terrorism Officer", "startedOn": {"month": 5, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 651538476, "new": false, "current": false, "endedOn": {"month": 4, "year": 2012}, "companyName": "U.S. Army", "description": "â\u0080¢\tResponsible for the Physical Security and Personnel Security, of an organization of more than 1200 personnel.\nâ\u0080¢\tResponsible for collecting and synthesizing information from a variety of sources involving complex issues; analyzed and interpreted the information, and then drew conclusions based on my findings. \nâ\u0080¢\tEvaluated the effectives of information security systems, devices and security procedures of the Battalion.  \nâ\u0080¢\tServed as the unit Physical Security Manager.  Provided advice, technical assistance, and recommendations to senior staff on physical security matters.  Developed, maintained and implemented Command physical security Standard Operating Procedure and related policies. \nâ\u0080¢\tResponsible for the Battalion passing all Physical Security Inspections.  Led the section through an Inspector Generalâ\u0080\u0099s (IG) annual inspection with excellent results.\nâ\u0080¢\tServed as the personnel security authority for development and implementation of security guidelines, procedures, policy, and programs in support of the Battalion.   Monitored and maintain security clearances and authorizations for the Battalion digital command and control users.\nâ\u0080¢\tOversaw and conducted the security training of more than 1200 personnel.", "location": "DHHB, 3d Infantry Division", "title": "Security Manager", "startedOn": {"month": 4, "year": 2011}}, {"posId": 668789962, "new": false, "current": false, "endedOn": {"month": 4, "year": 2012}, "companyName": "U.S. Army", "description": "â\u0080¢\tLed intelligence section of an organization of more than 1200 personnel.  Prepared and disseminated intelligence reports and gave recommendations concerning Commanders Priority Intelligence requirements and other information requirements.  Maintained enemy situation template and analyzed enemy tactics and doctrine.  Provided mentorship to three staff members, ensuring that all are capable of understanding and being able to execute S2 requirements. \nâ\u0080¢\tChosen to be the Division DTAC Intelligence Officer for deployment to overseas combat zone.  Conducted three training exercises fulfilling the Intelligence DTAC officer role.  Within the DTAC, led an Intelligence staff of four personnel, maintaining the enemy situation and analyzing enemy tactics.  Section was prepared to take total control of the 3 Infantry Division intelligence requirements and operations in the event that the Higher Headquarter lost communications or the ability to continue the fight.\nâ\u0080¢\tCreated charts, graphs, and maps while analyzing information.   Work often performed under critical time constraints.  Continuously worked on trend analysis, searching for patterns.   Based on analysis, was continuously able to recommend courses of action for future operations.  Provided weekly factual reports during Battalion Staff meetings.  Provided oral intelligence presentations as needed to individuals or groups.\nâ\u0080¢\tResponsible for collecting and synthesizing information from a variety of sources involving complex issues; analyzed and interpreted the information, and then drew conclusions based on my findings.", "location": "DHHB, 3d Infantry Division", "title": "Intelligence Officer", "startedOn": {"month": 4, "year": 2011}}, {"posId": 651537431, "new": false, "current": false, "endedOn": {"month": 4, "year": 2011}, "companyName": "U.S Army", "description": "â\u0080¢\tManaged the 1st Cavalry Division SCIF.  Administered more than 280 SCI personnel security indoctrinations and more than 120 debriefings.  Issued and maintained accountability of SCI courier cards and orders.  Conducted travel briefings, debriefings, and JPAS visitation requests.\nâ\u0080¢\tServed as the focal point for control and accountability of Sensitive Compartmented Information (SCI) materials.\nâ\u0080¢\tAssisted in T-SCIF approval requests and conducted seven T-SCIF inspections.  Performed 12 security inspections and staff assistance visits for the compliance of security requirements.\nâ\u0080¢\tReported, adjudicated and conducted preliminary investigations pertaining to violations.     \nâ\u0080¢\tConducted periodic reviews of information security systems to ensure compliance with security regulatory guidance and investigate suspected compromises.  Established and maintained agreements for alarm maintenance, testing and support for external monitoring and/or response personnel.  \nâ\u0080¢\tManaged Personnel Security Program; maintaining data regarding investigations and clearance status for personnel, as well as the designation of civilian position sensitivity levels.  I serviced more than 2,160 security clearances.  Reviewed and processed personnel investigation forms for background investigations.   \nâ\u0080¢\tSafeguarded classified and sensitive information to remain in compliance of regulations.  Provided advice, technical assistance, and recommendations to senior staff on physical security matters.  \nâ\u0080¢\tAdministered Security Education, Training and Awareness programs within the organization.  Trained personnel on proper Intelligence Community classification.  \nâ\u0080¢\tServed as the 1st Cavalry Division Foreign Disclosure Officer.  Attended training at Ft McDill, Florida.  Reviewed and released more than 20 products.   Administered and implemented the Information Security Program to ensure the current and proper classification, declassification and safeguarding of classified information.", "location": "1st Cavalry Division", "title": "Special Security Officer", "startedOn": {"month": 2, "year": 2010}}, {"posId": 651538590, "new": false, "current": false, "endedOn": {"month": 1, "year": 2010}, "companyName": "U.S. Army", "description": "â\u0080¢\tResponsible for the Personnel Security, Information Security, and Physical Security of an organization of more than 180 personnel.\nâ\u0080¢\tEvaluated the effectives of information security systems, devices and security procedures of the Battalion.\nâ\u0080¢\tDeveloped, maintained and implemented physical security Standard Operating Procedures and related policies.  Provided advice, technical assistance, and recommendations to senior staff on physical security matters.  Responsible for the Battalion passing all physical security inspections.  \nâ\u0080¢\tDeveloped and implemented personnel security guidelines, procedures, policy, and programs in support of the Battalion.   Monitored and maintained security clearances and authorizations for the Battalion digital command and control users.\nâ\u0080¢\tOversaw and conducted the security training of more than 180 personnel.\nâ\u0080¢\tProvided mentorship to three staff members, ensuring that all are capable of understanding and being able to execute requirements.", "location": "79th EOD, Ft Hood, Tx", "title": "Security Manager", "startedOn": {"month": 8, "year": 2008}}, {"posId": 665709293, "new": false, "current": false, "endedOn": {"month": 1, "year": 2010}, "companyName": "U.S. Army", "description": "â\u0080¢\t13 months of Intelligence Officer time was conducted while deployed in a combat zone in Iraq.   Responsible for the Intelligence of an organization of more than 180 personnel.  Prepared and disseminated intelligence reports and gave recommendations concerning Commanders Priority Intelligence requirements and other informational requirements.  Maintained enemy situation template and analyzed enemy tactics and doctrine.  Disseminated enemyâ\u0080\u0099s probability to deploy IEDâ\u0080\u0099s & IDF weapons, uses and effects. \nâ\u0080¢\tResponsible for collecting and synthesizing information from a variety of sources involving complex issues; analyzed and interpreted the information, and then drew conclusions based on my findings.  \nâ\u0080¢\tCreated charts, graphs, and maps while analyzing information.   Work often performed under critical time constraints.  Continuously worked on trend analysis, searching for patterns.   Provided daily factual reports during Staff meetings.  Provided oral intelligence presentations as needed to individuals or groups.\nâ\u0080¢\tMaintained working relationships with U.S. intelligence agencies.  Shared intelligence among agencies and routinely met with agents in regards to specific intelligence products.\nâ\u0080¢\tLed section through an Intelligence Oversight annual inspection with excellent results.\nâ\u0080¢\tProvided mentorship to three S2 staff members, ensuring that all are capable of understanding and being able to execute S2 requirements.", "location": "79th EOD BN, Ft Hood, Tx", "title": "Intelligence Officer", "startedOn": {"month": 8, "year": 2008}}, {"posId": 661559875, "new": false, "current": false, "endedOn": {"month": 12, "year": 2007}, "companyName": "U.S. Army", "description": "â\u0080¢\tServed as the Assistant Operations Officer of a Military Intelligence Battalion of more than 180 personnel in Phoenix, Arizona.  Was responsible for writing more than 20 Operation Orders or tasks.  Maintained data on all open Orders or Tasks to ensure that missions were being completed.  \nâ\u0080¢\tPlanned, developed, and led seven missions across the U.S. in support of Department of Homeland Security (DHS). \nâ\u0080¢       Led a three member team, supported by ICE and Border Patrol, in conducting an intelligence preparation of the border (IPB) of the 687km Washington state/Canadian border and approximate 128km of the Washington State coastline and islands in support of a joint operation of DoD, Department of Homeland Security (CBP, ICE, DEA), and Royal Canadian Mounted Police, and countless individuals.  \nâ\u0080¢\tPrimary instructor for JTF-NORTHCOM for the training of more than 90 DHS personnel in DoD standard intelligence.  Reconstructed DoD intelligence training material of Basic Intelligence, Targeting, Intelligence Preparation of the Border, and Link analysis to meet DHS specific areas of interest.\nâ\u0080¢\tDeveloped and conducted several AAR briefings for the Commander.", "location": "301st MI BN; Phoenix, AZ", "title": "Operations Officer", "startedOn": {"month": 10, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 654347392, "new": false, "current": false, "endedOn": {"month": 3, "year": 2006}, "companyName": "U.S. Army", "description": "â\u0080¢\t12 months of Battalion Intelligence Officer time was conducted while deployed in a combat zone in Iraq.   Responsible for the Intelligence of a war fighting organization of more than 700 personnel.  Prepared and disseminated intelligence reports and gave recommendations concerning Commanders Priority Intelligence requirements and other information requirements.  Maintained the enemy situation template and analyzed enemy tactics and doctrine.  \nâ\u0080¢\tResponsible for collecting and synthesizing information from a variety of sources involving complex issues; analyzed and interpreted the information, and then drew conclusions based on my findings.  \nâ\u0080¢\tOfficer in Charge of a small prison in Iraq.  Prison confined over 420 prisoners during my tour in Iraq.  Responsibilities included ensuring that code of conduct rules were not being violated by U.S. guards; responsibilities also included the health & welfare of my soldiers and the prisoners.  Upon review of physical evidence, statements by both detainee and capturing unit, I made local determination of detainee innocence or guilt.  Upon review of my created packets, I had the highest detainee conviction rate in theater.  \nâ\u0080¢     Through the compiling of intelligence from interrogations of over 100 detainees, I was  credited for the confirmation of a large terrorist organization operating within the area.  Intelligence directed focus on that particular region resulted in the capture of several high level Al Qaeda operatives which subsequently led to the gathering of information on Al-Zarqawi, the Emir of Al Qaeda.  \nâ\u0080¢\tHeld weekly meetings with the local population in order to assist in locating missing family members or the return of personal property.  Held weekly meetings with the head tribal sheiks, the Iraqi Battalion Commander from the local unit, and the city Police Chief.  \nâ\u0080¢      Responsible for the mentorship and training of 5 personnel that fell under my section.", "location": "3ID, Ft Stewart, Ga", "title": "Intelligence Officer", "startedOn": {"month": 12, "year": 2004}}, {"posId": 828791944, "new": false, "current": false, "endedOn": {"month": 3, "year": 2006}, "companyName": "U.S. Army", "description": "â\u0080¢\tResponsible for the Personnel Security, Physical Security, and Information Security of a war fighting organization of more than 700 personnel.  \nâ\u0080¢\tEvaluated the effectives of information security systems, devices and security procedures of the Battalion.  \nâ\u0080¢\tServed as the personnel security authority for development and implementation of security guidelines, procedures, policy, and programs in support of the Battalion.   Monitored and maintained security clearances and authorizations for a Battalion of more than 700 personnel.  \nâ\u0080¢\tProvided mentorship to four staff members, ensuring that all are capable of understanding and being able to execute requirements.\n", "location": "3ID; Ft. Stewart, GA.", "title": "Security Manager", "startedOn": {"month": 12, "year": 2004}}, {"posId": 850774519, "new": false, "current": false, "endedOn": {"month": 8, "year": 2004}, "companyName": "U.S. Army", "description": "â\u0080¢\tServed as the MIOBC class Operations Officer of a class of more than 30 personnel.  Was responsible for writing more than 8 Operation Orders or tasks.  Maintained data on all open Orders or Tasks to ensure that missions were being completed.\nâ\u0080¢\tCoordinated and scheduled weapon qualification range and weapon zero range.\nâ\u0080¢\tCoordinated and scheduled organizational formal attire event for more than 40 class members and VIP guests.  Negotiated contract with exterior organization for event.  Prepared and organized the organizational formal attired event.\nâ\u0080¢\tCoordinated and scheduled MIOBC class graduation location.  Oversaw the preparation and organization of the graduation.\n", "location": "Ft. Huachuca", "title": "Military Intelligence Officerâ\u0080\u0099s Basic Course", "startedOn": {"month": 4, "year": 2004}}, {"posId": 651535317, "new": false, "current": false, "endedOn": {"month": 4, "year": 2004}, "companyName": "Lanier Worldwide", "description": "â\u0080¢\tDemonstrated ability to build and maintain effective business relationships based on a responsive flexible approach and comprehensive needs assessment. Forty percent of business derived from new customer accounts.  \nâ\u0080¢\tResponsibilities included managing & maintaining a relationship with customer base; duties included monitoring departments, building personal acquaintances among department heads, and influencing means in which to upgrade or add to existing systems.  \nâ\u0080¢\tTargeted non-customer based accounts with the object of account penetration. Duties included prospecting, consultation, presentations, negotiating, and closing an account.  \nâ\u0080¢\tWon top sales representative of the month 14 times in selling copier, fax, printer, and scan products.  Won several awards with Lanier Worldwide, to include making Presidents Club & Century Club - annual trip winner.", "location": "Charlotte, Macon, and Atlanta", "title": "Sales Representative", "startedOn": {"month": 6, "year": 1998}, "companyUrn": "urn:li:fs_salesCompany:3317"}, {"posId": 686366735, "current": false, "endedOn": {"year": 2004}, "companyName": "Mortgage", "title": "sales rep", "startedOn": {"year": 2003}}, {"posId": 643465069, "new": false, "current": false, "endedOn": {"month": 10, "year": 1993}, "companyName": "U.S. Army", "description": "â\u0080¢\tResponsible for answering soldiers questions pertaining to pay & correcting pay issues. \nâ\u0080¢\tProvided in & out processing briefings to soldiers. \nâ\u0080¢\tResponsible for escorting large sums of currency; over one million dollars at times\nâ\u0080¢\tResponsible for unit operations in Operation Restore Hope, Somalia.\nâ\u0080¢\tGave briefings to up to 200 soldiers at a time.", "location": "10th Mountain Division;  Ft Drum, NY", "title": "Finance Travel Section Manager", "startedOn": {"month": 10, "year": 1991}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 643459821, "new": false, "current": false, "endedOn": {"month": 10, "year": 1991}, "companyName": "U.S. Army", "description": "â\u0080¢\t Decorated for Valor in Operation Desert Storm for actions conducted during the \"Battle of 73 Easting.â\u0080\u009d  (Largest tank battle in U.S. history)\nâ\u0080¢\t Duties included supervision of subordinates. \nâ\u0080¢        Performed duties of Driver, Loader, Gunner, and Tank Commander.\nâ\u0080¢        Scored highest Skills Qualification Test within an organization of 700 personnel with a score of 184 out of 200 possible points.  \nâ\u0080¢        As gunner, during gunnery in Grafenwohr in 1989, I shot a perfect qualification score of 1000.\nâ\u0080¢        First Specialist in the U.S. Army that attended and completed the Tank Commander's Certification Course in 1986 at Ft Knox, Ky.\nâ\u0080¢\t Performed precisely under dangerous circumstances.\nâ\u0080¢\t Performed more than 40 surveillance patrols, and served as a patrol leader more than 7 times on the East/West German border.", "location": "5/12th Cav;  2/2 ACR", "title": "M1A1 tank crewman", "startedOn": {"month": 1, "year": 1986}, "companyUrn": "urn:li:fs_salesCompany:1223"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Rodney", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/rodney-abercrombie-00149776", "location": "US Military Posts in Europe"}