{"lastName": "Conlon", "objectUrn": "urn:li:member:510234011", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1995}, "fieldsOfStudy": ["Psychology"], "school": "urn:li:fs_salesSchool:18875", "degree": "Bachelor's degree", "schoolName": "Rutgers University - Newark", "startedOn": {"year": 1991}, "eduId": 353028391}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAB5pjZsBMW5d342IyB4JGu-jXwco8Ic8r70,NAME_SEARCH,undefined)", "numOfConnections": 390, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFs_G2eV3unqg/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=7FlAubBvExkGIKdsNVV9PlLR14pqRAFlmTGt3o2niVM", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFs_G2eV3unqg/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=jun8d0g5UokfByqpl-IDN7fE93TLb8sneJ1FO7fdBWU", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFs_G2eV3unqg/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=C0LRVG41NZR47rXjIUsm7TO1_tSjMpEDgVvQyDrdouM", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFs_G2eV3unqg/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=WMODXRb6qapPqcrzo412P2XQDInKEugUgR5E0kFWBCM", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Unit Chief at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Proven leader with 20 years experience in the federal law enforcement community. Manager of diverse international and domestic law enforcement programs, with an emphasis on inter-agency collaboration. Experienced in leading investigative teams through high-profile investigations of violent crime, transnational crime, narcotics trafficking, money laundering, human trafficking, and fraud. Extensive experience in multiple forms of electronic surveillance, including telecommunications intercepts and electronic tracking. Successful results in extra-territorial application of criminal law to include extraditions from multiple countries. Well versed in mitigation and management of threats against law enforcement personnel and witnesses. Holder of security clearance.", "pendingInvitation": false, "defaultPosition": {"posId": 1143213862, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I manage a staff of 20 with oversight of 7 programs in ICEâ\u0080\u0099s Office of International Operations- including- the Cultural Property, Arts, & Antiquities Program (CPAA), International Law Enforcement Academies, the Personnel Recovery Unit, Liaisons to Dept. of Defense Unified Combatant Commands and the State Deptâ\u0080\u0099s Bureau of International Narcotics and Law Enforcement, and ICE's International Assistance Agreements, and International Visitors Programs.\n\nThe ICE CPAA program provides guidance to special agents around the world in the investigation, seizure, prosecution and repatriation of historical artifacts, stolen or looted artworks, and other culturally significant property. The CPAA program engages with the Smithsonian Institution to provide specialized training to ICE and CBP personnel who encounter these unique investigations. ICE has repatriated artwork stolen from during World War II, ancient Egyptian sarcophagi, and more. \n\nI represent ICE on the International Law Enforcement Academy (ILEA) Steering Committee. The State Dept. operates five International Law Enforcement Academies around the world. ICE provides instruction and class coordination at each of the academies. The steering committee approves course catalogues and provides oversight of the directorships of each of the academies. \n\nICE has no greater responsibility than the safety and security of our personnel and their families deployed overseas. The ICE Personnel Recovery Unit equips ICE employees & families  with the knowledge, tools, and skills needed to identify and respond to isolating events or potentially dangerous situations, whether from natural disasters, political instability or acts of violence.\n\nI oversee ICE's team of Liaison Officers to each of the Dept. of Defense's Unified Combatant Commands. These senior special agents are co-located at each command and leverage ICE's unique authorities to complement each command's mission.", "location": "Washington D.C. Metro Area", "title": "Unit Chief", "startedOn": {"month": 10, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Michael Conlon", "positions": [{"posId": 1143213862, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I manage a staff of 20 with oversight of 7 programs in ICEâ\u0080\u0099s Office of International Operations- including- the Cultural Property, Arts, & Antiquities Program (CPAA), International Law Enforcement Academies, the Personnel Recovery Unit, Liaisons to Dept. of Defense Unified Combatant Commands and the State Deptâ\u0080\u0099s Bureau of International Narcotics and Law Enforcement, and ICE's International Assistance Agreements, and International Visitors Programs.\n\nThe ICE CPAA program provides guidance to special agents around the world in the investigation, seizure, prosecution and repatriation of historical artifacts, stolen or looted artworks, and other culturally significant property. The CPAA program engages with the Smithsonian Institution to provide specialized training to ICE and CBP personnel who encounter these unique investigations. ICE has repatriated artwork stolen from during World War II, ancient Egyptian sarcophagi, and more. \n\nI represent ICE on the International Law Enforcement Academy (ILEA) Steering Committee. The State Dept. operates five International Law Enforcement Academies around the world. ICE provides instruction and class coordination at each of the academies. The steering committee approves course catalogues and provides oversight of the directorships of each of the academies. \n\nICE has no greater responsibility than the safety and security of our personnel and their families deployed overseas. The ICE Personnel Recovery Unit equips ICE employees & families  with the knowledge, tools, and skills needed to identify and respond to isolating events or potentially dangerous situations, whether from natural disasters, political instability or acts of violence.\n\nI oversee ICE's team of Liaison Officers to each of the Dept. of Defense's Unified Combatant Commands. These senior special agents are co-located at each command and leverage ICE's unique authorities to complement each command's mission.", "location": "Washington D.C. Metro Area", "title": "Unit Chief", "startedOn": {"month": 10, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1042230522, "new": false, "current": false, "endedOn": {"month": 10, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As the Section Chief of the  Visa Security Program in HSI's International Operations Division, I supervised a team of 6 program managers and 4-6 contractors in the management, expansion, and deployment of a global national security- law enforcement investigative program operating in more than 30 countries.\n\nOur team developed proprietary instruction and provided day to day oversight of selected offices overseas. The  Visa Security Program is among the US Governments primary tools in counter-terrorism.", "location": "Washington D.C. Metro Area", "title": "Section Chief", "startedOn": {"month": 8, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 819648275, "new": false, "current": false, "endedOn": {"month": 8, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Program Manager ICE International Operations- Visa Security Program\n\nManaged a global national security program operating in more than 30 countries with a budget of over $30 Million. Responsible for the selection and build-out of expansion offices around the world. I worked with interagency partners in the federal law enforcement community, US state Department, and Intelligence Community. Responsible for a 20% increase in global coverage in 2016. Course developer and instructor for proprietary national security, counter-terror training program. \n\nThe Visa Security Program was enacted by Section 428 of The Homeland Security Act of 2002. The VSP maximizes the visa application and adjudication process as a counterterrorism tool to identify terrorists, criminals and other aliens ineligible for a visa prior to their travel or application for admission to the United States. VSP leverages its capabilities, such as in-person interviews and working with international law enforcement partners to investigate suspect travelers, enhance existing information, and identify previously unknown threats. In 2016, the VSP screened over two million visa applications, including approximately 8,600 cases in which visas were refused for a variety of reasons, including for suspected connection to terrorism or terrorist organizations.", "location": "Washington D.C. Metro Area", "title": "Special Agent/Program Manager", "startedOn": {"month": 5, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 819643750, "new": false, "current": false, "endedOn": {"month": 5, "year": 2016}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Supervisor ICE-Homeland Security Investigations-New York Violent Gang Unit: Managed ten to fifteen employees and task force officers. Supervised investigations into violations of state and federal law with a focus on Racketeering (RICO), Violent Crime in Aid of Racketeering (VICAR), narcotics and weapons trafficking and enterprise corruption. Supervised Title III wiretapping, Organized Crime & Drug Enforcement Task Force (OCDETF) and High Intensity Drug Trafficking Area (HIDTA) investigations. Managed large-scale investigative operations in coordination with partner law enforcement agencies. \n\nSupervisor of historic violent crime investigation into Bronx, NY based gangs: 2 Fly and Big Money Bosses (BMB). This investigation resulted in the largest single arrest operation and prosecution of gang members in the history of New York City; the indictment of 120 members of these two rival violent street gangs.\n\nSupervisor ICE-Homeland Security Investigations New York-Worksite Enforcement Unit: Manage eight to ten employees and task force officers. Supervise investigations of unlawful employers of undocumented aliens and related offenses. Employers of undocumented aliens frequently engage in other crimes in furtherance of their schemes to employ undocumented aliens, such as human trafficking & smuggling, money laundering, fraudulent documents, prostitution, and exploitation of immigrant communities. \n\nSupervisor of investigation into a fraudulent scheme to exploit the US Federal Government's Women, Infant, and Children (WIC) Special Supplemental Nutrition Program.  Successfully led this investigation resulting in the arrest of 31 co-conspirators and the seizure of over $1.8 Million in currency, bank accounts, and real property.", "location": "Greater New York City Area", "title": "Supervisory Special Agent", "startedOn": {"month": 11, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1034210144, "new": false, "current": false, "endedOn": {"month": 11, "year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "New York, New York", "title": "Supervisory Special Agent (Acting)", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 819648167, "new": false, "current": false, "endedOn": {"month": 11, "year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Conduct investigations into violations of federal laws to include human trafficking & smuggling, immigration benefit & document fraud, narcotics trafficking, money laundering, and violent crime and racketeering. Served as case agent for extensive domestic and extra-territorial complex investigations. Intiated or participated in high priority investigations to include Title III wiretapping, Organized Crime and Drug Enforcement Task Force (OCDETF), High Intensity Drug Trafficking Area (HIDTA), Racketeering (RICO/VICAR), Consolidated Priority Organization Targets (CPOT) and undercover operations. \n\nAccomplishments:\nCase agent for multi state sex trafficking and human smuggling investigation. This investigation resulted in the arrest of 46 defendants, more than 70 immigration violations, and forfeiture of over $1 Million in currency. Two fugitives in this investigation were captured as a result of their profiles being aired on the television program: America's Most Wanted\n\nCase agent for investigation into and ultimate extradition and arrest of Jorge Fadlallah-Cheaitelly, designated by the U.S. Department of the Treasury, Office of Foreign Assets Control as a Specially Designated Narcotics Trafficker. Cheaitelly ran an international drug and money laundering organization responsible for laundering tens of millions of dollars in narcotics proceeds.", "location": "Greater New York City Area", "title": "Special Agent", "startedOn": {"month": 4, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 819646568, "new": false, "current": false, "endedOn": {"month": 4, "year": 2003}, "companyName": "U.S. Immigration and Naturalization Service", "description": "Conduct inspections of all classes of applicants for admission to the United States. Enforced criminal and administrative statutes. \n\nAccomplishments: \n\nServed as member of Operation PROVIDE REFUGE joint task force resettling 4,000 Kosovar refugees during NATO military campaign against Slobodan MiloÅ¡eviÄ\u0087  and the Federal Republic of Yugoslavia forces. \n\nApprehended international fugitive Patrick Hewitt, wanted for murder in Washington, DC for a cold-case homicide. Hewitt was extradited from United Kingdom, after first attempting to enter the U.S. with a forged passport. \n", "location": "Newark, NJ", "title": "Immigration Inspector", "startedOn": {"month": 6, "year": 1998}}, {"posId": 820176021, "current": false, "endedOn": {"month": 1, "year": 2000}, "companyName": "Jersey City Medical Center - Barnabas Health", "location": "Jersey City, New Jersey", "title": "Emergency Medical Technician", "startedOn": {"year": 1995}, "companyUrn": "urn:li:fs_salesCompany:64408"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Michael", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/michael-conlon-38ba62122", "location": "Washington D.C. Metro Area"}