{"lastName": "Kutob", "objectUrn": "urn:li:member:400042164", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2014}, "fieldsOfStudy": ["Business Administration and Management, General"], "school": "urn:li:fs_salesSchool:41992", "degree": "Bachelor's degree", "schoolName": "American Military University", "startedOn": {"year": 2011}, "eduId": 275022878}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABfYKLQBU38tydHHHzGFdSOKPX9iLDolZpE,NAME_SEARCH,undefined)", "numOfConnections": 113, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEzpIULw_Gm_Q/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=kgdTVrzKKbueqTBL7Bs_V3J3y5I-DammFuYhNqUle5s", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEzpIULw_Gm_Q/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=IRvhOelWuRin0QGhTSS3iZHzCSdkH7BfB34Yhw2-sZc", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEzpIULw_Gm_Q/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=AXTa91O-HdNZr-12gvAxMhivjOyEgbiKvKL9k2sJ750", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEzpIULw_Gm_Q/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=p_3GF7AkoorRAJt3ebCP_3-CgQDXnAV_GQBdBF8nE1k", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Administrative Assistant at Georgia Department of Agriculture", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Experienced Administrative Assistant with a demonstrated history of working in the government administration industry. Skilled in Budgeting, Microsoft Excel, Customer Service, Microsoft Word, and Microsoft PowerPoint. Strong administrative professional with a Bachelor's degree focused in Business Administration and Management, General from American Military University. ", "pendingInvitation": false, "defaultPosition": {"posId": 1307066977, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Atlanta, Georgia", "title": "Mission Support Assistant", "startedOn": {"month": 11, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Dawn Kutob", "positions": [{"posId": 1307066977, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Atlanta, Georgia", "title": "Mission Support Assistant", "startedOn": {"month": 11, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1016091815, "new": false, "current": false, "endedOn": {"month": 11, "year": 2017}, "companyName": "Georgia Department of Agriculture", "location": "Atlanta, Georgia", "title": "Administrative Assistant", "startedOn": {"month": 6, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:1329252"}, {"posId": 632129712, "new": false, "current": false, "endedOn": {"month": 6, "year": 2017}, "companyName": "DISA", "description": "-\tAssist in the management, creation of artifacts and routing of funding and contract packages/documents.\n-\tAssist the Division chief in logistical coordination for implementation activities and events.\n-\tProvides complete, accurate, and timely information individually or in partnership with internal and/or external co-providers in response to customersâ\u0080\u0099 needs for reasons such as evaluating requirements, accomplishing work, and/or making decisions. \n-\tRegularly projects a positive, supportive, and professional image to all customers and anticipates customer needs and responds with necessary guidance and/or timely accurate product.\n-\tCompleted all requirements for COR designation.\n-\tAttends multiple meetings in regards to the budget and moving of funds.\n-\tAssisted the primary COR on all contracts.\n-\tSuccessfully assisted in the migration of over 35,00 computers to Windows 10 by responding to and accurately assessing IT related issues. \n-\tRecommending customers to the Tier 2 helpdesk and ensuring customers were helped in a timely and efficient manner.\n", "title": "Program Analyst", "startedOn": {"month": 7, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:163464"}, {"posId": 658030286, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "JFHQ-DODIN", "description": "-\tPlayed an intricate roll in the stand up and growth of JFHQ-DODIN into a full operational command.\n-       Operated at the action officer level addressing critical staffing and suspense actions in the areas of proofing divisional position papers and presentations, budget, travel, security, property, and all related personnel matters.\n-\tPrepared and coordinated the preparation, release, control, and distribution of all correspondence, reports and briefings.\n-\tMaintained electronic status logs of all correspondence, budgets, weekly reports, projects, travel, and training.\n-\tConducted studies, gathers data, and performed analysis that involved providing solutions to a wide variety of administrative problems related to improving the functions and work processes in each area.\n-\tParticipated in special studies and working group meetings with management or senior specialists on improving organizational effectiveness.\n-\tResponded to suspense requests for the division; provided background information, analysis, comments, and recommendations as required.\n-\tServed as the division records, files, publications, and reports manager.  Established and managed official files.  Developed and maintained central filing systems and advised office personnel on electronic filing processes.  \n-\tMaintained, gathered, and compiled electronic and paper records/files of organization workflow charts, staffing levels, mission and function statements, program resource use, and subject matter reference material. \n-\tOversaw all personnel and manpower-related functions.  Prepared and coordinated personnel actions with DISA GIG OPS Management Support Division personnel for matters affecting civilian personnel such as recruitment, performance appraisals, training, promotions, awards, and time and attendance.  \n-\tActed as supply coordinator by developing supply and equipment lists, ordering office administrative supplies, and distributing supplies.  \n", "location": "Fort Meade, MD", "title": "Administrative Assistant", "startedOn": {"month": 9, "year": 2014}}, {"posId": 981059836, "new": false, "current": false, "endedOn": {"month": 7, "year": 2011}, "companyName": "Office of the Judge Advocare General", "description": "-\tResident expert in the Defense Travel System (DTS). Served as the Program Manager for over 4,000 OJAG employees ensuring all travel authorizations and vouchers were submitted properly and within the agenyâ\u0080\u0099s travel regulation policy.\n-\tManaged domestic and overseas travel ensuring flight, car and hotel reservations were made within regulation of the agencyâ\u0080\u0099s travel policy. \n-\tOrganized and conducted quarterly training sessions for all new and existing personnel to include ODTAâ\u0080\u0099s in regards to travel using the Defense Travel System (DTS). Training included  how to create an authorization, vouchers and any admendments.  \n-\tWorked closely with the DTS help desk and reported all complex travel issues to senior management on a monthly basis.\n-\tMonitored all incoming employees making sure they were gained from their previous place of employment as well as removing/losing employees once they left the agency.\n-\tPrepared monthly reports in DTS, tracking the completion of travel vouchers and reporting to senior management any and all issues to include delinquent submissions of travel vouchers.\n-\tWorked closely with the agencyâ\u0080\u0099s finanace officer ensuring that there was enough travel funds for the fiscal year.  Moved travel funds from one line of accounting to another when necessary, to support senior level executives travel.\n-\tSingle handedly maintained, managed, evaluated and oversaw Government-Wide Commercial Purchase Card (GCPC) totaling $1,000,000.00 and Government Travel Charge Card programs for an estimated 4,000 personnel.   \n-\tFunctioned as the Agency Program Coordinator (APC) and coordinated with the banking/financial institutions, to establish and/or terminate Cardholder and Approving Official (AO) accounts.                          \n-\tMonitored various employee charges to charge cards to ensure charges were in accordance with agencies policies and regulations. Managed program execution, program performance, misuse, abuse and delinquencies", "location": "Washington Navy Yard", "title": "Program Manager", "startedOn": {"month": 4, "year": 2010}}, {"posId": 980620665, "new": false, "current": false, "endedOn": {"month": 7, "year": 2008}, "companyName": "United States Navy", "description": "-\tPrepared all outgoing correspondence ensuring they were in proper format to include; grammar, spelling, and in accordance with the Navy correspondence manual.\n-\tManaged the DTS travel budget of over $2,000,000 ensuring travel funds for training and detachments were readily available.\n-\tWorked closely with the commands comptroller distributing funds in upwards of $500,000 each fiscal year to the DTS travel budget for future travel.\n-\tProcessed over 2,000 travel orders and travel vouchers for active duty members in the Defense Travel System (DTS) and the Navy Reserve Order Writing System (NROWS) for reserve members.\n-\tAnalyzed ways to improve efficient and effective tracking measures for the Defense Travel System in order to track pay outs of travel vouchers by developing weekly reports within DTS, showing the pay outs of all travel vouchers, ensuring vouchers were paid within the 72 hour process time and without error.\n-\tServed as focal point and resident expert for the Defense Travel System (DTS); trained over 400 military members on the policies, procedures, and proper use of DTS.\n-\tDeveloped and maintained the records management system with 100% accountability and zero discrepancies.\n-\tPlanned and implemented events and functions for senior personnel involving foreign dignitaries, diplomats and foreign military personnel.                                                                           \n-\tManaged Status of Funds reports on a bi-weekly basis ensuring the funds allocated to each travel authorization matched the report.\n-\tFormulated and revised travel budget estimates within the organization to include transferring upwards of $100,000 from the CONUS travel budget to the OCONUS travel budget in order to meet mission requirements.\n-\tAssisted with formulation and revision of budget estimates for operation and maintenance funds within organizational elements.", "location": "Andrews AFB, MD", "title": "Personnel Specialist", "startedOn": {"month": 11, "year": 2001}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Dawn", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/dawn-kutob-a70b81b1", "location": "Greater Atlanta Area"}