{"lastName": "Slade", "objectUrn": "urn:li:member:268017213", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAA_5nj0Bkul0F1P8Tyuz-dq9DsKyMUSfCoA,NAME_SEARCH,undefined)", "numOfConnections": 299, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEtbSgccGgSpw/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=2k5vjG79zYRm153n4JgBGVmN-9JBR4lEFdvqCFL2M8A", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEtbSgccGgSpw/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=GWvxBSvDwMDt2o1BCaGETRp8sSZVc8A_pAuAmRfr7_Q", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEtbSgccGgSpw/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=Kz-7lvtRvkGN0VoIpkRxJoLsaQz5W07scZdtrYVX_XM", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQEtbSgccGgSpw/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=iB2fTzzGOn4jtGruHea7Th6DqBvyiRTc82wa6sDi-JQ", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Employee Relations Specialist at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 1123776908, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Laguna Niguel, California", "title": "Employee Relations Specialist", "startedOn": {"month": 10, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "William (Scott) Slade", "positions": [{"posId": 1123776908, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Laguna Niguel, California", "title": "Employee Relations Specialist", "startedOn": {"month": 10, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 998379016, "new": false, "current": false, "endedOn": {"month": 3, "year": 2017}, "companyName": "13th Marine Expeditionary Unit", "description": "- Proven advisor to top executives of multiple, diverse organizations of up to 7,500 employees. Provided experienced counsel in the development of strategic objectives, policy and administration, manpower management, workforce preservation and security, risk management, equal opportunity, and organizational climate.  \n - Trusted to interpret and apply policy to resolve work related disputes and grievances concerning compensation, benefits, performance, employee relations, and conflict resolution.  \n - Advocated employee well-being by managing prevention programs for substance abuse, suicide prevention, sexual assault, domestic violence, family advocacy and readiness, and work related stress.  Served on multidiscipline committee consisting of lawyers, criminal investigators, family counselors, and command representatives regarding incidents of domestic violence.\n - Served as lead facilitator for all employee professional development.  Designed and delivered instruction on military history, current events, and emerging concepts, utilizing various forms of media and training aids to more than 1,200 midlevel employees. \n - Designed, managed, and served as key leader for professional development and career progression initiatives to include volunteer community service programs and small unit leadership councils. \n- Routinely conducted or directed occupational safety and health assessments of base facilities, training areas and range complexes, port facilities, and housing and group living areas to ensure compliance with all applicable regulations.  \n- Conducted detailed site safety and health inspections, incident and injury/illness investigations, and made recommendations for process improvement and hazard mitigation.  \n", "location": "Camp Pendleton / MCAS Miramar, CA", "title": "Sergeant Major / First Sergeant (Principal Technical Advisor)", "startedOn": {"month": 6, "year": 2005}}, {"posId": 865674090, "new": false, "current": false, "endedOn": {"month": 6, "year": 2005}, "companyName": "Marine Corps Drill Instructor / Operations Manager / Chief Instructor (Training and Development) ", "description": "- Trained, led, and mentored 3,400 entry-level recruits in the fundamentals of service life and the development of discipline, physical fitness, team-building, and pride of belonging.  \n- Functioned as chief instructor responsible to lead, train, and evaluate multiple teams of instructors in training and mentoring entry-level employees. \n- Coordinated scheduling for 14 independent training companies comprised of nearly 8,000 employees, inspected and evaluated training staff, resolved scheduling conflicts, coordinated emergency and evacuation procedures, and led, trained and mentored a ten-person staff.        \n- Recognized for immeasurable contributions to the recruit training process, resulting the highest training statistics of 14 companies.    \n- Developed and implemented a two-day alternate training program to provide deficient employees assistance in completing recruit training requirements resulting in a 75 percent success rate.  \n- Designed and initiated a â\u0080\u009cfamily firstâ\u0080\u009d program to facilitate the flow of information, increase resiliency of instructors and their families, provided tools for adjusting to long work hours.  Resulted in dramatically increased trust in the company leadership, job satisfaction and decreased marital problems.", "location": "MCRD Parris Island, SC", "title": "Training Management and Professional Development", "startedOn": {"month": 5, "year": 2001}}, {"posId": 865671846, "new": false, "current": false, "endedOn": {"month": 5, "year": 2001}, "companyName": "24th MEU / Marine Corps Installations National Capital Region - Regional Contracting Office", "description": "- Appointed Contracting Officer for forward deployed Marine Expeditionary Unit and Marine Corps Installations National Capital Region, Regional Contracting Office.\n- Negotiated over 200 contracts in Spain, France, Italy, Turkey, Greece, Israel, Egypt, and Kuwait in excess of $1.5 million in goods and services.\n- Managed a Simplified Acquisition purchasing cell servicing all southeastern Marine Corps activities for procurement of supplies and repair parts under $25,000.\n- Due to 18-month manning shortfall, concurrently functioned as financial management resource analyst position and effectively managed $2.5 million annual budget from multiple funding sources without discrepancy.    \n- Recognized resource and logistics manager. Planned, implemented, procured, and controlled the flow of goods, services, and equipment, from multiple sources and industries, for numerous offsite training exercises in the United States and abroad.\n- Functioned independently, bounding in advance of mobile organization, contracting for goods and services, within supervisorâ\u0080\u0099s intent, mission objectives, and budgetary and legal restrictions.\n- Consulted with customers to determine requirements, and advised on planning considerations based on market atmospherics, geographical location, and budget and legal limitations.\n- Conducted market research, bidder selection, negotiated pricing, and issued purchase orders for \tmaterials, office equipment, life support items, transportation assets, communication equipment, contracted meals, and lodging.\n- Monitored consumption, analyzed trends, and adjusted requirements flow based on fluctuating manpower levels, effects of weather, and consumption rate.\n- Coordinated delivery, inspection, receipt, distribution, and payment via purchase card or cash \tpayment for goods and services, utilizing multiple domestic and foreign sources of supply.", "location": "Camp Lejeune, NC / MCB Quantico", "title": "Contracting Officer", "startedOn": {"month": 7, "year": 1994}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "William (Scott)", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/william-scott-slade", "location": "Greater San Diego Area"}