{"lastName": "Goetz", "objectUrn": "urn:li:member:277931700", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Legal Services", "educations": [{"endedOn": {"year": 2011}, "fieldsOfStudy": ["Human Resources Management and Services"], "school": "urn:li:fs_salesSchool:18210", "degree": "Master of Business Administration (MBA)", "schoolName": "Ashford University", "startedOn": {"year": 2010}, "eduId": 215958103}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABCQ5rQB4nULuczjPXjgVjgoR6uz1TLydOo,NAME_SEARCH,undefined)", "numOfConnections": 136, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFZCls1oOiXIQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=Z6PBmHQrjt92IOC9QotUz4jsLk_tkljx0a0lX5qFAIc", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFZCls1oOiXIQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=SwosLKGrXRoeBw0I74XwbsRRmWaHQuNdo8gg4Aflnq0", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFZCls1oOiXIQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=hozAGEjwxmG2QIRhVGbFrMP-D0g1tElGeugTg4TcrTA", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFZCls1oOiXIQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=HylOT5V2dbiL_nhL1oOq_OZxIiFZUMvVJjt0LTXY7JI", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Assistant Director at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Director Human Resources\nExperienced Leader, Manager and Instructor with proven success in a variety of venues.  My entrepreneurial spirit and natural leadership skills have allowed me to achieve career growth and a special talent for transitioning strategy into action and achievement. Experienced Human Resources professional with proven achievements in leading and developing overall organizational initiatives. My background in analyzing human capital and operational needs, along with a proven track record of monitoring and retaining key team members has led to a history of growth in a variety of settings. I am looking to utilize my experience in a Human Resources Leadership role with a respected organization that values leadership, creativity and results.", "pendingInvitation": false, "defaultPosition": {"posId": 1026709580, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Human Resources Manager", "location": "Dallas, Texas", "title": "Assistant Director", "startedOn": {"month": 7, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Jovonia Goetz", "positions": [{"posId": 1026709580, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Human Resources Manager", "location": "Dallas, Texas", "title": "Assistant Director", "startedOn": {"month": 7, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 556399783, "new": false, "current": false, "endedOn": {"month": 7, "year": 2017}, "companyName": "Department of Justice/US Attorneys Office", "location": "Dallas, Texas", "title": "Human Resources Director", "startedOn": {"month": 7, "year": 2014}}, {"posId": 528715927, "new": false, "current": false, "endedOn": {"month": 7, "year": 2014}, "companyName": "Federal Government", "description": "*Serves as a full advisor and consultant to the Medical Center Director and entire executive leadership team on a daily basis and takes a proactive role in meeting the needs of top management officials\n*Planning, direction, coordination, operation and internal evaluation of the human resource program for the Medical Center\n*Responsible as a spokesperson and representative in employee/labor relations matters including negotiations with two local unions, preparing disciplinary actions, hearing grievances and preparing terminations\n*Formulates, communicates and implements Medical Center policy involving recruitment and placement, position management, pay administration, employee relations, labor relations, Office of Workers Compensation, retirements, performance management, employee recognition, drug free workplace, training and development and benefits\n*Provides a wide range of human resource management principals, techniques and acceptable practices as well as technical advice on propriety of statutory, regulatory and procedural requirements \n*Advises on most cost effective and efficient manner in which to accomplish the facilityâ\u0080\u0099s mission through he management of its human capital\n*Oversees the departmentâ\u0080\u0099s $750,000 budget on a daily basis to ensure that resources are tracked and utilized in the most effective way that is beneficial to the agency to include manpower, supplies and contracts \n*Actively recruited (400) employees from Physicians, Nurses, Nurse Practitioners, Labors and administrative positions on a daily bases. Via recruitment fairs, networking, regular communication with local colleges and working with key stakeholders in community\n*Oversight of 1737 employees in Medical Center\n*Promotes an environment in which employees are empowered to participate and contribute to mission accomplished", "location": "Hampton, VA", "title": "Director Human Resources", "startedOn": {"month": 11, "year": 2011}}, {"posId": 531819919, "new": false, "current": false, "endedOn": {"month": 11, "year": 2011}, "companyName": "Federal Government", "description": "Plans, organizes and directs the activities of pay banding and general salary section, ensures section complies with legal and regulatory requirements and meets customer needs  \nDeveloped goals and managed recruiting, hiring, training, counseling, managing budgets and seeking ways to improve morale and retention through direct relationships with employees and staff \nResearches, analyses and applies policy guidance to implement assigned programs\nPlans and assigns work for subordinates, sets and adjusts short timer priorities, prepares schedules and prioritizes based on organization priorities \nResponsible for all aspects of hiring, terminations, disciplinary actions, investigations and proper documentation to ensure consistent policies were enforced among labor force. Work very closely with regional counsel on all administrative actions that went to a hearing \nDirected the organizations diversity initiatives, including locating resources, contracting consultants and developing training materials \nEducated division and regional managers on a variety of human resources practices, including diversity, harassment, interviewing and proper documentation disciplinary action and terminations \nOversight of 1900 employees at Space and Missile Command Center \nApproved master leave schedule assuring adequate coverage in all areas of HR\nServed as Co-Chair of the organizationâ\u0080\u0099s Executive Steering Committee to implement strategic support to the human resources function, providing guidance for the long-range direction and goals of organizational planning \nAdeptly handled organizational scheduling changes, staffing shortages, marketing services, and programs Conducted assessments, prioritized funding requests, and constructed detailed budget estimates with justification statements\nSelects or recommends selection of candidates from vacancies, promotions, details and reassignments\nAdvises and provides counsel to employees regarding policies, procedures and directives of management", "title": "Director Human Resources", "startedOn": {"month": 1, "year": 2011}}, {"posId": 531824015, "new": false, "current": false, "endedOn": {"month": 1, "year": 2011}, "companyName": "Federal Government", "description": "Served as Senior HR staff advisor and consultant on a diverse and complex spectrum of HR functions\nKey player on a successful conversion from pay banding to general schedule pay for 1200 employees\nTechnical expert in recruitment, placement, staffing, policy and position management \nConducted business process improvement analysis on current HR policies, procedures and processes to improve coordination and integration of comprehensive solution that myriad the Human Capital concerns\nPlans and schedules work in a manner that promotes  a smooth flow and even distribution\nEstablishes metrics and analysis systems to ensure actions are timely and reviewed for critical points \nIdentifies employees developmental needs and provides or arranges for formal or on-the-job training \nProvides EEO program support including counseling managers, special emphasis program managers and providing technical advise in the affirmative employment process", "location": "Scott AFB, IL", "title": "Human Resources Manager", "startedOn": {"month": 4, "year": 2009}}, {"posId": 531822379, "new": false, "current": false, "endedOn": {"month": 4, "year": 2009}, "companyName": "JFK Consignment", "description": "Designed, developed and implemented new employee orientation package and established and facilitated new employee activities and sessions, providing (for the first time) standardization in all company and benefit information presented verbally and in writing. Saving the company over 30% man hours of training per year.  \nLed budget reconciliation and forecasting/planning activities\nAdministered personnel policies and procedures, including benefits, COBRA, FMLA, Sexual Harassment, annual briefings and workers compensation\nManaged Operations schedule, resulting in zero unplanned downtime and no overstaffing, thus resulting in over $40k dollars saved from previous budget of manpower", "location": "Fairview Heights, IL", "title": "VP, Human Resource Director", "startedOn": {"month": 4, "year": 2002}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Jovonia", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/jovonia-goetz-1300b479", "location": "Huntsville, Alabama Area"}