{"objectUrn": "urn:li:member:138042722", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 1999}, "fieldsOfStudy": ["History"], "school": "urn:li:fs_salesSchool:19370", "degree": "BS", "schoolName": "Furman University", "startedOn": {"year": 1995}, "eduId": 80381043}, {"endedOn": {"year": 1999}, "fieldsOfStudy": ["Political Science"], "school": "urn:li:fs_salesSchool:19370", "degree": "BS", "schoolName": "Furman University", "startedOn": {"year": 1995}, "eduId": 80381148}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAg6XWIBpPwyHKUrWNa-nW4T6X3hkEJcMuc,NAME_SEARCH,undefined)", "numOfConnections": 54, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHKBILBxVWyBQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=YAKIMhwkWu0_gowg4tUr_7WwrjzFt5JJB757OF7UrGA", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHKBILBxVWyBQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=9tmy7HCZ_C7gUvST-qH3fLpejhMd_VB5-GWOMBWrhss", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHKBILBxVWyBQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=PtuXeUqKTEfpRA58rNtMBtkJHkzf51NrAP8rN-QEA9M", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHKBILBxVWyBQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=7Ej67m2U2O6sVVZSrtcxQ5gHWZHjyxcITeALOPBf5NA", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Supervisor, FOIA Analyst at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 335628682, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Supervisor, FOIA Analyst", "startedOn": {"month": 10, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 335628682, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Supervisor, FOIA Analyst", "startedOn": {"month": 10, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 212036061, "new": false, "current": false, "endedOn": {"month": 9, "year": 2012}, "companyName": "USCENTCOM", "description": "Provides vital support for Operations NEW DAWN and ENDURING FREEDOM by serving as the Deputy Chief of Command Records Branch in the HQ United States Central Command (USCENTCOM) Resources and Analysis Division.  Leads 22 military, government, and contractor personnel ensuring compliance with key Federally mandated programs and maintains oversight of the Freedom of Information Act/Privacy Act (FOIA/PA) programs verifying information is properly protected prior to public release. Also responsible for implementing the Records Management program, establishing policy and procedures to capture/preserve the command's official records.", "title": "Deputy, Command Records", "startedOn": {"month": 7, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:45590"}, {"posId": 212163168, "new": false, "current": false, "endedOn": {"month": 6, "year": 2010}, "companyName": "General Dynamics Information Technology", "description": "Responsible for providing telephonic computer support throughout the US Army Europe footprint. Provide basic remote troubleshooting, to include solving software issues, such as with Windows Vista and XP, to include during the transition from XP to Vista, Microsoft Office 2007, Data at Rest, ActivClient, and multiple signature programs, providing administrative support, and advice on IT issues on both the unclassified and classified networks. Assist in the installation of required software and informing users which software is authorized. Responsible for ensuring issues are routed to the proper agency for solving them. Assisted in assuring that the systems on the network were compliant with Department of Defense (DoD) and U.S. Army, Europe (USAREUR) policy and regulations. Provided customers with training on new software and information on impact of updates. Additionally, responsible for assisting customers with updating their PIN on their Common Access Cards (CACs).", "title": "Service Desk Technician", "startedOn": {"month": 6, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:1905"}, {"posId": 212168081, "new": false, "current": false, "endedOn": {"month": 5, "year": 2009}, "companyName": "Multi-National Forces - Iraq", "description": "While deployed to Iraq in support of Operation Iraqi Freedom, served as the MNF-I Request for information (RFI) Manager, and was responsible for processing, tracking, and disseminating Requests for Information (RFIs) originating at US Central Command (CENTCOM), within the MNF-I Headquarters, or from subordinate commands. Ensure that the request reaches the appropriate agency to provide a response, review the response for accuracy, and provide a consolidated response as necessary to the requesting agency. Developed and maintain a system for tracking both open and closed RFIs utilizing Excel and Access programs. Developed an automated, auto-updating daily report used in briefing the Major General in charge of MNF-I Operations Division as to the current status of open RFIs. \n\nAdditional duties include serving as Information Management Officer (IMO) and MNF-I Operations Records Manager. As the IMO, provide IT support (helpdesk type support) to more than 30 customers utilizing Non-Secure Internet Protocol Router Network (NIPR), Secret Internet Protocol Router Network (SIPR) and Coalition Enterprise Regional Information Exchange System (CENTRIXS). Duties include (but are not limited to) installing software, unlocking accounts, and submitting trouble tickets.\n\nAs the Records Manager, responsible for designing a method for capturing all data throughout the directorate that is deemed necessary for historical archives. This information was copied from multiple sources to be stored in a central location.", "location": "Baghdad, Iraq", "title": "Request for Information Manager", "startedOn": {"month": 5, "year": 2008}}, {"posId": 212163452, "new": false, "current": false, "endedOn": {"month": 4, "year": 2008}, "companyName": "General Dynamics Information Technology", "description": "Perform integration, diagnostic testing, repair, installation, configuration, and training of classified tactical and fixed station Video Teleconferencing (VTC) MCUâ\u0080\u0099s, suites, and conference rooms.  These include Tandberg, Polycom, and Aethra Vega II, 8200, and 8400 VTC systems.  Install, configure, and troubleshoot VTC networks consisting of Pairgain/ADC T-Flex High-Speed Digital Subscriber Line (HDSL) modems, Promptus, ADTRAN and RAD IMX-64 ISDN inverse-multiplexers, and through communication links to include Standard Tactical Entry Points (operated by DISA), Tactical communications such as Node Centers switches, Small Extension Nodes, Satellite Vans (85 and 93), and Line of Sight and Tropospheric Scatter systems.  Install, operate, and maintain one-of-a kind deployable Video Multipoint Control Units (MCU).  These include the Polycom/Accord MGC-50 and MGC-100, and RADVISION ViaIP400 MCU systems.  Ensure VTC connections are in standard.  Perform troubleshooting and fault isolation for circuits and equipment.  Provide technical assistance at user's sites with little or no guidance or technical oversight.  Install, operate, and maintain HQ V Corps audio visual display platforms.  These include multi display wall systems such as Jupiter's Vizion and Fusion 960 systems, video codecs, matrix switchers, scan converters, distribution amplifiers and ground loop isolators, projectors, ClearOne digital matrix mixers, AMX/ control system and touch panels.  Install command and control operations centers, conference rooms, and tactical systems including building and layout of cables, connection, installation, configuration, and testing of the equipment.  Provide technical expertise and supervision of VTC systems and Battle Information Command Systems.  Configure the VTC HUB in order to connect via IP, H320, and ISDN.  Build, configure, administer, and monitor VTC conferences.", "title": "Field Service Technician", "startedOn": {"month": 12, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:1905"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/ben-samuel-a022913a", "location": "Orlando, Florida"}