{"lastName": "O'Neill", "objectUrn": "urn:li:member:148098791", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Practice", "educations": [{"endedOn": {"year": 2014}, "fieldsOfStudy": ["Marketing"], "school": "urn:li:fs_salesSchool:18732", "degree": "Master of Arts (M.A.)", "schoolName": "Webster University", "startedOn": {"year": 2013}, "eduId": 211487798}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Hospitality and Tourism"], "school": "urn:li:fs_salesSchool:17727", "degree": "Master of Business Administration (MBA)", "schoolName": "Columbia Southern University", "startedOn": {"year": 2009}, "eduId": 111527768}, {"endedOn": {"year": 2009}, "fieldsOfStudy": ["Professional Management"], "school": "urn:li:fs_salesSchool:18106", "degree": "Bachelor of Science", "schoolName": "Nova Southeastern University", "startedOn": {"year": 2002}, "eduId": 111527619}, {"endedOn": {"year": 1993}, "fieldsOfStudy": ["Paralegal Studies"], "degree": "Associate's degree", "schoolName": "Southern College", "startedOn": {"year": 1991}, "eduId": 116116349}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAjTzucB5GI9YcBlMpsu3v2RIGEqmy9kzuU,NAME_SEARCH,undefined)", "numOfConnections": 203, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFCnR71OZjSrQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=w8x5qls5x5zituLpnzVzdoT_C2cT7gdqUhFfJWF6rjw", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFCnR71OZjSrQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=3nv3eGyN_raeGxY1TM2zjXzfXanA4agBJ7lBHlMrx1k", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFCnR71OZjSrQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=QuZF9Uv25YSG_ziYFlJEGUz63kC0zA2ee7lq66huwMc", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFCnR71OZjSrQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=6jbjCc5JzfjGi77dkJMhxFE_rrbmm3N93ZygyFF5txM", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Staff Assistant at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Seeking position in Public Affairs/Relations/Communications; Marketing; Human Resources; Operations Management; Training/Employee Development; or Executive Administration.\n\nCan be reached via email at: mayraoneill743@gmail.com", "pendingInvitation": false, "defaultPosition": {"posId": 744456537, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE), Office of the Principal Legal Advisor", "title": "Staff Assistant", "startedOn": {"month": 11, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Mayra O'Neill", "positions": [{"posId": 744456537, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE), Office of the Principal Legal Advisor", "title": "Staff Assistant", "startedOn": {"month": 11, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 653906761, "new": false, "current": false, "endedOn": {"month": 11, "year": 2015}, "companyName": "U.S. Department of Veterans Affairs, Veterans Health Administration", "description": "â\u0080¢ Perform work related to public affairs and communication activities such as responding to media inquiries, generating media interest and coordinating agency information and outreach programs. \n\nâ\u0080¢ Organize and coordinate print and broadcast media interviews with subject matter experts. Use a variety of communication techniques and methods including print, broadcast, and electronic media to convey the Veteran Affairs (VA) mission and its role in the community to various stakeholders. \n\nâ\u0080¢ Write news releases, feature stories, speeches, information packets, media kits, and fact sheets and produce various graphic materials such as newsletters, flyers, and brochures. \n\nâ\u0080¢ Provide news clippings to the Regional and Veterans Integrated Service Networks (VISNs) Public Affairs Offices, and other key Veterans Health Administration (VHA) and VA officials in a timely manner. Archive news clip files for use by the agency historians' office and staff; and support media, legislative, community, and staff relations. \n\nâ\u0080¢ Research, prepare, and provide photographs, video or audio tapes, medical center operation data, publications, information papers, and other materials as requested by media outlets or management staff.\n\nâ\u0080¢ Participate as the Public Information Officer (PIO) during emergencies to keep staff informed of ongoing situation. Post messages through Facebook, Twitter, and VA Medical Centerâ\u0080\u0099s external Web page. Update telephone messages to keep the staff and public informed of center closures and operating hours during emergencies.", "location": "Martinsburg, WV", "title": "Public Affairs Specialist", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:23789"}, {"posId": 573570900, "new": false, "current": false, "endedOn": {"month": 11, "year": 2014}, "companyName": "US Small Business Administration", "description": "â\u0080¢ Provided administrative and logistical support to ten ODA Centers located across the United States. \n\nâ\u0080¢ Ensured administrative support functions were both effective and adhere to pertinent policies, laws and regulations in areas that include, but are not limited to preparing payroll records and travel arrangements, reviewing travel claims, maintaining property accountability and other records, and procuring supplies and services.\n \nâ\u0080¢ Compiled reports and notify supervisor of discrepancies. Gather pertinent data for analysis by others. Research appropriate regulations and guidance related to administrative support functions.\n\nâ\u0080¢ Ensured all electronic or written material was grammatically correct, clear, concise and thoroughly researched and such correspondence reflected the agencyâ\u0080\u0099s policies and priorities making sure it integrated with other affected departments.\n\nâ\u0080¢ Completed required volume of work within established guidelines and maintain quality work that was in compliance with established policies and procedures.", "location": "Herndon, VA", "title": "Office of Disaster Assistance, Admin Support Center, Travel Coordinator", "startedOn": {"month": 8, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:166720"}, {"posId": 526633311, "new": false, "current": false, "endedOn": {"month": 7, "year": 2014}, "companyName": "Morgan & Morgan PA", "description": "â\u0080¢ Conduct initial consultation to determine the validity of Veteranâ\u0080\u0099s appeal. \n\nâ\u0080¢ Open cases once it is determined Veteran has a valid claim. \n\nâ\u0080¢ Guide Veteran through the claims process, refer to other resources available if necessary and answer questions as they arise. \n\nâ\u0080¢ Complete and file all VA forms and requests for appeals with the proper office. Handle all contact with the Department of Veterans Affairs. \n\nâ\u0080¢ Obtain necessary evidence and medical records to substantiate Veteranâ\u0080\u0099s claim. Prepare and submit analyses of all evidence related to the claim. \n\nâ\u0080¢ Assist attorney in preparing Veteran for all hearings. \n\nâ\u0080¢ Keep Veteran informed of his/her case status every step of the way.", "location": "Jacksonville, Florida", "title": "Claims/Case Manager Veterans Department", "startedOn": {"month": 4, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:247413"}, {"posId": 502694408, "new": false, "current": false, "endedOn": {"month": 4, "year": 2014}, "companyName": "Morgan & Morgan PA", "description": "â\u0080¢ Interview and collect client information determining qualification for Social Security benefits (Disability, Supplemental Income).\n\nâ\u0080¢ Prepare Social Security claim applications, requests for reconsideration, and appeals.\n\nâ\u0080¢ Keep cases organized by establishing and organizing files; monitoring calendars; meeting deadlines; documenting actions; inputting information into file database and case management software. \n\nâ\u0080¢ Keep clients informed by maintaining contact; communicating case progress.\n\nâ\u0080¢ Accomplish organization goals by accepting ownership for accomplishing new and different requests; explore opportunities to add value to job accomplishments.", "location": "Orlando, Florida", "title": "Social Security Dept. Legal Assistant", "startedOn": {"month": 5, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:247413"}, {"posId": 529254449, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "Transition", "location": "Orlando, Florida", "title": "Retired", "startedOn": {"month": 12, "year": 2012}}, {"posId": 284881228, "new": false, "current": false, "endedOn": {"month": 12, "year": 2012}, "companyName": "US Army", "description": "â\u0080¢ Created higher headquarters Strategic Communications Plans and Public Affairs Standing Operating Procedures to be utilized by all subordinate units. \n \nâ\u0080¢ Designed and produced the 412th Theater Engineer Command, general officer headquarters, first internal information/communication magazine, â\u0080\u009cInside the Castleâ\u0080\u009d, distributed to over 12,000 Soldiers and families.\n\nâ\u0080¢ Designed and produced a Public Affairs recruiting brochure to be utilized by local recruiters and retention noncommissioned officers in an effort to increase unit attrition and promote military journalistsâ\u0080\u0099 career opportunities.\n\nâ\u0080¢ Coordinated training, budgeted meals, lodging and transportation for 20 Soldiers during mobilization and prior to deployment. \n\nâ\u0080¢ 100% success with zero incidents, loss of life, or damage to over $2 million worth of technical and tactical equipment.\n\nâ\u0080¢ Assisted with the writing, production, and dissemination of press releases and media advisories.\n\nâ\u0080¢ Answered media queries, conducted telephone interviews, and arranged interviews with subject matter experts as needed.", "location": "Londonderry, NH", "title": "Chief Public Affairs NCO/Operations & Training NCO", "startedOn": {"month": 6, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 373128421, "new": false, "current": false, "endedOn": {"month": 12, "year": 2011}, "companyName": "Media Operations Center Iraq", "description": "â\u0080¢ Created, produced, and distributed Baghdadâ\u0080\u0099s Media Operations Center daily media summary roll-up, a product disseminated throughout the Iraq Joint Operational Area to provide headquarters, U.S. Embassy in Iraq and partners with situational awareness of the media environment as reported by Western and Pan-Arab news outlets. \n\nâ\u0080¢ Analyzed, copyedited, and proofread more than 6,000 executive summaries depicting the climate in Iraq which greatly enabled leaders to identify and focus on civilian interests and address concerns regarding the United States Forces-Iraq during Operation New Dawn (Jun - Dec 2011).\n\nâ\u0080¢ Assisted with the writing, production, and dissemination of press releases and media advisories.\n\nâ\u0080¢ Answered media queries, conducted telephone interviews, and arranged interviews with subject matter experts as needed.", "location": "Baghdad, Iraq", "title": "Press Desk Officer", "startedOn": {"month": 6, "year": 2011}}, {"posId": 284882406, "new": false, "current": false, "endedOn": {"month": 6, "year": 2007}, "companyName": "US Army", "description": "â\u0080¢ Served as the sole public affairs representative and managed the daily operations of the public affairs section for the 143d Expeditionary Sustainment Command, a general officer headquarters with over 6,000 soldiers, while providing journalistic and photographic support.\n\nâ\u0080¢ Sought out opportunities to increase exposure of the command within the local community and throughout the Army. Coordinated media coverage for all special events.  \n\nâ\u0080¢ Supervised and mentored 10 Public Affairs enlisted soldiers in the absence of leadership.\n\nâ\u0080¢ Instrumental in producing the 143rd Transportation Commandâ\u0080\u0099s first official magazine â\u0080\u009cThe Transporterâ\u0080\u009d, the primary internal communication vehicle keeping leaders, soldiers and families informed.\n\nâ\u0080¢ Prepared press releases; recruited, supported and developed materials for unit public affairs representatives of subordinate units.\n\nâ\u0080¢ Coached general officers, senior leaders, soldiers and family members when conducting print and broadcast interviews.", "location": "Orlando, FL", "title": "Chief Public Affairs NCO/Public Affairs Operations", "startedOn": {"month": 7, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 284882682, "new": false, "current": false, "endedOn": {"month": 6, "year": 2004}, "companyName": "US Army", "description": "â\u0080¢ Instrumental in planning, coordinating, and training 20 unit members for a successful mobilization, deployment and redeployment in support of Operation Iraqi Freedom, Baghdad, Iraq/Camp Doha, Kuwait (Feb 2003 - Mar 2004).\n\nâ\u0080¢ Became the only enlisted member at Third Army Public Affairs Office to serve as a battle captain in the Joint Command Operation Center, Camp Doha, Kuwait. Served as Assistant Editor for the â\u0080\u009cDesert Voice Magazineâ\u0080\u009d, a publication distributed throughout the Central Command area of operations.\n\nâ\u0080¢ Created a standing operating procedure to be utilized as guidance at the battle desk, and to assist in training public affairs officers in the performance of their duties. \n\nâ\u0080¢ Produced press releases, coordinated and facilitated the escort of western and international media outlets, as well as preparing daily situational status reports to be briefed by the Chief Public Affairs Advisor.", "location": "Nashville, TN", "title": "Chief Public Affairs NCO/Operations & Training NCO", "startedOn": {"month": 6, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:1223"}, {"posId": 295920967, "new": false, "current": false, "endedOn": {"month": 6, "year": 2000}, "companyName": "US Army", "description": "â\u0080¢ Managed all administrative activities for the 416th Engineer Command, a general officer headquarters.\n\nâ\u0080¢ Prepared recurring and special reports for the Command Group and Special Staff. \n\nâ\u0080¢ Handled all protocol for the command general officers and command staff. Assisted in scheduling appointments, conferences, travel arrangements, and reservations for two general officers, chief of staff and command sergeant major.\n\nâ\u0080¢ Controlled the planning and execution of all military and official events, including conferences, military balls, awards and farewell ceremonies and dinners for senior officials within the command. \n\nâ\u0080¢ Gathered information and prepared briefing slides for the staff and the command groupâ\u0080\u0099s monthly briefings.\n\nâ\u0080¢ Provided overall protocol, administrative, and linguistic support to the command group and support staff during the Southern Command and WARTRACE Conference involving engineer officers from South and Central America. Ensured all customs and cultural protocol were adhered and properly followed during the conference, lunches, and social gatherings.\n\nâ\u0080¢ Awarded the Meritorious Service Medal for providing exemplary support to Public Affairs, Inspector General and Chaplain to include error free one day turn around on Article 15 investigations for the Judge Advocate General; a personal initiative resulting in 100% compliance for the Command Group during their Army Reserve Command Inspector General inspection.", "location": "Darien, IL", "title": "Executive Administrative Assistant", "startedOn": {"month": 7, "year": 1997}, "companyUrn": "urn:li:fs_salesCompany:1938783"}, {"posId": 295921555, "new": false, "current": false, "endedOn": {"month": 7, "year": 1997}, "companyName": "US Army", "description": "â\u0080¢ Worked directly for the Hospital Commander and the Staff Supervisory Assistant of an Army Reserve General Hospital and Major Subordinate Command Headquarters of 525 personnel. \n\nâ\u0080¢ Selected to assist with the management of the units training and operations.\n\nâ\u0080¢ Processed request for annual training orders and temporary duty orders for over 300 personnel on a daily basis. \n\nâ\u0080¢ Managed and tracked all travel arrangements to include airline travel, rental car reservations, and lodging for all personnel going on special assignments. \n\nâ\u0080¢ Reviewed and submitted 100% of all travel reports receiving zero returns or rejections from travel operations.\n\nâ\u0080¢ Scheduled up to 200 physicals per month. Reviewed and made distribution on all completed physicals and scheduled those needing further testing or treatment.", "location": "Durham, NC", "title": "Executive Administrative Assistant", "startedOn": {"month": 7, "year": 1994}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Mayra", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/mayra-o-neill-39b72141", "location": "Washington D.C. Metro Area"}