{"objectUrn": "urn:li:member:508718046", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2013}, "fieldsOfStudy": ["Social Science"], "school": "urn:li:fs_salesSchool:32142", "degree": "Bachelor's degree", "schoolName": "Brandman University, Part of the Chapman University System", "startedOn": {"year": 2005}, "eduId": 351696122}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAB5Sa94BYPCSo_-HxdCWptI5nnGQekdpcoQ,NAME_SEARCH,undefined)", "numOfConnections": 0, "showTotalConnectionsPage": false, "headline": "Deportation Officer at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Law enforcement professional with a Bachelor's Degree in Social Science and a Certificate of Completion of an Executive Leadership Program through the USDA Graduate School. Qualifications also include 19 yearsâ\u0080\u0099 of experience in homeland security, corrections, and patrol.  As a law enforcement officer I developed outstanding leadership capabilities managing and guiding a team of subordinate law enforcement officers, knowledge of safety and security of a detention facility, investigative and criminal procedures. I have the experience and ability to handle deadline-oriented and crisis situations. ", "pendingInvitation": false, "defaultPosition": {"posId": 1292488882, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Tasked with the enforcement of all Immigration laws and the federal laws as enacted under the Homeland Security Act of 2002. - Apprehend and arrested persons who violate Federal laws, and conducted searches and seizures incident to an arrest or pursuant to a warrant. - Maintained Quarterly qualification with service weapon, pepper spray, baton, and use of force training. - Completed time sensitive tasking as assigned by upper management. - Coordinated allocated bed space for criminal aliens in Immigration and Customs Enforcement custody pending removal proceedings at detention facilities nationwide. - Conducted investigations on criminal aliens claiming United States Citizenship and prepared investigative reports. - Interviewed all subjects suspected of violations of Federal laws. - Reviewed and analyzed cases to determine adequacy of initial action by apprehending officers. - After determining the completeness of cases for legal sufficiency, prepares documentation for Warrants of Arrest, Warrants of Deportation, Breaches of Bond, Demands of Surrender, and Notices of Excludable Alien. ", "location": "Pearsall, TX", "title": "Deportation Officer", "startedOn": {"month": 2, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": -1, "fullName": "", "positions": [{"posId": 1292488882, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Tasked with the enforcement of all Immigration laws and the federal laws as enacted under the Homeland Security Act of 2002. - Apprehend and arrested persons who violate Federal laws, and conducted searches and seizures incident to an arrest or pursuant to a warrant. - Maintained Quarterly qualification with service weapon, pepper spray, baton, and use of force training. - Completed time sensitive tasking as assigned by upper management. - Coordinated allocated bed space for criminal aliens in Immigration and Customs Enforcement custody pending removal proceedings at detention facilities nationwide. - Conducted investigations on criminal aliens claiming United States Citizenship and prepared investigative reports. - Interviewed all subjects suspected of violations of Federal laws. - Reviewed and analyzed cases to determine adequacy of initial action by apprehending officers. - After determining the completeness of cases for legal sufficiency, prepares documentation for Warrants of Arrest, Warrants of Deportation, Breaches of Bond, Demands of Surrender, and Notices of Excludable Alien. ", "location": "Pearsall, TX", "title": "Deportation Officer", "startedOn": {"month": 2, "year": 2018}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 816732888, "new": false, "current": false, "endedOn": {"month": 2, "year": 2018}, "companyName": "U.S. Department of Homeland Security", "description": "Assigned to the Fugitive Operations Team where I identified, locate, and arrest fugitive aliens, aliens that have been previously removed from the United States, removable aliens who have been convicted of crimes, as well as aliens who enter the United States illegally or otherwise defy the integrity of our immigration laws and border control efforts.  Interview subjects to gather critical information and evidence for verification and corroboration to determine if any immigration violation has occurred.\nInitiate criminal and civil proceedings against immigration violators, and take sworn statements in order to obtain admissible information pertaining to aliensâ\u0080\u0099 citizenship and immigration history.\nConducts legal research to support the Department of Homeland Security (DHS), ICE/ERO decisions on deportation/exclusion cases.  \nApprehend and arrest persons who violate Federal laws, and conduct searches and seizures incident to an arrest or pursuant to a warrant.\nDetermine legal sufficiency to identify and process for removal individuals who have violated federal immigration laws and who meet agency prosecutorial guidelines.\tEstablish custody conditions and prepare formal detailed documentation for the purpose of adjudicating and responding to applications for immigration benefits or relief, including bonds, parole, voluntary departure, stays of removal, and deferred action. \nPresent cases for criminal and administrative proceedings to federal attorneys. \t\nPrepare criminal complaints through affidavits, development of facts, and gathering evidence to support criminal prosecution.\t\nEstablishes and maintains liaison with local, state, and other federal law enforcement officials, along with foreign governments and embassies/consulates and with public interest groups.\nEnsured the physical removal of aliens from the United States via foreign and domestic escorts as per agency policy.\n", "location": "Harlingen, Texas", "title": "Deportation Officer", "startedOn": {"month": 10, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 1292494137, "new": false, "current": false, "endedOn": {"month": 10, "year": 2014}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "MANAGEMENT:  Supervising/Training - Supervised a staff of Immigration Enforcement Agents assigned to the shift. - I have had extensive experience, gained as a supervisor, in inspiring, motivating, and guiding others toward the accomplishment of goals by monitoring their work and providing guidance, training, and direction as needed.- Assigned work to subordinates based on priorities, selective consideration of the difficulty and requirement of assignments, and the capabilities of employees. - Evaluated work performance of subordinates and nominated employees for awards. - Trained subordinate officers on investigative techniques and results-driven intelligence operations. - Assigned work to subordinates based on priorities, selective consideration of the difficulty and requirement of assignments, and the capabilities of employees. - Evaluated work performance of subordinates and nominate employees for awards. - Reviewed work products of subordinates by approving, rejecting, or correcting the submitted work products. - Conducted independent reviews and analyses of resource requests, prioritizing approvals based on current resource levels and existing policies. - Developed and prepared budget requests and proposed expenditures to support the department's mission, taking into account staffing, facilities, and equipment. - Measured and estimated workload levels and the personnel levels needed to address the unitsâ\u0080\u0099 workload.- Maintained accountability of employee training by scheduling employees for required training, and maintain documentation of completed courses. - Oversaw the removal docket ensuring that various IEAâ\u0080\u0099s, ERAâ\u0080\u0099s and various support staff removed and closed out cases in accordance of policy.  - Establishes and maintains liaison with local, state, and other federal law enforcement officials, along with foreign governments and embassies/consulates and with public interest groups. ", "location": "San Diego, CA", "title": "Supervisory Immigration Enforcement Agent", "startedOn": {"month": 8, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1303353523, "new": false, "current": false, "endedOn": {"month": 8, "year": 2008}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Assigned to the San Diego Field Office Criminal Alien Program where I visited correctional facilities and Interviewed subjects, targets and witnesses for information verification and corroboration to determine their country of origin.\n-\tConfirmed a subject's identities, and initiated criminal proceedings against the immigration status violators.\n-\tConducts legal research to support the Department of Homeland Security (DHS),\n-\tICE/DRO decisions on deportation/exclusion cases. \n-\tApprehend and arrest persons who violate Federal laws, and conduct searches and seizures incident to an arrest or pursuant to a warrant.\n-\tInterview all subjects suspected of violations of Federal laws.\n-\tPlaced aliens in removal proceedings by preparing Notices to Appear citing with INA 212 and INA 237 charges, Reinstatements of Previous Orders of Removal, Stipulated Removals, Administrative Removals, and Voluntary Departures.\n-\tRan checks through the various computer systems such as TECS, NCIC, CLAIMS, CCDI, ISRS, and ENFORCE.\n-\tPerformed case management of assigned cases from initial receipt of detained/apprehended aliens through effecting their physical removal from the U.S.\n-\tEstablishes and maintains liaison with local, state, and other federal law enforcement officials, along with foreign governments and embassies/consulates and with public interest groups.\n-\tInvestigated cases referred by U.S. Citizenship and Immigration Services for further determination of prosecution and deportability.\n-\tEnsured the physical removal of aliens from the United States via foreign and domestic escorts as per agency policy.\n-\tAssisted the Fugitive Operation Unit and the street team in field operations.\n", "location": "Greater San Diego Area", "title": "Immigration Enforcement Agent ", "startedOn": {"month": 8, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1303355157, "new": false, "current": false, "endedOn": {"month": 8, "year": 2003}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "While assigned to the Indio Border Patrol Station I worked as a Detention Enforcement Officer on shift and maintained custody and control of detainees.\n-\tResponded to Border Patrol Agents requests for assistance in the field to acquire control of detained alien groups, which ranged from 1 to 40 at a time, and transported them to the Border Patrol Station for processing.\n-\tReceived property from incoming detainees, provided receipts and inspected items for contraband.\n-\tConducted pre-trip and post-trip equipment inspections of transport vehicles and equipment.\n-\tMonitored detainee behavior to prevent crime, escape attempts and other dangerous activities.\n-\tMaintained records and logs of man hours, materials and equipment used.\n-\tConducted internal security checks and distributed meals.\n-\tProcessed aliens by taking fingerprints, photos, and inputting information into ENFORCE.\n-\tMaintained appropriate control, security and well-being of detainee at all times.\n-\tMaintained correct physical head count at all times.\n-\tTrained new Border Patrol Agents in detention techniques of illegal aliens in the holding cells, and in proper and safe removal techniques.\n-\tWorked with other law enforcement officials to identify and apprehend aliens.\n", "location": "Indio, CA", "title": "Detention Enforcement Officer ", "startedOn": {"month": 1, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1303356252, "new": false, "current": false, "endedOn": {"month": 1, "year": 2003}, "companyName": "US Navy", "description": "Performed basic law enforcement duties maintained order, responded to emergencies and enforced federal (Uniform Code of Military Justice) and local laws.\n-\tInspected squad vehicle and weapons daily and arranged for routine and special maintenance.\n-\tPatrolled designated districts in patrol cars, on bicycles and on foot.\n-\tResponded to and investigated security and burglar alarms.\n-\tDefused volatile situations, (i.e. domestic violence, drunk and disorderly, and driving while intoxicated calls).\n-\tIssued citations for personally observed violations of law, rules or regulations.\n-\tConducted preliminary investigations of traffic and criminal incidents.\n-\tOrganized and recorded facts to prepare incident reports.\n-\tWrote reports on arrests made, activities performed and unusual incidents observed.\n-\tTestified as required in military or civilian courts and hearings.\n-\tOn occasion, I participated in short term investigations under the control of detectives.\n-\tControlled accesses to bases by ensuring vehicles and personnel accessing military installations and buildings had the appropriate entry credentials.\n", "location": "Greater San Diego Area", "title": "Police Officer", "startedOn": {"month": 5, "year": 2002}, "companyUrn": "urn:li:fs_salesCompany:1335"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/anthony-martinez-026451122", "location": "San Antonio, Texas Area"}