{"lastName": "Kerns", "objectUrn": "urn:li:member:17749451", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Administration", "educations": [{"endedOn": {"year": 2002}, "fieldsOfStudy": ["Strategic Studies"], "degree": "MA", "schoolName": "US Army War College", "startedOn": {"year": 2000}, "eduId": 15900522}, {"endedOn": {"year": 1989}, "fieldsOfStudy": ["Economics"], "school": "urn:li:fs_salesSchool:18010", "degree": "MA", "schoolName": "University of Colorado Denver", "startedOn": {"year": 1985}, "eduId": 15900443}, {"endedOn": {"year": 1977}, "fieldsOfStudy": ["Economics"], "school": "urn:li:fs_salesSchool:17950", "degree": "BA", "schoolName": "University of California, Los Angeles", "startedOn": {"year": 1973}, "eduId": 14182370}, {"fieldsOfStudy": ["Strategic Studies"], "degree": "M.A", "schoolName": "Army War College", "eduId": 76371262}, {"schoolName": "Canadian Forces Command and General Staff College", "eduId": 76371261}, {"endedOn": {"year": 1991}, "schoolName": "US Army Command and General Staff College", "eduId": 76371264}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAEO1csB8m-OD2FMMaK5fy8Y_EiBeJilVvo,NAME_SEARCH,undefined)", "numOfConnections": 132, "showTotalConnectionsPage": false, "headline": "Director, Budget and Program Performance at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 559913417, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Manage daily budget operations for a $5.7B component of the Department of Homeland Security. Responsibilities include developing long-term (5 year) resource plans, OMB budget submissions, Congressional Justification Books, senior leader Congressional testimony; responding to Congressional, OMB, DHS, ICE senior leader inquiries and questions, developing responses to â\u0080\u009cquestions for the record,â\u0080\u009d managing daily execution of an operation that stretches across the US and in multiple offices around the world.\nâ\u0080¢ Directed efforts leading up to submission of $1.1B supplemental appropriations request to support measures associated with Unaccompanied Alien Children and Alien Families.", "title": "Director, Budget and Program Performance", "startedOn": {"month": 6, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Kevin Kerns", "positions": [{"posId": 559913417, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Manage daily budget operations for a $5.7B component of the Department of Homeland Security. Responsibilities include developing long-term (5 year) resource plans, OMB budget submissions, Congressional Justification Books, senior leader Congressional testimony; responding to Congressional, OMB, DHS, ICE senior leader inquiries and questions, developing responses to â\u0080\u009cquestions for the record,â\u0080\u009d managing daily execution of an operation that stretches across the US and in multiple offices around the world.\nâ\u0080¢ Directed efforts leading up to submission of $1.1B supplemental appropriations request to support measures associated with Unaccompanied Alien Children and Alien Families.", "title": "Director, Budget and Program Performance", "startedOn": {"month": 6, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 559914242, "new": false, "current": false, "endedOn": {"month": 5, "year": 2014}, "companyName": "US Citizenship and Immigration Services", "description": "03/14-05/14, ACTING CHIEF OF STAFF, IMMIGRANT INVESTOR PROGRAM OFFICE (IPO), Department of Homeland Security, Atlanta, GA.  GS-1801/15. Served as first ever Chief of Staff for new USCIS office standing up to manage the immigrant investor program (EB-5). Responsible to assist the Chief, Immigrant Investor Program stand up new office, manage financial and human resources, plan moves, prepare congressional reports, identify and resolve problems preventing effective application adjudication.\nâ\u0080¢ Developed position descriptions for all direct reports to the Chief, Immigrant Investor Program, including the deputy, section managers, chief of staff and supervisor Management Program Analysts.\nâ\u0080¢ Successfully gained Chief, IPO approval for a Records Manager and Customer Engagement Branch Chief.\nâ\u0080¢ Began first effort to analyze productivity and constriction points, and propose corrective action. \nâ\u0080¢ Developed resource plan to guide the office and eventually return money to Field Operations Directorate for reuse with Regions.\nâ\u0080¢ Developed initial plan for moving to new office location and renovating existing office for planned occupants. \nâ\u0080¢ Prepared first ever report to Congress on the status of the Immigrant Investor Program (EB-5).\nâ\u0080¢ Developed matrix of office performance measures to manage the IPO and support USCIS performance management.\nâ\u0080¢ Served on Field Operations Directorate working group to improve budgeting. \nSupervisor: Mr. Nick Colucci (SES), (202) 272-2980, May Contact", "title": "Acting Chief of Staff, Immigrant Investor Program Office", "startedOn": {"month": 3, "year": 2014}}, {"posId": 26361164, "new": false, "current": false, "endedOn": {"month": 3, "year": 2014}, "companyName": "US Citizenship and Immigration Services", "description": "03/08-03/10, 08/10-11/11, 03/12-07/12, 10/12 -1/13, 5/13-3/14 CHIEF OF STAFF, CITIZENSHIP AND IMMIGRATION SERVICES DISTRICT 8, Department of Homeland Security, Atlanta, GA. GS-301/15. Serve as first ever Chief of Staff, directing activities of subordinate managers, supervisors and expert staff responsible for coordinating and executing District efforts in budget; congressional, media and community liaison; administrative and contract support, planning, workload analysis, union relations, EEO, fraud prevention, quality assurance, human resource management, safety, security, emergency preparedness, and all issues which cross operational/administrative lines for a four-state district. Represent Regional or District Director in conferences. \nâ\u0080¢ Implemented District-wide production management system to track and measure production from individual through district level for first time in organizationâ\u0080\u0099s history. System tracks progress toward monthly and annual goals, guides resource alignment and provides insight into needed corrective actions.\n \nâ\u0080¢ Coordinated and led District efforts associated with our efforts as a pilot city targeting the unauthorized practice of immigration law.\nâ\u0080¢ Coordinated the outreach activities to underserved portions of Alabama.\nâ\u0080¢ Improved file transfer request timeliness from the high 70% range to 100% in all offices.\nâ\u0080¢ Through consistent use of the data, transformed the District into one where decisions are fact-based.\nâ\u0080¢ Guided all District leadership through strategy development sessions that resulted in the District having a coherent set of goals, objectives and tasks for the first time in its history. These goals directly support the agency goals.\nâ\u0080¢ Developed production planning tools to guide daily, weekly, monthly and quarterly efforts across the District. The result of these tools, use of lean six sigma techniques, and mentoring of subordinates has made the District a consistent success.", "title": "Chief of Staff, District 8", "startedOn": {"month": 3, "year": 2008}}, {"posId": 559914607, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "US Citizenship and Immgration Services", "description": "I lead the sixth largest field office/third largest ASC in the Nation, comprised of 100 civilians and contractors charged with applying immigration laws and adjudicating 30,000 applications for legal residency, change of status and citizenship in Alabama and Georgia a year. Coordinate effort among all Department of Homeland Security Agencies to maintain and account for 42,000 classified and unclassified immigration files. Responsible for coordinating with Immigration Lawyers, Community Based Organizations and government agencies engaged in Immigrations.  I held this position concurrent with managing typical Chief of Staff responsibilities.", "title": "Acting Field Office Director", "startedOn": {"month": 10, "year": 2012}}, {"posId": 559913655, "new": false, "current": false, "endedOn": {"month": 10, "year": 2012}, "companyName": "TSA", "description": "Assigned to one of the nationâ\u0080\u0099s top category X airports as part of a DHS SES Candidate Development Program detail assignment.  \nâ\u0080¢ Working alongside an experienced FSD and Deputy FSD, I completed a performance improvement assessment of their leadership, strategy development, customer focus, knowledge management, workforce, process management systems, and results. This included assessing the entire organizational structure and management systems required for short- and long-term management; employee accountability, use and development; leveraging technology and utilization of data; and contract- management interactions.\nâ\u0080¢ Identified corrective actions to ensure necessary maintenance/system testing was accomplished in advance of requirement.\nâ\u0080¢ Developed cross cutting issue matrix, identifying key systemic issues that when addressed will aid the necessary change to bring the organization to the next level of performance.\nâ\u0080¢ Developed management tool to quickly identify necessary screening lanes by hour, by day, for the summer season. The tool visually displayed periods of peak and low demand. \nâ\u0080¢ Developed draft strategic action plan to address key weaknesses identified in the assessment and guide change. Prior to my departure the FSD had put in motion some of the actions.\nâ\u0080¢ Participated in interactions with federal, state, and local officials regarding airport operations, security policies, procedures, and practices at the airport.", "title": "Acting Deputy Federal Security Director", "startedOn": {"month": 7, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 559913610, "new": false, "current": false, "endedOn": {"month": 3, "year": 2012}, "companyName": "FEMA", "description": "Assigned to the above position as part of the DHS SES Candidate Development Program detail assignment. Managed the staff to ensure routine operations and proper execution of CDP missions. Ensured required operations supporting contracting, finance, facilities/property acquisition and maintenance, training and curriculum development, planning, logistics, IT, administration, legal, Dormitory/Dining operations and Human Resources were coordinated, legal, efficient and in line with Superintendentâ\u0080\u0099s overall Direction. Oversee development of 3-, 5-, 10-year plan, policies and guidance supporting school that trains 12-14,000 students on site, 70,000 students remotely every year. Represent the Superintendent in meetings with FEMA and DHS headquarters personnel. \nâ\u0080¢ Developed first ever 3-, 5-, 10-year plan in CDPâ\u0080\u0099s 13 year existence.\nâ\u0080¢ Guided actions that culminated in the purchase of $3.5M in property/facility acquisition, and begun actions to acquire $2M indoor gym/pool facility.\nâ\u0080¢ Served on contract award fee boards, reviewed/approved major contract performance work statements.", "title": "Acting Deputy Superintendent, Center of Domestic Preparedness", "startedOn": {"month": 11, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:2995"}, {"posId": 201936056, "new": false, "current": false, "endedOn": {"month": 8, "year": 2010}, "companyName": "ATLANTA FIELD OFFICE CITIZENSHIP AND IMMIGRATION SERVICES DISTRICT 8", "description": "For six months, I lead the sixth largest field office/third largest ASC in the Nation, comprised of 100 civilians and contractors charged with applying immigration laws and adjudicating 30,000 applications for legal residency, change of status and citizenship in Alabama and Georgia a year. Coordinate effort among all Department of Homeland Security Agencies to maintain and account for 42,000 classified and unclassified immigration files. Responsible for coordinating with Immigration Lawyers, Community Based Organizations and government agencies engaged in Immigrations.  \n* Realigned personnel work assignments enabling the office to achieve and then maintain major application cycle time goals for the first time in FY10 and throughout my tenure.\n* Improved customer response time in customer service unit by 9% to meet and then exceed established goals. \n* Improved overall training to the office by devoting one day a month to training, bringing in additional resources for subjects like ethics, safety, security, CARRP, prosecutorial discretion and SRMT management.\n* Improved file accountability from 88%  to an overall 95% file accountability rating.\n* Managed Military Accessions Vital to National Security program and Military Naturalizations by conducting immigration related work on Army bases throughout Georgia and Alabama.\n* Reduced backlog of CARRP cases under office control from 34 to 10 in six months. \n* Serve as lead District negotiator for supplemental bargaining negotiations that resulted in agreement on 85% of all items. During my tenure as the Acting FOD, the office had no union grievances filed.\nGS-1801/15, Ms. Denise M. Frazier (SES), (770) 508-1866, May Contact, $127,000", "title": "Acting Field Office Director", "startedOn": {"month": 3, "year": 2010}}, {"posId": 201936048, "new": false, "current": false, "endedOn": {"month": 3, "year": 2008}, "companyName": "US ARMY FORCES COMMAND", "description": "Serve as first Business Transformation Director, one specifically chosen by the Commanding General. Use a 4 person staff to guide one of the largest command's in Department of Defense BT effort, reporting to the Deputy Commanding General for operational direction. Deployed Lean Six Sigma methodology for improving processes and improving performance. Charged with setting up a program management office, deployment of Lean Six Sigma to subordinate units across the United States to improve organization's performance. Responsible for reorganization studies/implementation plans of 1500 person headquarters to support new missions. Position requires me to deal diplomatically with senior officials to lead them to see the need for change and guide their efforts.", "location": "Ft. McPherson, GA", "title": "Business Transformation Manager", "startedOn": {"month": 3, "year": 2007}}, {"posId": 201936049, "new": false, "current": false, "endedOn": {"month": 3, "year": 2008}, "companyName": "US Army Forces Command", "title": "Colonel", "startedOn": {"month": 3, "year": 2007}}, {"posId": 28418852, "new": false, "current": false, "endedOn": {"month": 7, "year": 2006}, "companyName": "Deputy CFO/ Deputy G8", "title": "Deputy CFO/ Deputy G8", "startedOn": {"month": 8, "year": 2003}}, {"posId": 201936070, "new": false, "current": false, "endedOn": {"month": 7, "year": 2006}, "companyName": "G8, US ARMY FORCES COMMAND", "description": "Serves as Deputy CFO, a SES/Brigadier General position, supervising 112 people in 4 divisions, for an organization with an annual budget over $22B, supporting 750,000 soldiers, civilians and contractors deployed around the world in Iraq, Afghanistan and other locations abroad as well as multiple organizations in 17 locations across the continental US.  Major responsibilities include overseeing command's resource efforts and Program Management in multiple appropriations. Specifically responsible for planning and programming expenditures over 7-year horizon, budgeting formulation for 12-24 months out, budget execution of current and prior year funds, financial systems, systems and accounting policies and performance, accounting of expenditures, security, resource management IT, funding responses to natural disasters overseas contingency operations, relations with congressional appropriation committees, manpower management, strategic human resource planning and daily human resource management, Lean Six Sigma deployment and business transformation; supply and property management, and office administration.", "location": "Ft. McPherson, GA", "title": "Deputy CFO (Deputy Chief of Staff, G8)", "startedOn": {"month": 8, "year": 2003}}, {"posId": 201936028, "new": false, "current": false, "endedOn": {"month": 8, "year": 2003}, "companyName": "US ARMY FORCES COMMAND BUDGET DIVISION", "description": "Supervise 30 people in 3 Branches, develops strategies, budgets and supervising execution of $5B annual budget supporting 750,000 soldiers, civilians and contractors at 17 major installations in the United States (with combined population equal; and hundreds of units located worldwide.", "title": "Chief, Budget Office", "startedOn": {"month": 5, "year": 2000}}, {"posId": 201936071, "new": false, "current": false, "endedOn": {"month": 5, "year": 2000}, "companyName": "Maneuver Support Center", "description": "Supervise 60 person staff, developing programs and executing $150M annual budget for a military installation's city services such as feeding, facilities maintenance, repair and modernization, environmental protection, historical site preservation, equipment servicing, vehicle usage, information technology, telecommunications, acquisition support; and training, education and product development missions supporting the training of 30,000 Soldiers, Airmen, Sailors and Marines learning in the Chemical, Military Police and Engineer fields. Oversee post's accounting activities, and direct installation's quality management, strategic human resource management and strategic planning efforts.", "title": "DIRECTOR OF RESOURCE MANAGEMENT,  Engineer School", "startedOn": {"month": 6, "year": 1995}}, {"posId": 29296335, "new": false, "current": false, "endedOn": {"month": 5, "year": 2000}, "companyName": "US Army Maneuver Support Center", "description": "Responsible for Ft. Leonard Wood, MO $130-$160M installation budget supporting all training, combat developments, training developments and infrastructure. Responsible for all fiscal aspects associated with $300M/5 year 1995 base realignment and closure legislation impacting Ft. Wood.", "title": "Director of Resource Management", "startedOn": {"month": 5, "year": 1995}}, {"posId": 201936072, "new": false, "current": false, "endedOn": {"month": 6, "year": 1995}, "companyName": "the Army", "description": "* Organization recognized as leader for diversity and supporting Equal Opportunity programs, and personnel development.\n* Developed Risk management matrix to focus command's effort, management controls and resources.\nColonel, position equivalent to GS 505/340-15 series, Major General (retired) Clair Gill, (703) 748-2171, Contact okay. Lieutenant General Robert Flowers, unknown. $54,700-$77,600.; Developed, coordinated, defended and integrated Army's strategic intelligence programs and budget requirements within the Department of Defense and other Federal Agencies; developed congressional justification strategy and legislative issues. \n* Planned 30 percent reduction in funding across multiple appropriations (RDTE, OPA, OMA, MPA) supporting Army's strategic intelligence programs in one year, while maintaining desired capabilities. (Amount of funding was classified.)\n* Created and implemented an action plan to defend budget to Congress which increased Army intelligence funding $10M above budgeted amount two years in a row. During this same period all other Services and Intelligence Agencies saw either no increase or a budget reduction.\n* Co-authored and pushed several legislative issues subsequently enacted into law.\n* Initiated informal coalitions with other Services to preserve critical Intelligence capabilities. \n* Created and implemented a system of Program reviews to provide feedback, guide research and development, procurement and inform strategic planning for Army intelligence capabilities.\nLieutenant Colonel, position equivalent to GS-340-14 series", "title": "CHIEF OF PROGRAM AND BUDGET INTEGRATION, Deputy Chief of Staff for Intelligence", "startedOn": {"month": 7, "year": 1992}}, {"posId": 201936073, "new": false, "current": false, "endedOn": {"month": 6, "year": 1991}, "companyName": "Denver Recruiting Battalion", "description": "positions most closely align to GS 340 series. Served as leader/commander in platoons, companies, battalions, brigades and divisions of various Armor units in the U.S. Army.  Served as Chief Force Modernization, 2nd Armored Division (Forward). Served; Responsible for daily efforts of 130 recruiters in 25 locations across Colorado and Wyoming to recruit, screen, test, and process men and women into the Army.", "title": "Second Lieutenant-Lieutenant Colonel", "startedOn": {"month": 6, "year": 1977}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Kevin", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/kevin-kerns-80bb3b5", "location": "Greater Atlanta Area"}