{"lastName": "Cirocco", "objectUrn": "urn:li:member:4460528", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Accounting", "educations": [{"endedOn": {"year": 1988}, "fieldsOfStudy": ["Business Administration, Management and Operations"], "school": "urn:li:fs_salesSchool:17832", "degree": "Master's Degree", "schoolName": "California State University-Sacramento", "eduId": 39048040}, {"fieldsOfStudy": ["English/Business"], "school": "urn:li:fs_salesSchool:17832", "degree": "Bachelor's Degree", "schoolName": "California State University-Sacramento", "eduId": 39050216}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAABED_ABDajZZkv3z1mzczEHeDUZ50BMUHY,NAME_SEARCH,undefined)", "numOfConnections": 389, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQExnUasQUkH5A/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=n-L0ueM1LeLlbJ9kCiMRXDnqJKi0EI6lgReGXYrlci8", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQExnUasQUkH5A/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=J9jFXVaPnfQhrSd9AAiKVe_1iMnSoprFPb3BROfLQ8c", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQExnUasQUkH5A/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=28GpwUqwftLaeq6Vt_3193dZgoka288rs6PFVEjSH5k", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQExnUasQUkH5A/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=qYlDt7ibFtgiR_rThgfpwUQMFqwvZf8fPEjn9gRE1qk", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Supervisory Systems Accountant at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Significant experience in Leadership, Accounting, Audit, Systems, Budgets & Forecasting, Tax and Business Ownership \nThis background combined with strong team building and relationship focus, continuing education and personal drive for improvement, has consistently provided the basis for exceptional results.", "pendingInvitation": false, "defaultPosition": {"posId": 1029556248, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Dallas/Fort Worth Area", "title": "Finance Accounting Manager", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Sue Evans Cirocco", "positions": [{"posId": 1029556248, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Dallas/Fort Worth Area", "title": "Finance Accounting Manager", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 354762103, "new": false, "current": false, "endedOn": {"month": 12, "year": 2015}, "companyName": "U.S. Small Business Administration", "description": "â\u0080¢\tLead the Denver Finance Organization (62 staff). The organization provides the Small Business Administration (SBA) with the following Agency-wide Financial, Accounting and Reporting Operational Services: Financial Reporting, U.S. Standard General Ledger (USSGL) Accounting, Financial Assurance, Loan Program Accounting, Cash/Treasury, and Disbursement functions.", "location": "Denver Finance Center", "title": "Director Of Finance", "startedOn": {"month": 12, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:166720"}, {"posId": 92173309, "new": false, "current": false, "endedOn": {"month": 12, "year": 2012}, "companyName": "US Small Business Administration", "description": "â\u0080¢\tLed and managed a team (20 staff) of Accountants specializing in SBA loan accounting.  The team provides technical loan accounting expertise to 7 Nationwide Service Centers and multiple Washington D.C. headquarters Program Offices representing all of the Agencyâ\u0080\u0099s loan programs and the Surety Bond Guaranty Program\nâ\u0080¢\tProvided ongoing consultation to senior management throughout the Agency on financial policies and plans related to a wide variety of complex loan program issues\nâ\u0080¢\tEstablished quarterly quality metrics for the accounting work produced by the PAD team\nâ\u0080¢\tWorked collaboratively with the Office of Financial Systems (OFS) to develop and implement several initiatives to innovatively address the unique requirements of  the American Recovery and Reinvestment Act (ARRA), improve productivity and enhance internal controls, allowing \nPAD to handle increasing workload (106,000 JVâ\u0080\u0099s in FY11 vs. 85,000 JVâ\u0080\u0099s in FY10 - 24.7% increase) while maintaining quality metrics and without adding staff, including:\no\tA paperless JV entry system â\u0080\u0093 in production October 1, 2011\no\tEnhancements to the Misc Payment Processing System (MPPS) significantly reducing manual data entry and improving internal control \no\treducing $25M in outstanding receivables \no\tHosted a well-received, first time, training seminar for a geographically and technically diverse group of â\u0080\u009cSuper Usersâ\u0080\u009d from the Agencyâ\u0080\u0099s Processing Centers", "title": "Division Manager", "startedOn": {"month": 8, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:166720"}, {"posId": 6079012, "new": false, "current": false, "endedOn": {"month": 11, "year": 2007}, "companyName": "Accounting Acumen, P.C.", "description": "â\u0080¢\tUsed innovative marketing program to develop & grow a thriving accounting practice of more than 250 small businesses from a handful of individual tax clients.  Sold practice to two CPAâ\u0080\u0099s and Paychex, Inc.  in 2007\nâ\u0080¢\tVoted â\u0080\u009cbest of the bestâ\u0080\u009d by Colorado Community Newspapers (CCN) subscribers for Best CPA and tax services in 2006.\nâ\u0080¢\tTrained and developed sales and service representatives to bring new clients into firm. Also trained and developed bookkeeping and professional staff to prepare financial statements, tax returns, payroll and to provide other related accounting and tax services to small business clients\nâ\u0080¢\tBuilt state-of-the-art infrastructure, including fully electronic office providing virtual office and flexible work opportunities for staff and user friendly portals for client access.  Developed efficient processing methods by using high quality software and consulting with accountants from across the country. Strategically used off-shore outsourcing to supplement and support staff during periods of heavy workload.", "title": "Owner", "startedOn": {"month": 10, "year": 1999}}, {"posId": 92173690, "new": false, "current": false, "endedOn": {"month": 3, "year": 2001}, "companyName": "Evolving Systems", "description": "Controller/Consultant\t(10 staff)\t\t\t\t\t\t\t\t\nâ\u0080¢\tManaged team responsible for General Ledger, AP, Disbursements, AR, Collections, Credit Card Program, Payroll, Revenue, Fixed Assets, Budgeting, Forecasting, Treasury, SEC filings, Investor Relations support, Taxes. As Chief Accounting Officer, established and published Company financial policy.  Noteworthy Contributions:\nâ\u0080¢\tIncreased morale and reputation of Finance organization through quality initiatives and implementing standard quality review practices\nâ\u0080¢\tEstablished key indicators of business performance by lines of business and conducted company wide Business Reviews attended by senior management team monthly\nâ\u0080¢\tInitiated and managed systems conversion effort to fully utilize functionality in Oracle  ERP Applications\nâ\u0080¢\tEstablished new revenue recognition practices to significantly reduce company risk under SEC requirements\nâ\u0080¢\tAddressed tax compliance issues to alleviate significant tax penalty risks to company with a new tax strategy\nâ\u0080¢\tEstablished financial policies, and new Legal Entity in Bangalore India, for IT professionals developing proprietary software for the Company", "title": "Controller", "startedOn": {"month": 9, "year": 1999}, "companyUrn": "urn:li:fs_salesCompany:7567"}, {"posId": 92173616, "new": false, "current": false, "endedOn": {"month": 9, "year": 1999}, "companyName": "J.D. Edwards", "description": "Director of Finance â\u0080\u0093 Americaâ\u0080\u0099s\t(Headquarters - 60 staff)\t\t\t\t\nâ\u0080¢\tDirected Team of Decision Support Finance Managers located, in 12 offices and 15 countries, in Latin America, Canada and the United States, who advised and partnered with General Managers of Company Field Operations.  Responsible for: Budget & Forecast, Capital/Operating expense and Headcount budgets, Administration & Human Resources, Employee Relations & Staff Training\nDirector of Corporate Financial Reporting (Headquarters - Denver, Colorado)\nâ\u0080¢\tDirected Financial Reporting organization including: Budgeting & Forecasting for $1B in annual Company revenue and corresponding operating expense/capital and headcount budgets, Worldwide Corporate Consolidations & SEC Reporting, requiring knowledge of International Financial Reporting Standards (IFRS) and International tax optimization strategies for countries in the following Company Divisions: Americaâ\u0080\u0099s, Asia, Europe, Middle East & Africa (EMEA)\nController â\u0080\u0093 West Area (Costa Mesa, California)\nâ\u0080¢\tDirected Finance & Administration staff including: GL Accounting, Accounts Payable (Disbursements), Accounts Receivable (Collections), Credit Card Program, Forecasts, Operating Plan, Budgets & Administration", "title": "Finance Director", "startedOn": {"month": 1, "year": 1997}, "companyUrn": "urn:li:fs_salesCompany:4012"}, {"posId": 92173750, "new": false, "current": false, "endedOn": {"month": 12, "year": 1996}, "companyName": "Boeing", "description": "Director Finance and Administration\t\t\t\t\t \t\nDirected Finance & Administration (35 staff) including: Accounting, Accounts Payable, Accounts Receivable, Payroll, Administration, Operating Plan and Budgets. Continued career progression during 4 year period where MDC reduced work force by 80%, from 55,000 employees to 11,000 \nâ\u0080¢\tInitiated and directed the implementation of an enterprise wide PeopleSoft client/server system including the following seven systems:  General Ledger, Accounts Payable, Accounts Receivable, Fixed Assets, Payroll, and Benefits & Human Resources.\nâ\u0080¢\tProvided business analyses and consultation to senior management regarding significant issues affecting company profitability\nâ\u0080¢\tEstablished key indicators of performance measurements significantly contributing to measurable improvements in accounting closing cycle time and payroll processing accuracy & efficiency", "title": "Finance Director (former McDonnell Douglas)", "startedOn": {"month": 3, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:1384"}, {"posId": 92174005, "new": false, "current": false, "endedOn": {"month": 3, "year": 1996}, "companyName": "Beckman Instruments", "description": "Corporate Accounting Manager\t\t\t\t\t\t\t\t\nâ\u0080¢\tManaged Accounting staff supporting Domestic and International Operations (18 Staff), Maintained all Corporate Ledgers, Initiated closing process re-engineering and cycle time reduction effort", "title": "Corporate Accounting Manager", "startedOn": {"month": 8, "year": 1995}, "companyUrn": "urn:li:fs_salesCompany:18653"}, {"posId": 92173469, "new": false, "current": false, "endedOn": {"month": 8, "year": 1995}, "companyName": "Boeing Commercial Airplanes", "description": "Accounting/Finance Manager  (15 staff)\t\t\nâ\u0080¢\tManaged Financial Reporting & Forecasting organization Produced monthly comprehensive financial statements For 14 subsidiary Legal Entities  within a 24-hour closing cycle\nâ\u0080¢\tProvided SEC 10Q & 10K filing requirements to Corporate office quarterly/annually\nâ\u0080¢\tProduced comprehensive annual Operating Plan Budget & Forecasts for Company with $3.5 billion in annual revenue\nâ\u0080¢\tReceived Executive Management commendation for management performance report created for audience of 22 Company Vice Presidents (May 1995)\n\nAccounting/Finance Manager â\u0080\u0093Cash Management Division\nâ\u0080¢\tManaged Cash management Division.  Areas of responsibility: Receivables Invoicing and Collections, Accounts Payable and Disbursements, including travel reimbursement and Company credit card program, Daily, weekly and monthly cash reporting and forecasts\n\nBusiness Unit Manager of Inter-Company Work Order (ICWO) Division\nâ\u0080¢\tNamed Woman of High Potential by Company Amelia Earhart Society\nâ\u0080¢\tLed twelve quality process improvement teams to significantly change business practices to adjust to a more competitive environment\nâ\u0080¢\tUnder-ran Operating Plan budget by $94.5 million (23%) by improving inventory management practices, renegotiating contracts with 10 related companies (all subsidiaries of MDC), realigning work packages between companies, and establishing performance measures\n\nSenior Manufacturing Specialist\nSubstantially contributed to the efficiency of parts flow into & throughout the plant through the following efforts:\nâ\u0080¢\tPerformed a cost/benefit analysis that justified a $5.2 million plant-wide bar-coding technology implementation. As Project Manager, successfully implemented plant-wide bar-coding technology with six month payback\nâ\u0080¢\tMember of lead-time reduction team that reduced aircraft build time from two years to 15 months\nâ\u0080¢\tProvided analyses and consultation directly to the General Manager of Parts Control (Inventory Operations, MRP and Shop Floor Control)", "title": "Finance & Accounting Manager Positions (former McDonnell Douglas)", "startedOn": {"month": 6, "year": 1992}, "companyUrn": "urn:li:fs_salesCompany:1384"}, {"posId": 558651261, "new": false, "current": false, "endedOn": {"month": 6, "year": 1992}, "companyName": "McDonnell Douglas Corporation - Headquarters", "description": "Auditing Specialist\t\t\t\t\t\t\t\t\nSupervised and trained a constantly changing stream of high potential professionals from Auditing and other MDC companies who analyzed, assessed and recommended solutions to challenging issues, such as supplier bankruptcies, ethically sensitive matters and integrity of cost accumulation systems\nâ\u0080¢\tObtained CPA qualifying experience by working on company sponsored two-year assignment to Ernst & Young to perform external financial audits.\nâ\u0080¢\tFrequently provided analyses and consultation to Executive Management upon request\nâ\u0080¢\tReceived an unprecedented Corporate Performance Bonus Award for recommending creative improvements to manufacturing and inventory processes that resulted in annual cash flow and cost savings of $82 million and $22 million respectively", "location": "Huntington Beach, California", "title": "Auditing Specialist", "startedOn": {"month": 5, "year": 1988}}, {"posId": 92174223, "new": false, "current": false, "endedOn": {"month": 5, "year": 1988}, "companyName": "Sacramento Municipal Utility District", "description": "Senior Internal Auditor (systems specialist)\t\t\t\t\t\t\tannual compensation $36K\nâ\u0080¢\tAdvised systems development teams on internal control issues\nâ\u0080¢\tAutomated method to reconcile $12 million in discrepancies between old/new inventory systems.  Automated Accounts Payable/Purchase Order systems interface eliminating 3000 duplicate entries per month\nâ\u0080¢\tDeveloped innovative, automated methods for performing routine financial audits with more efficiency and depth.\nâ\u0080¢\tAutomated department planning and administrative functions and trained staff on use\nâ\u0080¢\tWorked on company sponsored loan-out for Arthur Andersen during their year-end financial audits and during a three month consulting engagement", "title": "Senior Auditor", "startedOn": {"month": 3, "year": 1984}, "companyUrn": "urn:li:fs_salesCompany:166014"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Sue Evans", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/sue-evans-cirocco-3a85b11", "location": "Coppell, Texas"}