{"lastName": "Carney", "objectUrn": "urn:li:member:407884410", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Computer & Network Security", "educations": [{"endedOn": {"year": 1990}, "fieldsOfStudy": ["Biology, General"], "school": "urn:li:fs_salesSchool:17954", "degree": "Bachelor's degree", "schoolName": "University of California, San Diego", "startedOn": {"year": 1983}, "eduId": 269827025}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABhP0noBEQA-luSF5AJ43qQhQK2eVOH75Uc,NAME_SEARCH,undefined)", "numOfConnections": 151, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFJDd8S3Xd5GQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=pbbIlp4kMoMUEXgRhqSz_O0We9aZPRO80FdilBTqmWs", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFJDd8S3Xd5GQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=OPH2TtScdiVzT6eNdI1jAvfJhP4X_Pi3ce1jN0VS8bM", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFJDd8S3Xd5GQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=zqW_CIGEOkVK6JbWgcfyxWo5JcXNKNn077SmXOqTgjg", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFJDd8S3Xd5GQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=iYLCtBHXAcDDZfcBpioeOCrIAmv4hnc1HLXAWIwazJk", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Threat Intelligence Consultant at Recorded Future", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Recorded Future provides the only complete threat intelligence solution powered by patented machine learning to help security teams defend against cyberattacks.", "pendingInvitation": false, "defaultPosition": {"posId": 1264497345, "new": true, "current": true, "companyName": "Recorded Future", "location": "Southern California", "title": "Threat Intelligence Consultant", "startedOn": {"month": 4, "year": 2018}}, "degree": 3, "fullName": "Mike Carney", "positions": [{"posId": 1264497345, "new": true, "current": true, "companyName": "Recorded Future", "location": "Southern California", "title": "Threat Intelligence Consultant", "startedOn": {"month": 4, "year": 2018}}, {"posId": 645340938, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As Deputy Special Agent in Charge for Homeland Security Investigations in San Diego I manage a division and have direct oversight of the daily operations of over 200 special agents, intelligence analysts and support staff conducting investigations in the following areas: cyber-crimes, financial crimes, money laundering, drug smuggling, arms trafficking, counter-terrorism, immigration fraud and export violations. Under my leadership, the HSI San Diego Office has successfully conducted investigations of national and international significance and has consistently placed in the top three nationally in criminal arrests, indictments, convictions and money seizures. Not satisfied with the status quo I have identified the need for and established several regional law enforcement task forces to counter new and emerging threats to national security and public safety. Over the last 11 years I have briefed numerous senior executives from the U.S. Department of Homeland Security, U.S. Department of Justice, U.S. Department of Defense and from the U.S. Congress on border and national security operations in the San Diego area of responsibility. In addition to overseeing operations, I manage personnel including establishing performance plans, conducting performance evaluations, overseeing disciplinary and adverse actions as well as handling Equal Employment Opportunity matters. I have managed the office budget and found cost savings and efficiencies during lean budget years while maintaining a consistent level of performance. ", "location": "Greater San Diego Area", "title": "Deputy Special Agent in Charge", "startedOn": {"month": 8, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1143447437, "new": false, "current": false, "endedOn": {"month": 8, "year": 2006}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As the Unit Chief of the newly formed Compliance Enforcement Unit, I was tasked with implementing the recommendations of the 9/11 Commission regarding the monitoring and enforcement of nonimmigrant visa violations. In this capacity, I managed an Operations Section and a Programs Section consisting of 20 government personnel and 70 contract personnel. I developed a concept of operations and work flow process of a new national enforcement program that consisted of a national operations center staffed by government and contract personnel. This national operations center responded to several increases in the national security threat level (yellow to orange level) during the 2003 to 2006 time frame. I identified the need for, secured funding and led the design and implementation of a new case management IT system that would facilitate the assignment of national security investigations to Homeland Security Investigations field offices. In order to meet the increasing national security demands of the Unit I was able to make a business case for expanding existing contracts to increase staffing and identified and secured funding for new facilities. To further the capabilities of the Unit I identified additional data sources, negotiated agreements and implemented information sharing of several government agency databases to facilitate the targeting and tracking of subjects of interest. I worked with the Intelligence Community to prioritize work and focus efforts. I worked on tight deadlines and regularly briefed HSI, U.S. Department of Homeland Security and the U.S. Congress on the progress, status and performance of the program. ", "location": "Washington D.C. Metro Area", "title": "Unit Chief, National Security Investigations Division", "startedOn": {"month": 5, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1143445658, "new": false, "current": false, "endedOn": {"month": 5, "year": 2003}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I supervised an investigative group responsible for human smuggling, human trafficking and drug trafficking investigations within the Honolulu District area of responsibility (State of Hawaii). I led an investigation resulting in the first federal human trafficking conviction in the District of Hawaii. I also co-led an international drug trafficking investigation involving the smuggling and distribution of black tar heroin from Mexico to Hawaii.", "location": "Honolulu, HI", "title": "Supervisory Special Agent", "startedOn": {"month": 11, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1143446707, "new": false, "current": false, "endedOn": {"month": 11, "year": 2000}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "I served as a Special Agent for six years conducting investigations of human smuggling, immigration benefit fraud, unlawful hiring practices and counterfeit document production and sales. I was the case agent for a complex multi-million dollar immigration fraud scheme resulting in convictions of seven individuals and the seizure of real property. I was promoted to Supervisory Special Agent in 1999 and assigned to lead an investigative group focused on human smuggling/trafficking and identity document fraud. I supervised successful investigations leading to convictions and dismantlement of two international human smuggling rings.", "location": "Greater Los Angeles Area", "title": "Supervisory Special Agent/Special Agent", "startedOn": {"month": 7, "year": 1992}, "companyUrn": "urn:li:fs_salesCompany:533534"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Mike", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/mike-carney-276724b4", "location": "San Diego, California"}