{"lastName": "Hackbarth", "objectUrn": "urn:li:member:22668798", "contactInfo": {"websites": [{"category": "COMPANY", "dataSource": "LINKEDIN", "url": "http://www.darpa.mil"}]}, "crmStatus": {"imported": false}, "industry": "Government Relations", "educations": [{"endedOn": {"year": 2009}, "fieldsOfStudy": ["Strategic Studies"], "degree": "Correspondence", "schoolName": "Air War College", "startedOn": {"year": 2007}, "eduId": 36438091}, {"endedOn": {"year": 2003}, "fieldsOfStudy": ["Military Operational Art and Science"], "degree": "MS", "schoolName": "Air Command and Staff College", "startedOn": {"year": 2002}, "eduId": 19735293}, {"endedOn": {"year": 1996}, "fieldsOfStudy": ["Business Administration"], "school": "urn:li:fs_salesSchool:18732", "degree": "MBA", "schoolName": "Webster University", "startedOn": {"year": 1994}, "eduId": 19188635}, {"endedOn": {"year": 1989}, "fieldsOfStudy": ["Computer Science"], "school": "urn:li:fs_salesSchool:17966", "degree": "BA", "schoolName": "University of San Diego", "startedOn": {"year": 1985}, "eduId": 19188768}, {"endedOn": {"year": 1985}, "schoolName": "Kamehameha Schools", "startedOn": {"year": 1981}, "eduId": 172111971}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAFZ5f4BPUb0qYrVLqtp1tomYaAOrkc75AA,NAME_SEARCH,undefined)", "numOfConnections": 848, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGPIrKZb2XRzQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=RWSZlERzJSJp0UZhTwe57TMKAP9I2BueX37weAmcpMI", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGPIrKZb2XRzQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=KgpmeFAqHHii826qcOBOtShfmAC9A8M6dgd0IdUYhDE", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGPIrKZb2XRzQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=EfdneuHGm-B0d-cMQUGxQfacq3Pn0YQYnONToMG2HtA", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGPIrKZb2XRzQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=pNjqyTh0H5Gy-V25PEPjP4rYC1QR86wVBd6xBMznV4E", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Deputy Assistant Director, ICE Office of Congressional Relations", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Includes over 12 years of legislative affairs experience overlapping 22+ years of military service. Expertise in strategic planning and communications, congressional relations, legislative analysis (authorization and appropriations), legislative proposals, public policy development and implementation, personnel management and evaluation, and professional development, training and education. Highly experienced and effective leader, manager, analyst, communicator, advisor, and supervisor. Holds current Top Secret security clearances (TS/SCI â\u0080\u0093 plus compartmented classifications).", "pendingInvitation": false, "defaultPosition": {"posId": 637558431, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provides assistance to the Assistant Director of the Office of Congressional Relations (OCR) and senior ICE officials by planning, directing, and coordinating congressional liaison activities and developing and maintaining a continuing awareness of philosophies, mission, special interest and areas of concern for OCR. Assists management with the development of critical legislation strategies involving budget and legislative proposals. Writes testimonies, statement letters, and other informational material to management and high-level officials. Prepares and conducts briefings, congressional hearings, conferences, and meetings for high-level audiences. Oversees subordinates preparations of statistical and narrative information as well as written responses to congressional inquiries. Establishes guidelines and performance expectations for subordinate staff members.", "location": "Washington D.C. Metro Area", "title": "Deputy Assistant Director, Office of Congressional Relations", "startedOn": {"month": 2, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Sean Hackbarth", "positions": [{"posId": 637558431, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Provides assistance to the Assistant Director of the Office of Congressional Relations (OCR) and senior ICE officials by planning, directing, and coordinating congressional liaison activities and developing and maintaining a continuing awareness of philosophies, mission, special interest and areas of concern for OCR. Assists management with the development of critical legislation strategies involving budget and legislative proposals. Writes testimonies, statement letters, and other informational material to management and high-level officials. Prepares and conducts briefings, congressional hearings, conferences, and meetings for high-level audiences. Oversees subordinates preparations of statistical and narrative information as well as written responses to congressional inquiries. Establishes guidelines and performance expectations for subordinate staff members.", "location": "Washington D.C. Metro Area", "title": "Deputy Assistant Director, Office of Congressional Relations", "startedOn": {"month": 2, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 630214721, "new": false, "current": false, "endedOn": {"month": 2, "year": 2015}, "companyName": "DARPA", "description": "Special projects", "location": "Arlington, VA", "title": "Special Assistant to the Deputy Director", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:16813"}, {"posId": 323651383, "new": false, "current": false, "endedOn": {"month": 11, "year": 2014}, "companyName": "DARPA", "description": "Mr. Sean M. Hackbarth is Chief, Congressional Affairs at the Defense Advanced Research Projects Agency (DARPA). In this capacity, he directly communicates the DARPA position on programs and policy to the members of Congress and their staffs. He articulates and defends the $2.9 billion DARPA budget by building and maintaining key congressional relationships with responsive, accurate, and relevant replies to inquiries and requests for information. He develops, coordinates, and supervises the execution of the annual DARPA congressional engagement and legislative strategy for effective interaction with Congress, congressional staffs, and other agencies ensuring that key national, Department of Defense (DOD), and DARPA goals and priorities are successfully articulated during congressional hearings and testimony, office calls, communiques, and other engagements. He provides analysis, guidance, and direction over a broad spectrum of programs and issues for DARPA. He educates and provides information to members of Congress and their staff on DARPA programs transitioning to the Military Services, Combatant Commands, and other Research and Development organizations. He drafts and coordinates legislative proposals to support the DARPA mission while protecting and expanding existing legislative authorities. He formulates, articulates, and executes the DARPA position on complex interrelated and sensitive issues to officials within DARPA, the DOD, the Military Services, other federal agencies and other external organizations. I conduct legislative research, evaluate the public and political environments (attitudes, current information, goals and objectives, etc.) and plan courses of action to maximize the likelihood that programs are favorably received by Congress and the public.", "location": "Arlington, VA", "title": "Chief, DARPA Congressional Affairs", "startedOn": {"month": 10, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:16813"}, {"posId": 293406692, "current": false, "endedOn": {"month": 10, "year": 2012}, "companyName": "Spire Communications", "description": "Sean brings over 22 years of experience in congressional relations, legislative analysis, and public policy development and implementation to Spire Communications. Sean also has an extensive background in space operations to include satellite command and control, space surveillance, and professional development, training and education. As an account director, Sean provides legislative affairs support for an extensive portfolio of programs at the Defense Advanced Research Projects Agency (DARPA).", "location": "Defense Advanced Research Project Agency (DARPA)", "title": "Account Director", "startedOn": {"year": 2012}, "companyUrn": "urn:li:fs_salesCompany:16813"}, {"posId": 108984819, "new": false, "current": false, "endedOn": {"month": 1, "year": 2012}, "companyName": "Federal Aviation Administration - Office of Commercial Space Transportation", "description": "Liaison between the United States Air Force (USAF) and the Federal Aviation Administration, Office of Commercial Space Transportation (FAA/AST).  I review, provide input to, and coordinate on reports, plans and policies related to space launch, space launch infrastructure, and standards affecting both federal and non-federal launch ranges.  I research and analyze past and current legislation to identify policy and budgetary impacts to USAF and FAA programs.  I advise senior USAF leaders and the FAA Associate Administrator for Commercial Space Transportation (AST) on collaboration opportunities, congressional issues, member interests, and strategies for congressional engagement in order to advance USAF and FAA equities.", "title": "Air Force Liaison", "startedOn": {"month": 2, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:5039"}, {"posId": 35090502, "new": false, "current": false, "endedOn": {"month": 2, "year": 2010}, "companyName": "United States Air Force", "description": "As Deputy Chief for the Programs and Legislation Division of Air Force Legislative Liaison, I led and supervised a 14-member office responsible for advocating for $115 billion in annual funding requirements for United States Air Force (USAF) personnel, infrastructure, and programs. I directly advised the Secretary of the Air Force, Air Force Chief of Staff, Deputy Directors, and General Counsel on critical issues under consideration by the House and Senate Armed Services Committees. I authored and executed congressional engagement strategies and strategic communication plans for key USAF programs, synchronizing the actions of multiple offices across the Headquarters Air Force staff.  I streamlined the congressional notification process, and ensured consistent messaging for the media by establishing and enforcing editorial standards.  I developed and coordinated responses to congressional and White House correspondence.  I analyzed defense appropriations and authorization bills for impact to USAF and Department of Defense air and space operations.  I prepared senior Air Force leadership to articulate USAF priorities and defend the USAF budget submission during congressional hearings and briefings.  I am a subject matter expert on legislative processes to include congressional inquiries, questions for the record, inquiries for the record, committee structures, legislative rules, and the development of authorization and appropriations bills.", "location": "Pentagon, Washington, DC", "title": "Air Force Legislative Liaison; Chief, Congressional Activities Branch", "startedOn": {"month": 7, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:157235"}, {"posId": 84589286, "new": false, "current": false, "endedOn": {"month": 7, "year": 2005}, "companyName": "United States Air Force", "description": "As the course director for Space Operations Specialized Studies at Air Command and Staff College (ACSC), I authored a six-week, thirty two-lesson Top-Secret/Special Compartmented Information (TS/SCI)-level course on the integration of space systems and capabilities into joint military operations (combined Air Force, Army, Navy, and Marines).  This course was delivered at the Air Forceâ\u0080\u0099s preeminent professional development program, which annually educates 600 resident and 12,000 nonresident midcareer officers (to include international students) and government civilians on the profession of arms, the requisites of command, the nature of war, and the application of air and space power at the theater level of war. As a lead academic instructor, I developed sufficient expertise to be certified to teach more than half of the courses comprising the total 10-month ACSC curriculum.  I developed curriculum, presented lectures, lead seminar discussions, and evaluated achievement of course objectives to provide officers with essential skills for senior-level USAF and joint duty positions.  I was also the faculty expert on space systems and operations, U.S. Armed Services capabilities, integrated joint operations, and combat planning.  In addition, I was a faculty research advisor for graduate-level students researching applications of emerging air and space power concepts.  From August 2002 to May 2003, I was a full-time, in-residence student graduating as a â\u0080\u009ctop performerâ\u0080\u009d with a 3.72 grade point average and earning a Masters of Military Operational Art and Science.", "location": "Maxwell Air Force Base, Alabama", "title": "Director, Space Operations Specialized Studies; Academic Instructor", "startedOn": {"month": 8, "year": 2002}, "companyUrn": "urn:li:fs_salesCompany:157235"}, {"posId": 236736344, "new": false, "current": false, "endedOn": {"month": 8, "year": 2002}, "companyName": "United States Air Force", "description": "As the Chief of Training and Standardization at the United States Space Command (USSPACECOM) Space Operations Center (SPOC), I developed and implemented a streamlined operations training program for Space Operations Center personnel.  The improved program reduced certification training time by 40%, enabled increased throughput of trainees, and ensured 100% mission ready status for the operations center with a ready pool for trained and certified personnel providing 24-hour global and regional situational awareness for the U.S. Commander in Chief for Space Forces.  My training program also enabled the SPOC to more efficiently serve as the command and control node for space and computer network operations.  In addition, I implemented a recurring training program for intelligence, foreign and commercial space system capabilities, increasing the ability of analysts to evaluate potential threats and the potential impact of space system outages.", "location": "Peterson Air Force Base, Colorado", "title": "Chief, Space Operations Training and Standardization; Watch Officer", "startedOn": {"month": 8, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:157235"}, {"posId": 236736950, "new": false, "current": false, "endedOn": {"month": 8, "year": 2000}, "companyName": "United States Air Force", "description": "As the Commander of the Space Operations Training Flight at the 392d Training Squadron, 381st Training Group, assigned to Air Force Space Command (AFSPC), I led and supervised 25 people conducting primary technical training for all Air Force Space Command operators.  Each year, I trained an average of 650 operators in space and missile operations.  In addition, I managed training schedules, evaluated studentsâ\u0080\u0099 performance, and provided academic counseling.  I also served as subject matter expert in space warning and control operations, command center operations, and optics and sensor fundamentals. As Chief of Curriculum, I directed courseware development, authored and coordinated curriculum content, established training standards, conducted trend analysis, and approved instructor training and evaluations.  I implemented numerous efficiencies and was recognized as â\u0080\u009cCurriculum Developer of the Yearâ\u0080\u009d for 1998.  Having completed the extensive requirements of a teaching practicum and earning five consecutive â\u0080\u009cOutstandingâ\u0080\u009d ratings (the highest rating possible) on instructor evaluations, I was awarded â\u0080\u009cMaster Instructorâ\u0080\u009d credentials.  I also served as a Defense Threat Reduction Agency (DTRA) Technology Monitor, preventing the transfer of sensitive U.S. space technologies to foreign countries through oversight of commercial space launch activities and services.", "location": "Vandenberg Air Force Base, California", "title": "Commander, Space Operations Training Flight; Chief of Curriculum", "startedOn": {"month": 10, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:157235"}, {"posId": 236737454, "new": false, "current": false, "endedOn": {"month": 10, "year": 1996}, "companyName": "United States Air Force", "description": "As a Space Surveillance Crew Commander and Orbit Analyst at the 1st Command and Control Squadron, 21st Space Wing, Air Force Space Command (AFSPC), I directed the worldwide space surveillance network to detect, identify, and catalog the over 8,000 man-made, earth-orbiting objects, information and analysis critical to the U.S. space control mission. As the Chief of Launch Operations for the Ultra-High Frequency Follow-On (UHF F/O) satellite system at the 3d Space Operations Squadron, 50th Space Wing, Air Force Space Command (AFSPC), I led the Air Force launch and early orbit operations for the $1.8 billion UHF/FO satellite program, directing and supervising the 55-member launch team providing operations, engineering, orbit analysis, and technical support. In addition to launch officer, I was also certified as a UHF F/O crew commander and instructor.  My proficiency in multiple positions provided maximum operational flexibility for my organization.  As Chief of UHF F/O Mission Software at the 3d Space Operations Squadron, 50th Space Wing, Air Force Space Command (AFSPC),  I designed and managed the execution of satellite tests and launch rehearsals and led the acquisition, installation, and testing of mission-critical hardware, software, and communications while meeting all program milestones.  In addition, I led and managed a 20-member contractor team in the 3-year initial design, development, and implementation of the UHF F/O command and control database.  During that time, I identified critical errors while reducing development time by 50%. As a Fleet Satellite Communication (FLTSATCOM) Planner/Analyst Officer at the 3d Space Operations Squadron, 50th Space Wing, Air Force Space Command (AFSPC), I was responsible for satellite plans, vehicle health, command generation, and anomaly resolution for the seven-satellite FLTSATCOM constellation, ensuring the availability of these critical assets.", "location": "Peterson Air Force Base Complex, Colorado", "title": "Chief, Launch Operations and Mission Software; Planner/Analyst Officer", "startedOn": {"month": 11, "year": 1989}, "companyUrn": "urn:li:fs_salesCompany:157235"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Sean", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/sean-hackbarth-6267127", "location": "Arlington, Virginia"}