{"lastName": "Null", "objectUrn": "urn:li:member:74721910", "contactInfo": {"websites": [{"category": "PERSONAL", "dataSource": "LINKEDIN", "url": "http://rcc.photoreflect.com"}]}, "crmStatus": {"imported": false}, "industry": "Information Technology and Services", "educations": [{"endedOn": {"year": 2012}, "degree": "CompTIA Security + Certification, Information Technology", "schoolName": "New Horizons Computer Learning Center", "startedOn": {"year": 2012}, "eduId": 187730933}, {"endedOn": {"year": 2012}, "fieldsOfStudy": ["Information Technology"], "degree": "CompTIA Network + Certification", "schoolName": "New Horizons Computer Learning Center", "startedOn": {"year": 2012}, "eduId": 112123120}, {"endedOn": {"year": 2012}, "fieldsOfStudy": ["Information Technology"], "degree": "CompTia A+ Certification", "schoolName": "New Horizons Computer Learning Centers", "startedOn": {"year": 2012}, "eduId": 112104114}, {"endedOn": {"year": 1989}, "fieldsOfStudy": ["Marketing, Cummunications"], "school": "urn:li:fs_salesSchool:17783", "degree": "General Studies", "schoolName": "University of Arizona", "startedOn": {"year": 1988}, "eduId": 95859617}, {"endedOn": {"year": 1988}, "school": "urn:li:fs_salesSchool:20266", "schoolName": "Pima Community College", "startedOn": {"year": 1987}, "eduId": 95861183}, {"endedOn": {"year": 1987}, "school": "urn:li:fs_salesSchool:20241", "schoolName": "Mesa Community College", "startedOn": {"year": 1985}, "eduId": 95859691}, {"endedOn": {"year": 1984}, "schoolName": "McClintock High School", "startedOn": {"year": 1981}, "eduId": 95861186}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAR0KnYBi8_J0_ICd6b61a4SbQ-K9clrpfU,NAME_SEARCH,undefined)", "numOfConnections": 279, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFBSgHkhb5ExA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=8PsU2zJwutNOmyg8tlR3qXxKblECAdj5OrEAm8pzamY", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFBSgHkhb5ExA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=xuxzlZxqFvXP921PKn8EqeWQB_s66NYT0tBfakQXIFo", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFBSgHkhb5ExA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=AckzD5UsSRtUw90uOHGsQr0ZFsmbTgMj-OIskmXKzKY", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQFBSgHkhb5ExA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=hWQtr40uYOpSnt3Tx2dsWaZePSo2-7JF2_EQEmomJo4", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "IT Specialist, Information Security at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Business and IT operations professional with numerous years in management, purchasing, design and implementation of various IT security, application and hardware initiatives.  Strong ability to look at current processes and streamline when necessary utilizing a change management process to ensure stakeholder buy in and end user acceptance not only in the Information Technology and Infrastructure venue but also in proper support of end user assistance. Many years devoted to network and application availability, evaluating and monitoring of security issues, threats and mitigation. Highly focused and project orientated utilizing project management fundamentals. Able to communicate effectively to a wide range of audiences and possess strong business analytical skills. \t", "pendingInvitation": false, "defaultPosition": {"posId": 815531296, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Service Desk IT support including Information Security, Tier II/III support, Remote Management, Web and SharePoint Development as well as Service Desk oversight duties as assigned. ServiceNow ITPM.", "location": "Undisclosed", "title": "IT Specialist, Information Security", "startedOn": {"month": 5, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Rick Null", "positions": [{"posId": 815531296, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Service Desk IT support including Information Security, Tier II/III support, Remote Management, Web and SharePoint Development as well as Service Desk oversight duties as assigned. ServiceNow ITPM.", "location": "Undisclosed", "title": "IT Specialist, Information Security", "startedOn": {"month": 5, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 511418008, "new": false, "current": false, "endedOn": {"month": 5, "year": 2016}, "companyName": "Phacil, Inc", "description": "Handle DHS Component CR Inquiries\nInbound Calls - Change Control Customer Support\nOutage Management informational Lead POC for ICE CR information\nQuality Review of Change Request  Tickets and proper closure\nFacilitate ICE CCB Meeting minutes and agendas on time frame\nDetermine through knowledge in ITIL, Configuration Management, Change Management, Lifecycle Management and implementations and deployments proper management and mitigation measures.\nTools & Training Interaction\nTraining - New Process and Procedures\nCurrently receive alerts from multiple sources security vulnerabilities, monitor DHS ISVMâ\u0080\u0099s and timeline reporting dates to monitor CRâ\u0080\u0099s into the enterprise from IAD and IDG for remediation\nAble to effectively to do proper AARâ\u0080\u0099s utilizing multiple inputs to come to a conclusion to after action results and implementing proper responses and forward thinking responses\nSupport Package implementation.QA to handle documentation and Contact Matrix.\nRemedy queue provision and maintenance per support package and changes submitted\nSpecial Projects as assigned by Phacil Management and Federal Task Leads\nReview Alert Handling Procedures (this is notification) for adherence to SOPs\nReview Incident Management procedures for all EOC departments for adherence to SOPs\nQA monitors and tracks compliance with SOPs for User Provisioning - This refers to end user account processes handled by the EOC\nQA reviews and tracks SOPs for patch/update procedures.\nIn the current CM and Tier II/II liaison position, work daily, 50% of the time, to mitigate recurring issues and problems in the environment. Mostly focusing in identifying the issues, resolution and reporting to the specific areas of responsibility the issues. Report remediation testing and steps to all to solve issues.\nDeveloping of Service Desk support for new system and application rollouts, including maintaining communications with help desk analysts and functional ESB areas\n", "location": "Chandler, AZ", "title": "Change Management/Quality Assurance Lead", "startedOn": {"month": 2, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:896411"}, {"posId": 336452849, "new": false, "current": false, "endedOn": {"month": 2, "year": 2014}, "companyName": "Phacil, Inc", "description": "Team lead responsible with training, developing and motivating 1st shift Service Desk Analysts \nWorking with and troubleshooting all Microsoft Operating Systems (PC - XP, Vista, 7) (Server 2003, 2008, 2010).\nMicrosoft Administration, Active Directory, and Group Policy maintenance and configuration.\nMicrosoft Exchange server, Outlook.\nMicrosoft SQL - basic queries and backup administrator.\nDirect interface with Network Operations Center (NOC) implementing port â\u0080\u0093 blade â\u0080\u0093 switch configurations.\nWireless card configuration and setup in Secure Environments.\nVPN, Remote Access configuration and support.\nWorking knowledge of IP addressing protocols, LAN and WAN configurations.\nSecuredoc Server/Winmagic encryption administration and configuration\nSkilled in troubleshooting hardware and software with Printers, Scanners, Faxes and all -in- Ones.\nConfiguration of Hand held devices.\nPC desktop - laptop configuration and set up for Domains.\nBasic Domain Administration of User - account Maintenance.\nCoordinate with Network outage managers to ensure proper escalation is accomplished\nQuality Assurance compliance, training and documentation for implementation for analyst ITIL troubleshooting and resolution\nSME for telecommunications issues and resolutions\nSME for iPhone and GOOD For Enterprise service desk implementation\nAvaya CMS Server 16.2 Reporting and management professional\nTelecommunications troubleshooting expert", "title": "Service Desk Analyst Team Lead", "startedOn": {"month": 11, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:896411"}, {"posId": 249694081, "new": false, "current": false, "endedOn": {"month": 11, "year": 2012}, "companyName": "Rick's Custom Creations", "description": "Currently in transition back into Operations, Project Management and Information Technology sectors. Re-careering after a 6 year hiatus in retail management. Recently received CompTIA A+ ,CompTIA Network+ and CompTIA Security+ certifications to bolster resume. Doing contract IT solutions and smaller remodeling projects to augment income until the right fit presents itself.", "location": "Mesa, AZ", "title": "Owner", "startedOn": {"month": 1, "year": 2012}}, {"posId": 249697210, "new": false, "current": false, "endedOn": {"month": 1, "year": 2012}, "companyName": "Sunshine Acres Children's Home", "description": "â\u0080¢\tHelped with PC and network adds, changes and moves.\nâ\u0080¢\tPerformed work involving electrical, plumbing, HVAC and general maintenance duties\nmeeting codes.\nâ\u0080¢\tFacilitated scheduled maintenance on 40+ buildings and their systems minimizing\ndowntime.\nâ\u0080¢\tDiagnose and repair major appliance issues for cost effectiveness.\nâ\u0080¢\tSupervise groups up to 400 volunteers for targeted on site projects increasing their\nproductivity and efficiency.\nâ\u0080¢\tInterfaced with a staff of over 60 to timely remedy facilities maintenance issues.", "title": "Maintenance Technician", "startedOn": {"month": 7, "year": 2011}}, {"posId": 249697211, "new": false, "current": false, "endedOn": {"month": 5, "year": 2011}, "companyName": "Home Depot", "description": "â\u0080¢\tHelped with in store PC diagnostics and repairs.\nâ\u0080¢\tAdd new network drops and facilitated new PC installs.\nâ\u0080¢\tInstructed staff on how to handle difficult and complicated sales resulting in on time\nproject management for the customer.\nâ\u0080¢\tTrained and managed 12 associates and achieved significant improvements in their\nproductivity.\nâ\u0080¢\tConferred with company officials to develop methods and procedures to increase sales,\nexpand markets, and promote business.\nâ\u0080¢\tTrained 6 people in total customer service at contractor desk increasing customer\nloyalty.\nâ\u0080¢\tApplied marketing and sales techniques to upsell all aspects of construction supply\nchain to contractors, handymen and industry specific laborers.\nâ\u0080¢\tHired, trained, and evaluated personnel in sales and marketing establishments,\npromoting and terminating workers when appropriate.\nâ\u0080¢\tDirected, supervised and mentored employees engaged in sales, inventory-taking,\nreconciling cash receipts, and in performing services for customers.\nâ\u0080¢\tResponsible for 20% of stores overall revenue.\nâ\u0080¢\tSurpassed store comp sales by 400% in 2010 and 150% in 2011.\nâ\u0080¢\tSecondary supervisor over millworks, kitchen design, electrical, building materials and\nplumbing to facilitate excellent customer service.\nâ\u0080¢\tResponded to written and telephone requests for materials meeting customers' deadlines.\nâ\u0080¢\tResearched and recommended to customers best and most cost efficient products for their\nproject.\nâ\u0080¢\tAuthorized payments and merchandise returns.\nâ\u0080¢\tEnforced safety, health, and security rules to create safe and customer friendly\nenvironment.", "title": "Department Supervisor", "startedOn": {"month": 4, "year": 2005}}, {"posId": 249697203, "new": false, "current": false, "endedOn": {"month": 4, "year": 2005}, "companyName": "Southwest Phone Cards, Inc", "description": "â\u0080¢\tNetworked and contracted ($300k a month) with large telecom organization for voice and\ndata network services as well as points of presence.\nâ\u0080¢\tDeveloped and interpreted organizational goals, policies, and procedures.\nâ\u0080¢\tExecuted daily operations of reporting, network management, backup procedures and\ncustomer service results.\nâ\u0080¢\tAssigned and reviewed the work of systems analysts, programmers, and other computer-\nrelated workers.\nâ\u0080¢\tMaintained all PCâ\u0080\u0099s, servers and network components including software and hardware.\nâ\u0080¢\tManaged desktop and server telephone support and help desk calls for remote assistance on switching software and OS problems. \nâ\u0080¢\tStayed abreast of advances in technology.\nâ\u0080¢\tConsulted with users, management, vendors, and technicians to assess computing needs\nand system requirements.\nâ\u0080¢\tDirected daily operations of department, analyzed workflow, established priorities,\ndeveloped standards and set deadlines.\nâ\u0080¢\tRestructured and improved reporting for greater visibility of profit and loss.\nâ\u0080¢\tPrepared and reviewed operational reports and project progress reports.\nâ\u0080¢\tReviewed project plans in order to plan and coordinate project activity.\nâ\u0080¢\tSpearheaded new equipment efforts.\nâ\u0080¢\tPurchased necessary equipment.\nâ\u0080¢\tRecruited, hired, trained and supervised staff, and participated in staffing decisions.\nâ\u0080¢\tControlled operational budget and expenditures.", "title": "Vice President", "startedOn": {"month": 10, "year": 2002}}, {"posId": 249697204, "new": false, "current": false, "endedOn": {"month": 10, "year": 2002}, "companyName": "One Point Services", "description": "â\u0080¢\tSupervised 40 employees, scheduled work hours, resolved conflicts and determined\nsalaries.\nâ\u0080¢\tManaged and streamlined telecom switching and billing platforms for a more profitable\narchitecture and smaller foot print increasing top line profitability.\nâ\u0080¢\tSuccessfully managed a 4-person team over switching operations.\nâ\u0080¢\tHired, promoted, discharged and transferred employees.\nâ\u0080¢\tNegotiated 30% decrease of cost of goods sold through contract negotiations ($1m\ncontracts monthly).\nâ\u0080¢\tProcured telecom circuits with expedited process to get service up and running 50%\nfaster than industry normal timelines.\nâ\u0080¢\tProficient in least cost routing, trunking, routing, rate tables, diagnostics and\nrepair of telecom switching platforms, equipment and circuits.\nâ\u0080¢\tProficient in hardware and software procurement, installation and maintenance enabling\nmanagement to increase employee performance.\nâ\u0080¢\tCoordinated work activities of various operational departments to minimize process\nconflict.\nâ\u0080¢\tMaintained all PCâ\u0080\u0099s, servers and network components including software and hardware.\nâ\u0080¢\tManaged desktop and server telephone support and help desk calls for remote assistance on switching software and OS problems.\nâ\u0080¢\tWrote, designed and produced reports utilizing Crystal Reports to report within a +/-\n1% forecast accuracy for managing cash flow for return on investments.\nâ\u0080¢\tEvaluated data, such as traffic loads, speed and accuracy of message handling and cost\nfactors to improve services.\nâ\u0080¢\tHandled management technology including database design, implementation, analysis,\nproposal design, PBX installation and configuration, internet and intranet design and\nmaintenance.\nâ\u0080¢\tTrained personnel in Microsoft NT 4.0, QuickBooks, Peachtree, All Windows Operating\nSystems, Office Pro, numerous desktop publishing programs, web design, contact management\nand networking fundamentals for professional growth and ease workloads.", "title": "Vice President Telecom Operations", "startedOn": {"month": 8, "year": 1998}}, {"posId": 249696311, "new": false, "current": false, "endedOn": {"month": 8, "year": 1998}, "companyName": "RAN Information Systems", "description": "* Developed and interpreted organizational goals, policies, and procedures.\n* Consultant in general business practices and work flow analysis.\n* Stayed abreast of advances in technology to help companies to be on the leading edge of technology flow.\n* Experienced in venture capital from start up to SEC filings. \n* Trained and managed clients in Microsoft Office Suite and Goldmine/Heat contact management to achieve significant improvements in their productivity and communication.\n* Evaluated the organization's technology use and needs and recommend improvements, such as hardware and software upgrades.\n* Met with department heads, managers, supervisors, vendors, and others, to solicit cooperation and resolve problems.\n* Consulted with users, management, vendors, and technicians to assess computing needs and system requirements.\n* Responded to written and telephone requests for services and hardware to increase business flow processes.", "location": "Mesa, AZ", "title": "Owner", "startedOn": {"month": 10, "year": 1995}}, {"posId": 249697213, "new": false, "current": false, "endedOn": {"month": 10, "year": 1995}, "companyName": "Bromar Foodservice Arizona", "description": "â\u0080¢\tMaintained sales forecasting reports.\nâ\u0080¢\tImplemented computerized call tracking and accountability.\nâ\u0080¢\tKept informed on industry news and trends, products, services, competitors, relevant\ninformation about legacy, existing, and emerging technologies, and the latest product-line\ndevelopments.\nâ\u0080¢\tVisited prospective buyers at commercial, industrial, and other establishments to show\nsamples and catalogs, and to inform them about product pricing, availability, and\nadvantages.\nâ\u0080¢\tExecuted daily operations of sales call tracking.\nâ\u0080¢\tDocumented account activities, generated reports, and kept records of business\ntransactions with customers and suppliers.\nâ\u0080¢\tAttended trade shows and seminars to promote products and to learn about industry\ndevelopments.\nâ\u0080¢\tSupervised and managed a sales force of 8 for an institutional food service brokerage\nfirm.\nâ\u0080¢\tResearched and identified potential customers for products and services.\nâ\u0080¢\tPrepared and delivered technical presentations that explained products and services to\ncustomers and prospective customers.\nâ\u0080¢\tIdentified resale opportunities, and supported them to achieve sales plans.\nâ\u0080¢\tAccountable for several large distributors marketing and sales goal attainment.\nâ\u0080¢\tAttended company training seminars to become familiar with product lines.\t\nâ\u0080¢\tCollaborated with sales teams to understand customer requirements, to promote the sale\nof company products, and to provide sales support.\nâ\u0080¢\tDeveloped sales plans to introduce products in new markets.\nâ\u0080¢\tAssessed training needs of staff and arranged for and provided appropriate instruction.\nâ\u0080¢\tServed as board member for Arizona Restaurant Association, including annual Arizona\nRestaurant and Lodging Show.", "title": "Sales Manager", "startedOn": {"month": 8, "year": 1988}}, {"posId": 249697205, "new": false, "current": false, "endedOn": {"month": 9, "year": 1988}, "companyName": "Sysco Foodservices Arizona", "description": "â\u0080¢\tWas instrumental in increasing territory sales 1000%.\nâ\u0080¢\tStructured and maintained a database of promotions and specials and automated process\nto get into customers hands weekly.\nâ\u0080¢\tMonitored market conditions, product innovations, and competitors' products, prices,\nand sales.\nâ\u0080¢\tIdentified prospective customers by using business directories, following leads from\nexisting clients, participating in organizations and clubs, and attending trade shows and\nconferences.\nâ\u0080¢\tContacted regular and prospective customers to demonstrate products, explain product\nfeatures, and solicit orders.\nâ\u0080¢\tAnswered customers' questions about products, prices, availability, product uses, and\ncredit terms.\nâ\u0080¢\tProvided customers with product samples and catalogs.\nâ\u0080¢\tConsulted with clients after sales and contracted signings in order to resolve problems\nand to provide ongoing support.\nâ\u0080¢\tObtained credit information about prospective customers.", "title": "Marketing Associate", "startedOn": {"month": 10, "year": 1987}}, {"posId": 249697206, "new": false, "current": false, "endedOn": {"month": 10, "year": 1987}, "companyName": "Null and Associates Marketing", "description": "â\u0080¢\tMonitored market conditions, product innovations, and competitors' products, prices,\nand sales.\nâ\u0080¢\tIdentified prospective customers by using business directories, following leads from\nexisting clients, participating in organizations and clubs, and attending trade shows and\nconferences.\nâ\u0080¢\tContacted regular and prospective customers to demonstrate products, explain product\nfeatures, and solicit orders.\nâ\u0080¢\tAnswered customers' questions about products, prices, availability, product uses, and\ncredit terms.\nâ\u0080¢\tProvided customers with product samples and catalogs.\nâ\u0080¢\tConsulted with clients after sales and contracted signings in order to resolve problems\nand to provide ongoing support.\nâ\u0080¢\tObtained credit information about prospective customers.", "title": "Account Executive", "startedOn": {"month": 10, "year": 1985}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Rick", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/ricknul", "location": "Mesa, Arizona"}