{"lastName": "Moran", "objectUrn": "urn:li:member:272269585", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2012}, "fieldsOfStudy": ["Psychology"], "school": "urn:li:fs_salesSchool:18681", "degree": "Master's degree", "schoolName": "Walden University", "startedOn": {"year": 2011}, "eduId": 171116679}, {"endedOn": {"year": 2002}, "fieldsOfStudy": ["Criminal Justice/Law Enforcement Administration"], "school": "urn:li:fs_salesSchool:17883", "degree": "Bachelor's degree", "schoolName": "National University", "startedOn": {"year": 1994}, "eduId": 171116846}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABA6gREBySCp_RkS6dwuPZwvoG17O88T-bU,NAME_SEARCH,undefined)", "numOfConnections": 110, "showTotalConnectionsPage": false, "headline": "Deportation Officer  at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Experienced Navy with a demonstrated history of working in the military industry. Skilled in Intelligence Analysis, Government, Law Enforcement, Emergency Management, and Patrol. Strong military and protective services professional with a Master's degree focused in Psychology from Walden University. ", "pendingInvitation": false, "defaultPosition": {"posId": 851887851, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Responsible for enforcing immigration laws and ensuring the departure of removable aliens from the United States. As a Deportation Officer (DO) I am responsible for the identify, arrest, and removal of aliens who violate U.S. immigration law.  Also, responsible for the transportation and detention of aliens in ICE custody to include the removal aliens to their country of origin. As a Deportation Officer I also prosecute aliens for illegal re-entry after deportation, monitor cases during deportation proceedings, supervise released aliens who are subject to deportation, and remove aliens from the United States. ", "location": "Washington Field Office, Richmond Sub-Office", "title": "Deportation Officer", "startedOn": {"month": 8, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Eli Moran", "positions": [{"posId": 851887851, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Responsible for enforcing immigration laws and ensuring the departure of removable aliens from the United States. As a Deportation Officer (DO) I am responsible for the identify, arrest, and removal of aliens who violate U.S. immigration law.  Also, responsible for the transportation and detention of aliens in ICE custody to include the removal aliens to their country of origin. As a Deportation Officer I also prosecute aliens for illegal re-entry after deportation, monitor cases during deportation proceedings, supervise released aliens who are subject to deportation, and remove aliens from the United States. ", "location": "Washington Field Office, Richmond Sub-Office", "title": "Deportation Officer", "startedOn": {"month": 8, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 720943345, "new": false, "current": true, "companyName": "US Navy", "description": "Chief Warrant Officer IV\n\nCompleted mobilization for Operation Enduring Freedom and was assigned to Commander, U.S. Naval Central Forces Command (COMUSNAVCENT), 5th Fleet, Combined Maritime Forces, Naval Station Bahrain.\n\nServed as the Protocol Officer; responsible for the coordination of military, civilian, and foreign Distinguished Visitors throughout COMUSNAVCENT and CENTCOM Middle East Area of Operations. Provides direction to junior and senior officers in the proper etiquette for interacting with Dignitaries\nduring formal, semiformal, and off duty functions. Assists personnel in the proper expenditure of funds for military and civilian functions. Advices foreign senior officials on the proper Distinguish Visitor/Flag Officers etiquette during visits to the host nation.\n\nCoastal Riverine Squadron 1, Assistant Officer in Charge responsible for over 71 unit personnel to ensure they are physically, medically, and properly trained for security missions domestic and abroad. Coordinated live fire crew served weapons and small arms training, ensuring that all security force\nteams were trained and ready to conduct critical missions in the near coast environments throughout the world. I hold a current secret clearance effective October 2010.\n\nSupervised waterborne and land security training, aircraft and flight line security, strategic weapons and cargo security, maritime security and platform protection; conducted customs operations, corrections operations, detainee operations, and protective service operations; performed force protection,\nphysical security and law enforcement organize and train personnel in force protection, physical security, law enforcement, and weapons proficiency; developed plans for physical security and force protection enhancement of Navy bases, installations, property, and personnel; and assisted commands in conducting terrorist threat analysis and implemented defensive measures.", "location": "Richmond, Virginia Area", "title": "US Navy", "startedOn": {"month": 9, "year": 1987}, "companyUrn": "urn:li:fs_salesCompany:1335"}, {"posId": 421873274, "new": false, "current": false, "endedOn": {"month": 8, "year": 2016}, "companyName": "U.S. Customs and Border Protection", "description": "A mentor and a leader who leads by example for all agents to follow on and off duty. Considered a well-rounded supervisor who looks out for the best interest of personnel assigned to his unit, and ensuring the mission is carried out in the best interest of the Service.\n\nProficient in the Spanish language; completed a Master's Degree in Psychology with emphasis in Terrorism and Security (Nov. 2012); I currently hold a personal and official government passport.\n\nI have experience in balancing shift operations with work schedules and personell. I have Planned and assigned work schedules, prepared performance work plans, evaluated employee performance, and addressed disciplinary issues of personnel.\n\nConducted daily personnel inspections and ensure all agents have their necessary equipment and the proper mindset to perform their Border Patrol Agent duties effectively. Maximizes resources by ensuring Agents are best utilized based on mission demands.\n\nConducted joint law enforcement and emergency operations with other government, state, and local authorities during natural or manmade disasters. Supervise the execution of criminal search warrants to combat transnational criminal organizations. Work with local ranchers and stake holders within the area of operations to enhance community relations. \n\nHave apprehended undocumented aliens and alien smugglers. Conducted traffic stops to prevent and deter transporting of illegal aliens. Conducted and supervised vehicle seizures that were used in furthering of illegal smuggling and illegal narcotics. Protects against and deters the contraband of illegal drugs from entering the country. \n\nSupervises the processing, screening, and removal of all administrative and criminal law violators. Monitors the safe movement of detainees their administrative or criminal process. Supervise law enforcement communication operations in the Tactical Operations Center.", "location": "Bisbee, AZ", "title": "Supervisory Border Patrol Agent", "startedOn": {"month": 2, "year": 2004}, "companyUrn": "urn:li:fs_salesCompany:2997"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Eli", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/eli-moran-50122377", "location": "Richmond, Virginia Area"}