{"lastName": "Messina Yates", "objectUrn": "urn:li:member:165426780", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Practice", "educations": [{"endedOn": {"year": 2014}, "fieldsOfStudy": ["Juris Doctorate"], "degree": "Doctor of Law (J.D.)", "schoolName": "Florida A&M University College of Law", "startedOn": {"year": 2011}, "eduId": 145324289}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Interdisciplinary Studies"], "school": "urn:li:fs_salesSchool:18118", "degree": "Bachelor of Arts (B.A.)", "schoolName": "University of Central Florida", "startedOn": {"year": 2007}, "eduId": 145324452}, {"endedOn": {"year": 2007}, "schoolName": "Bishop Moore Catholic High School", "startedOn": {"year": 2003}, "eduId": 233185820}], "inmailRestriction": "DISABLED", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAncNlwBgzShm40idUfoLsLlWEFT31hP3JE,NAME_SEARCH,undefined)", "numOfConnections": 789, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFI-kP8KdOUIA/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=ZWXcPpedNQQ-KtU3Dy9qcaA06Fo6JxSAd37CADcPias", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFI-kP8KdOUIA/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=Zg1uI0Wr5KwUiYKxYqjvOiqOj3IB-kz6oeP-VbaL9is", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFI-kP8KdOUIA/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=ayJIZTmlUn3p2JLC5datO0v2PoX0CtQXnAhpKV-n5IU", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQFI-kP8KdOUIA/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=2SS9mtwjaEvSWk3O3rfyw7R-5PCbguM6LD7eOG5psus", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Contract Specialist, Attorney ", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 999812265, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢ Solicitation, administration, close-out, negotiation, and termination of purchase orders, task orders, delivery orders, inter-agency agreements, blanket purchase orders, and contracts showcasing cradle to grave contracting \nâ\u0080¢ Purchasing and/or managing a variety of service contracts including information technology (IT) support services and financial management services\nâ\u0080¢ Serving as a business advisor to a wide range of customers and advising customers of the pertinent program data required to successfully procure professional services and/or equipment\nâ\u0080¢ Assist Information Technologies Division to provide procurement services for Automated Information Systems (AIS), approved IT services requirements, and PBX phone systems\nâ\u0080¢ Reviewing requisitions to determine that proper specification or purchase descriptions are included in solicitation documents\nâ\u0080¢ Interpreting and applying laws, regulations, policies and procedures relevant to contracting and detention issues to include performance based national detention standards, Services Contract Act and the Davis Bacon Act\nâ\u0080¢ Evaluating bids or proposals for compliance with specifications or purchase descriptions and applicable clauses\nâ\u0080¢ Planning and carrying out pre-award, post-award, price/cost analysis, and other related staff functions in a relatively standardized or controlled work situation using established contracting procedures\nâ\u0080¢ Assisting managers and program offices in defining their acquisition needs and sources for obtaining them\nâ\u0080¢ Developing sources for supplying goods and/or services, identifying specifications, conducting market reviews and preparing analysis of prices/costs or services or products\nâ\u0080¢ Performing a wide range of contracting methods and contract types to plan and carry out pre-award and post-award procurement actions\n", "location": "Washington D.C. Metro Area", "title": "Contract Specialist", "startedOn": {"month": 4, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Michelle Messina Yates", "positions": [{"posId": 999812265, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢ Solicitation, administration, close-out, negotiation, and termination of purchase orders, task orders, delivery orders, inter-agency agreements, blanket purchase orders, and contracts showcasing cradle to grave contracting \nâ\u0080¢ Purchasing and/or managing a variety of service contracts including information technology (IT) support services and financial management services\nâ\u0080¢ Serving as a business advisor to a wide range of customers and advising customers of the pertinent program data required to successfully procure professional services and/or equipment\nâ\u0080¢ Assist Information Technologies Division to provide procurement services for Automated Information Systems (AIS), approved IT services requirements, and PBX phone systems\nâ\u0080¢ Reviewing requisitions to determine that proper specification or purchase descriptions are included in solicitation documents\nâ\u0080¢ Interpreting and applying laws, regulations, policies and procedures relevant to contracting and detention issues to include performance based national detention standards, Services Contract Act and the Davis Bacon Act\nâ\u0080¢ Evaluating bids or proposals for compliance with specifications or purchase descriptions and applicable clauses\nâ\u0080¢ Planning and carrying out pre-award, post-award, price/cost analysis, and other related staff functions in a relatively standardized or controlled work situation using established contracting procedures\nâ\u0080¢ Assisting managers and program offices in defining their acquisition needs and sources for obtaining them\nâ\u0080¢ Developing sources for supplying goods and/or services, identifying specifications, conducting market reviews and preparing analysis of prices/costs or services or products\nâ\u0080¢ Performing a wide range of contracting methods and contract types to plan and carry out pre-award and post-award procurement actions\n", "location": "Washington D.C. Metro Area", "title": "Contract Specialist", "startedOn": {"month": 4, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 727179475, "new": false, "current": false, "endedOn": {"month": 4, "year": 2017}, "companyName": "The Advisory Board Company", "description": "â\u0080¢ Provided top-level support to sales and client account management teams in a fast-paced/high volume environment, contributing significant business value through timely and high quality contract creation and negotiations.\nâ\u0080¢ Drafted, negotiated, edited, reviewed and administered a variety of complex documents, including Vendor Agreements, Independent Contractor Agreements, Business Associate Agreements, Consent Letters, Letters of Agreement, Amendments, and Addenda.\nâ\u0080¢ Advised and supported the sales and client account management departments in the resolution of critical business and contracting related issues via situational evaluation and analysis of associated business risks.\nâ\u0080¢ Supported negotiations with prospective and existing clients by leading and participating in numerous conversations and exchanges in-person, via telephone or over email, communicating the companyâ\u0080\u0099s positions on contractual terms, revising/editing proposals and contracts, and coordinating with internal stakeholders to prepare and refine the scopes of the services and related pricing for proposals and contracts.\nâ\u0080¢ Strategic partner to the Sales, Client Account Management, Delivery, and Finance departments to understand and ensure accuracy and consistency with the business and financial requirements and objectives in all contracts using extensive knowledge of business processes and products.\nâ\u0080¢ Assisted in the formulation and deployment of process innovation and improvements related to interdepartmental collaboration to create efficiencies.\nâ\u0080¢ Conducted various other ad hoc legal projects and duties, including matters related to team engagement, company compliance and data sharing agreement review, as needed. \n", "location": "Washington D.C. Metro Area", "title": "Senior Contract Specialist, Legal Administration, Legal and Business Affairs", "startedOn": {"month": 10, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:166346"}, {"posId": 686557554, "new": false, "current": false, "endedOn": {"month": 10, "year": 2015}, "companyName": "TopBuild", "description": "Masco's Installation and Services Business, including Masco Contractor Services and Services Partners became an independent publicly traded company in July 2015. Masco Contractor Services business now operates under TruTeam. The parent company, TopBuild, is comprised of over 190 TruTeam installation branch locations and over 70 Service Partners distribution centers across the U.S.\n\nâ\u0080¢ Reviewed, negotiated, proposed, processed or modified contracts to identify nonconformity and ensure compliance with company guidelines via evaluation of company risk matrix for identification and evaluation.\nâ\u0080¢ Was responsible for a portion of review of government contracts, owner contracts, and Prime agreements \nâ\u0080¢ Evaluated and reduced business risk exposure for all internal sub divisions by preparing addendums to bring contracts into compliance with the Masco Contract Control Policy in addition to the risk matrix.  \nâ\u0080¢ Procured insurance certificates through brokers according to contractual obligations, including those related to FAR.\nâ\u0080¢ Liaised with internal team members and external clients as well as collaborated with Legal and Executive representatives regarding client contract creation to meet requirements and needs for all stakeholders. \nâ\u0080¢ Assisted in creating a new team structure and process to streamline processes and increase efficiency including but not limited to working with outside counsel from various states, writing policy and procedure, creating training guides and leading internal training sessions, as well as providing feedback to executives. \nâ\u0080¢ Appointed by the CFO to serve on a committee to communicate with the employees around information involving Masco Contractor Services going public in July 2015", "location": "Daytona Beach, Florida Area", "title": "Contract Specialist and Negotiator", "startedOn": {"month": 10, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:6422939"}, {"posId": 363546637, "new": false, "current": false, "endedOn": {"month": 4, "year": 2014}, "companyName": "Gunster", "description": "â\u0080¢ Researched legislative initiatives to determine the potential impact of policies and decisions for clients  \nâ\u0080¢ Compiled and analyze relevant data to assist clients in making strategic business decisions\nâ\u0080¢ Tracked changes in legislation on trending policy issues and the publicâ\u0080\u0099s perception of those issues  \nâ\u0080¢ Drafted briefs and memoranda on complex civil litigation issues ranging from personal guarantees in commercial business matters to government regulation of private property", "title": "Legal Intern", "startedOn": {"month": 2, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:49141"}, {"posId": 363546727, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "Florida Office of the Attorney General", "description": "â\u0080¢ Researched and briefed legal issues contemplated under Floridaâ\u0080\u0099s Deceptive and Unfair Trade Practices Act \nâ\u0080¢ Drafted legal memoranda and to assist in consumer protection litigation on topics including timeshares, payrolling, and telemarketing\nâ\u0080¢ Analyzed current Florida statutes and proposed legislation to determine the impact on pending cases and future filings", "location": "Orlando, Florida Area", "title": "Consumer Protection Division - Legal Intern", "startedOn": {"month": 2, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:264710"}, {"posId": 363546964, "new": false, "current": false, "endedOn": {"month": 2, "year": 2013}, "companyName": "Edge Public Affairs LLC & Perez, Bruce, and Jonassen, LLP", "description": "â\u0080¢ A Florida-based public policy consulting firm providing government relations expertise \nâ\u0080¢ Created a marketing plan for an international business seeking to participate in the local market \nâ\u0080¢ Researched, compiled, and analyzed data to increase market shares in emergency healthcare in central Florida \nâ\u0080¢ Advised political candidates in campaign operations and strategy to increase voter awareness, turnout, candidate visibility, and voter outreach\nâ\u0080¢ Identified key public policy issues and developed talking points to familiarize campaign strategies\nâ\u0080¢ Research on various legal topics relating to corporate business, sales, and local regulations\nâ\u0080¢ Wrote various memoranda such as letters of: intent for sale of a commercial business, protest, cease and desist ", "location": "Orlando, Florida Area", "title": "Legal Intern", "startedOn": {"month": 8, "year": 2011}}, {"posId": 363547377, "new": false, "current": false, "endedOn": {"month": 8, "year": 2012}, "companyName": "Orange County Courthouse", "description": "â\u0080¢\tDrafted memoranda on issues pertaining to cases on the docket including liability, negligence, personal injury, intentional torts, civil contempt, and landlord/tenant disputes \nâ\u0080¢\tPrepared clear and concise case summaries to brief the judge on upcoming cases to efficiently manage the docket\nâ\u0080¢\tObserved court proceedings and hearings", "title": "Summer Law Clerk", "startedOn": {"month": 5, "year": 2012}}, {"posId": 363550188, "new": false, "current": false, "endedOn": {"month": 8, "year": 2011}, "companyName": "University of Central Florida", "description": "â\u0080¢\tAssisted with pre-meeting preparation, set up, day of activities, breaking down meeting materials, and disbursing correspondence and information \nâ\u0080¢\tWorked with sensitive and confidential information related to speeches, reports, and conferences \nâ\u0080¢\tWorked in all aspects of Florida Board of Governorâ\u0080\u0099s Meetings that were held at UCF", "title": "Board of Trustees Student Assistant", "startedOn": {"month": 10, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:166632"}, {"posId": 363550438, "new": false, "current": false, "endedOn": {"month": 9, "year": 2010}, "companyName": "Tico Perez Solutions, LLC", "description": "â\u0080¢\tA business development consulting firm based in Florida\nâ\u0080¢\tAssisted in creating limited liability corporation for a franchising organization that wanted to expand\nâ\u0080¢\tHelped clients compare LCCâ\u0080\u0099s, incorporations, and franchises to determine what would be the best for their business ventures", "title": "Intern", "startedOn": {"month": 5, "year": 2010}}, {"posId": 363551281, "new": false, "current": false, "endedOn": {"month": 5, "year": 2010}, "companyName": "Central Florida Partnership (Orlando Chamber of Commerce)", "description": "â\u0080¢\tWorked with initiatives: Regional Water Strategy and Connecting for Global Competitiveness by meeting with leaders in the field, researching, and writing summaries for mass consumption \nâ\u0080¢\tAssisted in creating a new layout, changing language, and integrating social media for the MyRegion.org website\nâ\u0080¢\tAssisted in office work within the Central Florida Partnership/Orlando Chamber of Commerce\nâ\u0080¢\tPublished â\u0080\u009cIntern Insights â\u0080\u0093 Economic Gardeningâ\u0080\u009d on Every Monday", "title": "MyRegion.org Intern", "startedOn": {"month": 2, "year": 2010}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Michelle", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/michellemessinayates", "location": "Washington D.C. Metro Area"}