{"lastName": "Ty", "objectUrn": "urn:li:member:41178886", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Legal Services", "educations": [{"endedOn": {"year": 2014}, "school": "urn:li:fs_salesSchool:18049", "degree": "Juris Doctor (J.D.)", "schoolName": "The George Washington University Law School", "startedOn": {"year": 2012}, "eduId": 122993486}, {"endedOn": {"year": 2012}, "fieldsOfStudy": ["Law"], "school": "urn:li:fs_salesSchool:17970", "degree": "Juris Doctor", "schoolName": "University of San Francisco School of Law", "startedOn": {"year": 2011}, "eduId": 94792627}, {"endedOn": {"year": 2008}, "fieldsOfStudy": ["Psychology, Law & Society (minor)"], "school": "urn:li:fs_salesSchool:17954", "degree": "Bachelor of Science", "schoolName": "University of California San Diego", "startedOn": {"year": 2004}, "eduId": 34285097}, {"endedOn": {"year": 2007}, "fieldsOfStudy": ["Psychology, International Law"], "schoolName": "University College, Utrecht", "startedOn": {"year": 2007}, "eduId": 37952290}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAJ0VwYBLgmmxA502Qn24AkWssdP38qkQWE,NAME_SEARCH,undefined)", "numOfConnections": 447, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGhEhP7or_08w/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=pQ-jMNX5LtB5lw0lDQQ0mdQVCpdpYOND9t9eRDaJ3GU", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGhEhP7or_08w/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=ZX3oSF3e475m7Lm6Uqbl97IHQeuT2cS8imTK3HUrfFk", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGhEhP7or_08w/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=Xg85J49Q4epL8rB6Jvnw2AXbtRcRkLuUMFQadYPypMY", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGhEhP7or_08w/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=Jb8e8bnmMfSRsvYonVykB0PuKm8uRhuWC_vl5pBdXA4", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Special Assistant U.S. Attorney at United States Attorney's Office", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Admitted to Practice Law by the U.S. Court of Appeals for the Fourth Circuit; the U.S. District Court, District of New Jersey; and the Supreme Court of New Jersey\n\nSpecialties: \nImmigration Law\nAdministrative Law\nCriminal Law\nCivil Litigation\n\nPossess invaluable work experience in law, public policy, and politics within both the Federal Government and non-profit sector.  Critical thinking, problem-solving, and research skills enhanced through complex assignments, with content surrounding relevant social issues.  Very strong work ethic and ability to lead and manage projects while being a team player.  Fast-learning, results-oriented, high-initiative and motivated professional.  Able to establish rapport, communicate, and present effectively to diverse groups ranging from client agencies, lead counsel, and elected officials, to non-profit organizations and constituent bases.", "pendingInvitation": false, "defaultPosition": {"posId": 852666191, "new": false, "current": true, "companyName": "United States Attorney's Office", "location": "Alexandria, Virginia", "title": "Special Assistant U.S. Attorney", "startedOn": {"month": 9, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:3565"}, "degree": 3, "fullName": "Raizza K. Ty", "positions": [{"posId": 852666191, "new": false, "current": true, "companyName": "United States Attorney's Office", "location": "Alexandria, Virginia", "title": "Special Assistant U.S. Attorney", "startedOn": {"month": 9, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:3565"}, {"posId": 593599738, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Arlington, VA", "title": "Assistant Chief Counsel", "startedOn": {"month": 8, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 507306847, "new": false, "current": false, "endedOn": {"month": 4, "year": 2014}, "companyName": "DHS/ICE Washington Office of the Chief Counsel", "description": "Appear in Immigration Court on behalf of the Department of Homeland Security (under supervision of a licensed attorney).  Prepare both master calendar hearings and merits hearings/trials. Cross-examine respondents in non-detained removal proceedings to determine credibility and statutory eligibility of immigration relief.  Handle cases involving asylum/refugee law, human rights persecution, fraudulent immigration activity, crimes of moral turpitude (CIMTs), terrorism-related inadmissibility grounds and exemptions, NACARA, and other issues of inadmissibility or removable offenses.  Litigated a complex LPR rescission case.  Drafted an appellate brief arguing that the IJ correctly ruled that Abduction is a particularly serious crime barring an applicant from receiving withholding of removal, which the Board of Immigration Appeals subsequently affirmed.  Argued against a respondent's application for immigration relief because he did not meet the definition of a refugee under the Immigration and Nationality Act, which resulted in the Immigration Judge ruling in favor of the government and ordering the respondent removed to his native country.", "location": "Arlington, VA", "title": "Law Clerk", "startedOn": {"month": 1, "year": 2014}}, {"posId": 441145651, "new": false, "current": false, "endedOn": {"month": 12, "year": 2013}, "companyName": "GW Law International Human Rights Clinic", "description": "Fact investigation and strategy development for human trafficking case involving violence and forced labor.  Assess client-victims' viable claims under the Trafficking Victims Protection Act (TVPA), state tort laws, federal statutes regulating the agricultural industry, and federal and state wage acts.  Present conclusions in written memoranda for distribution to legal partners.  Organize and write initial draft of complaint.", "title": "Fellow/Student Attorney", "startedOn": {"month": 8, "year": 2013}}, {"posId": 401234042, "new": false, "current": false, "endedOn": {"month": 8, "year": 2013}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "ICE conducts criminal investigations and immigration litigation to ensure that individuals seeking U.S. immigration benefits have not assisted or participated in genocide, extrajudicial killing, persecution, torture, or other human rights violations. \n\nHRLS is a legal team that works closely on effecting criminal prosecution and/or removal in conjunction with ICE special agents, removal officers, field attorneys, intelligence specialists, as well as with professionals in other departments and foreign law enforcement officials.\n\nDuties:\nAssist field attorneys in case strategy by reviewing investigative reports and assessing witness credibility from written testimony. Present factual information and reasoning from select cases to help frame legal issues for advisors. Compare agencyâ\u0080\u0099s enforcement policies with federal laws to ensure proper implementation and compliance.", "title": "Law Clerk, Human Rights Law Section", "startedOn": {"month": 5, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 359257898, "new": false, "current": false, "endedOn": {"month": 6, "year": 2013}, "companyName": "GW Law International Human Rights Clinic", "description": "Participated in the field investigation and litigation strategy of human trafficking case involving forced labor under the Trafficking Victims Protection Act (TVPA).  Drafted memorandum for co-counsel regarding potential tort claims in case under state law.  Interviewed clients to establish representation and develop additional facts for legal theories.", "title": "Student Attorney", "startedOn": {"month": 1, "year": 2013}}, {"posId": 326173576, "new": false, "current": false, "endedOn": {"month": 12, "year": 2012}, "companyName": "Superior Court of the District of Columbia", "description": "Assist deputy clerks in verifying client forms for temporary and civil protection orders.  Evaluate forms during client interview to determine legal sufficiency prior to submitting to court.  Question petitioners and respondents to develop necessary evidenciary background for case prior to the clients' appearance before the Court.", "title": "Volunteer Legal Intake Clerk for the Domestic Violence Unit", "startedOn": {"month": 9, "year": 2012}}, {"posId": 312277173, "new": false, "current": false, "endedOn": {"month": 8, "year": 2012}, "companyName": "United States Attorney's Office", "description": "Worked primarily with the Special Prosecutions/National Security Unit in the Criminal Division. Evaluated and prepared legal memorandum on the state of the law in threat cases, specifically with First Amendment challenges.  Research issues surrounding mental status of criminal defendants in pre-trial proceedings.  Assisted in drafting government's sentencing memorandum subsequently filed with the U.S. District Court, NDCA.", "location": "Northern District of California (San Francisco Branch)", "title": "Law Clerk", "startedOn": {"month": 5, "year": 2012}}, {"posId": 65767819, "new": false, "current": false, "endedOn": {"month": 8, "year": 2012}, "companyName": "United States Attorney's Office", "description": "Worked primarily with the General Defensive Unit in the Civil Division.  Evaluated witness deposition testimony to determine legal issues and confer with Assistant U.S. Attorneys to develop recommendations for inclusion in briefs.  Reviewed discovery and client litigation reports in actions against the U.S. government involving civil rights, employment discrimination, FOIA requests, and tort/Bivens claims. Drafted and provided discovery analysis in summary judgment declarations to weaken constitutional violation allegations against federal agency.  Led five-person team in researching city government tax and licensing regulations to assess building status of approximately 500 hotel properties", "location": "Northern District of California (San Francisco Branch)", "title": "Legal Assistant/Paralegal", "startedOn": {"month": 3, "year": 2009}}, {"posId": 65768178, "new": false, "current": false, "endedOn": {"month": 2, "year": 2009}, "companyName": "Alliance for Climate Protection", "description": "Wrote blog articles assessing new domestic and international energy programs and green technology.  Summarized existing legislation to improve organizationâ\u0080\u0099s public policy plan for elected officials.  Initiated and created training tools for composing weekly report summaries in energy policy, climate news, and local â\u0080\u009cgreenâ\u0080\u009d initiatives, which were disseminated to affiliates.  Produced fact-based content for a 50-state-page project that outlined successful energy programs by each U.S. state, which the Online team launched on the Repower America website.  Reported to the Solutions Development & Analysis, Partnerships, and Communications departments.", "location": "Menlo Park, CA", "title": "Current Affairs Fellow", "startedOn": {"month": 9, "year": 2008}}, {"posId": 82812568, "new": false, "current": false, "endedOn": {"month": 6, "year": 2008}, "companyName": "U.S. Department of State", "description": "Edited and revised the substance and accuracy of embassy reports for 2008 International Religious Freedom Annual Report published for Congress.  Drafted memorandum merging embassy cables and NGO articles to assist colleagues with approaches to prevent religious minority discrimination in the Near East & Northern Africa regions.  Successfully researched and evaluated a countyâ\u0080\u0099s progress in removing hate-based speech from its elementary and secondary school textbooks.  Attended briefings and symposiums on foreign policy initiatives in order to develop internal memorandum outlining key recommendations, as well as to present the information during office and Desk meetings.", "title": "Foreign Policy Intern (Bureau of Democracy, Human Rights, & Labor)", "startedOn": {"month": 3, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:3100"}, {"posId": 82812417, "current": false, "endedOn": {"year": 2008}, "companyName": "Hillary Clinton for President", "title": "Campaign Liaison", "startedOn": {"year": 2007}, "companyUrn": "urn:li:fs_salesCompany:21024"}, {"posId": 68512570, "new": false, "current": false, "endedOn": {"month": 12, "year": 2006}, "companyName": "Law Offices of Terry R. Price", "description": "Conducted legal research to obtain additional arguments and defenses that effectively aided case proceedings.  Assisted in drafting complaint for personal injury case.  Corresponded with clients and attorneys through written communication describing history of litigation matter.  Developed pleading indices, which improved general office organization.", "title": "Law Clerk", "startedOn": {"month": 8, "year": 2006}}], "pictureInfo": {}, "relatedColleagueCompanyId": 3565, "savedLead": false, "firstName": "Raizza K.", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/raizza-k-ty-45a95a11", "location": "Washington, District Of Columbia"}