{"lastName": "Canady, PHR, MBA, MSHRM", "objectUrn": "urn:li:member:20222197", "contactInfo": {"websites": [{"category": "OTHER", "dataSource": "LINKEDIN", "url": "http://southerncrescent.shrm.org"}, {"category": "OTHER", "dataSource": "LINKEDIN", "url": "http://shrm.org"}, {"category": "OTHER", "dataSource": "LINKEDIN", "url": "http://www.chra.army.mil"}]}, "crmStatus": {"imported": false}, "industry": "Human Resources", "educations": [{"endedOn": {"year": 2013}, "fieldsOfStudy": ["Human Resources Management/Personnel Administration, General"], "school": "urn:li:fs_salesSchool:20072", "degree": "Master of Science (M.S.)", "schoolName": "Strayer University-Georgia", "startedOn": {"year": 2012}, "eduId": 164294127}, {"endedOn": {"year": 2011}, "fieldsOfStudy": ["Alternative Dispute Resolution (Mediation)"], "degree": "Mediation Certification", "schoolName": "Justice Center of Atlanta", "startedOn": {"year": 2011}, "eduId": 64199994}, {"endedOn": {"year": 2009}, "fieldsOfStudy": ["Business Admin-Human Resources MGMT"], "school": "urn:li:fs_salesSchool:20072", "degree": "Executive Graduate Cert", "schoolName": "Strayer University", "startedOn": {"year": 2008}, "eduId": 59611311}, {"endedOn": {"year": 2006}, "fieldsOfStudy": ["Business Administration, Management and Operations"], "school": "urn:li:fs_salesSchool:18200", "degree": "Master of Business Administration (M.B.A.)", "schoolName": "Hawaii Pacific University", "startedOn": {"year": 2002}, "eduId": 16668603}, {"endedOn": {"year": 2001}, "fieldsOfStudy": ["Human Resources MGMT Generalist Program"], "school": "urn:li:fs_salesSchool:20466", "degree": "HR Certificate", "schoolName": "Clayton State University", "startedOn": {"year": 2001}, "eduId": 59780609}, {"endedOn": {"year": 1991}, "fieldsOfStudy": ["Management"], "school": "urn:li:fs_salesSchool:18574", "degree": "Bachelor of Science", "schoolName": "University of Maryland University College", "startedOn": {"year": 1986}, "eduId": 59611106}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAE0kPUBQSZQWIDWoi5EjzRbT9TS44bYb8k,NAME_SEARCH,undefined)", "numOfConnections": 1177, "showTotalConnectionsPage": false, "headline": "Collegiate Online Instructor at Rasmussen College and Online Education", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Diversified HR Professional, Personnel Analyst, and Business Partner who seeks to build, sustain, and transform work environments into highly productive and efficient business unit.\n\nTwenty (20) plus years of leading and developing individuals and teams, establishing organizational systems and processes; administering and enforcing compliance, and managing events and assets.  Knowledge and ability in human resource functions, consulting, mediation, and investigations have positively contributed to organizational effectiveness, high morale, and the quality of life of people. \n\nInstructor, Trainer, and Developer who provides online, traditional and non-traditional classroom and field instructions for students and teams of all levels and backgrounds.  Training consist of human resource functions, job specific duties, health & fitness, military history, leadership, management, personal finances, budgetary controls, organizational development and community programs.  \n\nï\u0083¼\tDirector of Diversity on local SHRM Board of Directors, 2007\nï\u0083¼\tCertified Professional in Human Resource (PHR) and re-certified X 4\nï\u0083¼\tCertified/Registered Mediator (Neutral) w/ Clinical Practicum\nï\u0083¼\tCertified Distinguished Leader (US Army) for ability to lead, manage, and obtain results\nï\u0083¼\tRecipient and member of the Alpha Chi National College Honor Scholarship Society \nï\u0083¼\tRecipient and member of Golden Key International Honor Society\nï\u0083¼\tGraduated in top 20% of competitive TRNG MGMT Course with superior ratings\nï\u0083¼\tPlanned and co-managed 17 agencies 2010 CFC Drive raising $450K \nï\u0083¼\tNational member of the Society of Human Resources Management (SHRM)\n\nCore Specialties: HR Administration, Staffing  & Placement, Compensation & Benefits, Mediation, Employee/LR, Org Development, and  Policy Administration.", "pendingInvitation": false, "defaultPosition": {"posId": 408491156, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Supervised and managed eight (8) administrative specialists servicing 316 fulltime employees (FTEs) who executes and implement HR activities and Budget execution in excess of $100M in Georgia, North Carolina, and South Carolina.   Conducts administrative inquiries and investigations IAW with Title VII, Civil Rights Act  of 1964, Code of Federal Regulations, DOL guidance and local policies.  Performs staffing, and placement activities that include vacancy announcements, posting of merit and non-compete certifications for promotion and selection panels.  Recruit for FTEs, interns, wounded warrior project while overseeing entrance on duty (EOD), and on boarding.", "title": "Supervisor & MS Specialist", "startedOn": {"month": 4, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Winston R. Churchill Canady, PHR, MBA, MSHRM", "positions": [{"posId": 408491156, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Supervised and managed eight (8) administrative specialists servicing 316 fulltime employees (FTEs) who executes and implement HR activities and Budget execution in excess of $100M in Georgia, North Carolina, and South Carolina.   Conducts administrative inquiries and investigations IAW with Title VII, Civil Rights Act  of 1964, Code of Federal Regulations, DOL guidance and local policies.  Performs staffing, and placement activities that include vacancy announcements, posting of merit and non-compete certifications for promotion and selection panels.  Recruit for FTEs, interns, wounded warrior project while overseeing entrance on duty (EOD), and on boarding.", "title": "Supervisor & MS Specialist", "startedOn": {"month": 4, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 642048614, "new": false, "current": false, "endedOn": {"month": 5, "year": 2016}, "companyName": "Rasmussen College", "description": "Collegiate Online Instructor who facilitates, coaches and mentors 20 to 30 learners in a wide-range of Human Resource activities delineated in the functional areas of Introduction to HR, Compensation & Benefits, Recruitment & Staffing, and Employee and Labor Relations at both the strategic and operational levels.  Plan and assign course-work while fostering technical and business acumens.  Provides professional assistance in learning and applying various concepts, techniques, and methods throughout an eleven (11) week academic environments.  ", "location": "Online", "title": "Collegiate Online Instructor", "startedOn": {"month": 7, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:165661"}, {"posId": 152663308, "new": false, "current": false, "endedOn": {"month": 4, "year": 2011}, "companyName": "US Army Forces Command", "description": "Human Resources Program Manager:\nHR Program Manager at Army Command servicing 200,000 Personnel in Human Capital Management, Policy, and Program matters relating to Compensation, Benefits, & Entitlements; Human Capital Management (HCM); Coordinates personnel services and integration through planning, preparing and executing staff and Senior Executive Officers Briefings, Information Papers, and Updates of Strategic Initiatives.", "location": "Fort McPherson, GA", "title": "Human Resources Program Manager", "startedOn": {"month": 2, "year": 2010}}, {"posId": 152673312, "new": false, "current": false, "endedOn": {"month": 2, "year": 2010}, "companyName": "HQ Forces Command", "description": "HR Specialist (TNG & DEV): \nPlans, organizes, and conducts a wide-range of human resources training and information systems (HRIS) analysis that supports strategic operations, workforce planning, organizational development, performance management, and rewards/recognition. Administer specialized HR training and development (HRTD) that includes Casualty and Postal Operations. Consults with leadership on training, organization effectiveness, improvement techniques, assessment findings, and corrective actions in accordance with (IAW) prevailing laws.\n\nStudent Development:\nDevelops and fosters intellectual and social development of students.  Implements and delivers training instructions in multiple learning environments.  Facilitates and teach course instructions, presentations, and institutional procedures and guidelines.  Provide professional assistance for students in learning and applying concepts in various humanities, mathematics, management, and English.  Prepares and manages classroom and facilities for efficient and effective learning/ training.  Acquires and account for resources, supplies, and material for developmental activities.", "title": "HR SPEC (Training & Development)", "startedOn": {"month": 9, "year": 2007}}, {"posId": 643093873, "new": false, "current": false, "endedOn": {"month": 6, "year": 2008}, "companyName": "Clayton County Board of Education", "description": "Planned, developed, and delivered training instructions while fostering the intellectual and social developmental skills of students. Implement and deliver training instructions in multiple learning environments relating to humanities and career development. Prepared, and managed classrooms for efficient and effective learning/training.  Acquired and accounted for resources, supplies, and material for developmental activities.", "location": "Clayton County Georgia", "title": "Student Developer", "startedOn": {"month": 8, "year": 2007}}, {"posId": 152670036, "new": false, "current": false, "endedOn": {"month": 6, "year": 2007}, "companyName": "EG&G Technical Services", "description": "Senior Human Resources Manager:\nManaged 13 HR practitioners that delivered HR services for 4000 employees dispersed in the US and internationally.\n\nDeveloped and managed the accomplishment of HR business objectives. Recruited and staffed candidates; designed and classified jobs consistent with DOL and Federal classification system. Supervised compensation and benefits programs. \n\nEmployee Relations Specialist, resolving personnel, organizational matters, and individual crisis for business units in the United State and abroad. Mediated, investigating and resolving issues relating to the Civil Right Act, Title VII--EEO, ADA, ADEA, DOL and employee issues in Fortune 500 and 100 companies. \n\nPrepared, approved, and submitted responses for DOL hearings, unemployment claims, EEOC dispositions, and personal lawsuits. Mediated and negotiated organizational conflicts.", "title": "Senior Human Resources Manager,", "startedOn": {"month": 8, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:8974"}, {"posId": 152667517, "new": false, "current": false, "endedOn": {"month": 8, "year": 2003}, "companyName": "Target", "description": "HR MGER & District ER: \nManaged and supervised HR programs and activities for 275 employees from diverse backgrounds. Recruited, interviewed, and staffed stores to maintain employee base consist with meeting sales goal of $50M annually. Supervises five employees responsible for payroll, controllable accounts, benefits, store scheduling, and training.\n\nOversaw District Employee Relations Issues and programs for 10 stores and 1700 employees. Collaborated with management on all employee relation and training matters. Proactively identified employee relation issues, proposed solutions and followed through on implementation. \n\nSource applicants utilizing a variety of recruiting sources including newspaper advertising, internet sources, colleges, professional publications and associations and internal and external career and job fairs. Collaborated with district and corporate HR to conduct Trade Shows, job and career fairs.", "title": "HR MGER & District ER", "startedOn": {"month": 10, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:1512"}, {"posId": 152658586, "new": false, "current": false, "endedOn": {"month": 12, "year": 2000}, "companyName": "US Army Chemical Corps", "description": "CSM (SR HR & Development Leader) \n\nCo-managed and oversaw personnel action center (S-1) that provided HR functions to 3,200 personnel annually in compliance with regulations, policies and procedures. Collaborated with Division [personnel managers] at Department of the Army and TRADOC to assign strategically Human Capital according to organizational needs. \n\nDirected the placement, developmental needs, and promotion and award requirements for organizational personnel. Managed all aspects of the Personnel Management IAW Laws, Regulations, Policies and directives. Chaired multi-level executive briefs and advised Senior Executives on ORG effectiveness and state of readiness for organization. \n\nMentored all levels of leadership and management on personnel management and quality life matters. Served as member of interview panel for DOD civilians and President of organizational promotion boards for military personnel.\n\nBranch Chief and Program Manager: \nSupervised the professional development and conduct of 15 facilitators; ensured the implementation of 550 hours of \nInstructions; developed lesson plans, training aids, test and other material required to support instructions.  \n\nManaged and supervised studentsâ\u0080\u0099 academic affairs, such as, test and evaluations; progress reports; studentâ\u0080\u0099s probation and dismissal notices, and appeals process.  Approved and supervised preparation of academic evaluation reports, diplomas, and letters of career potential.  Tracked and monitored academic progress essential to identifying both honor graduate and distinguish class leader.  \n\nPrepared and submitted class evaluation data report for the Commandant (Provost) and Department of the Army.  Planned, coordinated, and participated in all welcome receptions, orientations, and graduation events.", "title": "CSM (SR HR & Development Leader)", "startedOn": {"month": 10, "year": 1974}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Winston R. Churchill", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/winston-r-churchill-canady-phr-mba-mshrm-7b19326", "location": "Greater Atlanta Area"}