{"pendingInvitation": false, "defaultPosition": {"posId": 698058042, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Assistant Director - OFM", "startedOn": {"month": 8, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "objectUrn": "urn:li:member:438274678", "contactInfo": {}, "crmStatus": {"imported": false}, "degree": -1, "fullName": "", "industry": "Law Enforcement", "positions": [{"posId": 698058042, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Assistant Director - OFM", "startedOn": {"month": 8, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 698244187, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As Assistant Director, I exercise full authority, under the direction of the FinOps Director, and I am accountable and responsible for managing, administering and directing the Dallas Finance Center operations. Additionally, I lead, direct and motivate a diverse organization of 100 managers and employees to attain results oriented performance.\n\nI am responsible for the numerous management functions needed to operate the FinOps, including implementing policies and procedures, business processes and financial system requirements resulting from financial audits findings and internal management improvement initiatives. I provide primary FinOps oversight for accounting, budget, financial reporting and customer service. I provide technical direction to staff engaged in analyzing and interpreting transactions, applying accounting concepts, and managing/supervising an accounting program. This includes the formulation, presentation, and execution of the FinOps budget, and control systems. I oversee operations and ensure accountability of all processes and systems. I establish internal and system controls and processes compatible with Treasury, OMB, DHS, and GAO requirements. I provide accountability for agency funds and assets and full disclosure of the financial results of agency operations.\n\nAs Assistant Director, I supervise various levels of the organization including immediate staff, managers and employees. I provide direct supervision to immediate staff and direct subordinate supervisors responsible for planning, organizing, evaluating and analyzing financial policies and procedures and performing financial reviews in support of the DHS fiscal programs. And finally, through subordinate supervisors, I lead and motivate a staff of ICE full-time employees, term and temporary employees and contractors. I implement and administer various personnel and equal opportunity program rules and regulations within the Federal and Agency guidelines and procedures. ", "title": "Assistant Director, Office of Financial Management", "startedOn": {"month": 8, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 698291461, "new": false, "current": false, "endedOn": {"month": 8, "year": 2009}, "companyName": "BearingPoint Consulting", "description": "Managing a large project with 40 contract employees in the Federal Government. Managing a centralize payment center support staff for multiple agencies. Continuous evaluation and analysis on financial transactions to ensure the appropriateness and accuracy of transactions and the impact on the government financial statements and overall agency funding. Assisting the federal government to develop, execute and maintain accounts payable business processes and to improve the overall financial data quality within Federal Financial Management System. Performing lean six sigma activities to improve operations.", "location": "McLean, VA", "title": "Finance Manager -Project Manager-", "startedOn": {"month": 5, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:1349"}, {"posId": 698291503, "new": false, "current": false, "endedOn": {"month": 3, "year": 2008}, "companyName": "BearingPoint Consulting", "description": "Managed the Program Control Organization (PCO) and 15 accounting and finance professionals specializing in accounting, revenue recognition and financial analysis. \n\nWorked with leadership to build a brand new organization to establish financial management and control over client delivery engagements from contract signing to closing. \n\nDesigned and implemented controls to address material weaknesses (that included revenue recognition, contract set-up, subcontractor costs, non-system generated invoices and project ledger to general ledger reconciliations) in the internal control over financial reporting. \n\nEstablished control points to comply with Sarbanes-Oxley requirements.\nManaging the Program Control Organization to support SEC Reporting, Implementing SOX, internal controls, reviewing contracts, projects and developing estimate-to-complete calculations. Demonstrated heavy revenue recognition principles to segment cost management with professional business acumen. Provide management analysis of monthly financial results and presentation of status to senior management.\n", "location": "McLean, VA", "title": "Finance Manager", "startedOn": {"month": 11, "year": 2006}}, {"posId": 698291615, "new": false, "current": false, "endedOn": {"month": 3, "year": 2006}, "companyName": "Elite City Management and Consulting", "description": "Demonstrated heavy revenue recognition principles to segment cost management. Provided monthly financial analysis to management of business results. Performed business process improvements and established department procedures.\n\nSox leader for four divisions of Aerospace & Defense manufacturer with full-cycle project responsibility including: business process documentation, key control identification, control matrix and test plan development, testing, remediation plan development and management and final testing including summary reporting of results. Additionally, assisted the corporate project executive with company-wide SOX needs including corporate fraud assessment controls as well as remediation reporting for management and the Audit Committee.", "location": "Conyers, GA", "title": "Consulting Director", "startedOn": {"month": 1, "year": 2005}}, {"posId": 698292358, "new": false, "current": false, "endedOn": {"month": 3, "year": 2006}, "companyName": "Callaway Partners", "description": "Performed Revenue Recognition determination, Sarbanes Oxley and Internal Audits on Financial Service, Commercial Service and Public Service Contracts. Demonstrated heavy revenue recognition principles to segment cost management. Provided monthly financial analysis to management of business results. Performed business process improvements and established department procedures.", "location": "Atlanta, GA", "title": "Senior Consultant", "startedOn": {"month": 1, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:16295"}, {"posId": 698292434, "new": false, "current": false, "endedOn": {"month": 12, "year": 2004}, "companyName": "United Water Services", "description": "Provided financial leadership to the overall management and operation of the Atlanta water system, over 350 employees. Planned, organized, staffed and controlled finance, accounting, administration, material, purchasing and IT organizations. Prepared financial forecasts; analyzed financing alternatives; and prepared budgets for the six cost centers. Other responsibilities included cash management, provided cash flow forecasting and capital expenditure analysis, and oversaw local bank financing and banking relations. Reported to the Director/Plant Manager.", "location": "Atlanta, GA", "title": "Business Controller", "startedOn": {"month": 5, "year": 2001}}, {"posId": 698292454, "new": false, "current": false, "endedOn": {"month": 5, "year": 2001}, "companyName": "Carrier Transicold", "description": "I was responsible for providing direction and leadership to the overall manufacturing operation, over 500+ employee, $309MM Refrigeration Division. Accountable for planning, organizing, staffing and controlling finance and accounting. Created annual budgets, monthly variance analysis, financial presentations, and division 5-year projections. Experience includes budget preparation, job cost accounting, financial projections, and providing business investment recommendations. Assisted plant management in decision making process that allows for cost reduction, and performance improvements. Managed lean manufacturing projects, Kaizen events, 5S activities. Defined and implemented the appropriate change management strategy and plans to ensure that change management concerns were addressed during and after the implementation. Reported to the Director/Plant Manager, Truck/Trailer, North America.", "title": "Plant Controller", "startedOn": {"month": 11, "year": 1998}, "companyUrn": "urn:li:fs_salesCompany:2430"}, {"posId": 698295420, "new": false, "current": false, "endedOn": {"month": 11, "year": 1998}, "companyName": "United Technologies", "description": "Managed financial & operational reviews for UTC's commercial divisions (Carrier and United Technologies Automotive) and aerospace division (Pratt-Whitney). Financial audits assess GAAP compliance and the adequacy of existing business controls at operating and newly acquired entities. Operational reviews focus on improving working capital turnover, manufacturing efficiencies and assessing the adequacy of supporting information systems. Managed risk assessment and prepared annual audit plan recommendations for UTC Corporate entities. Administrative functions include developing and presenting annual audit plan, hiring and developing audit team members and maintaining auditee relationships.", "title": "Manager Interna Audit - Americas Region", "startedOn": {"month": 11, "year": 1996}, "companyUrn": "urn:li:fs_salesCompany:2426"}, {"posId": 698292525, "new": false, "current": false, "endedOn": {"month": 11, "year": 1996}, "companyName": "Sikorsky Aircraft (A UTC Company)", "description": "Lead the commission, billing processes and provided Sales/Cost of Sales analysis to the corporate controller.", "location": "Stratford, CT", "title": "Section Supervisor of Spares Management", "startedOn": {"month": 2, "year": 1994}}], "educations": [{"endedOn": {"year": 1994}, "fieldsOfStudy": ["Finance, General"], "school": "urn:li:fs_salesSchool:18031", "degree": "Master of Business Administration (MBA)", "schoolName": "University of Connecticut", "startedOn": {"year": 1992}, "eduId": 295528259}, {"endedOn": {"year": 1982}, "school": "urn:li:fs_salesSchool:18750", "degree": "Bachelor of Business Administration (B.B.A.)", "schoolName": "The University of Southern Mississippi", "startedOn": {"year": 1979}, "eduId": 295522821}], "pictureInfo": {}, "inmailRestriction": "NO_RESTRICTION", "relatedColleagueCompanyId": 533534, "savedLead": false, "unlocked": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "entityUrn": "urn:li:fs_salesProfile:(ACwAABofinYBT1aPR_QMtZWPIbE4Um09FY8l-zs,NAME_SEARCH,undefined)", "numOfConnections": 0, "flagshipProfileUrl": "https://www.linkedin.com/in/charles-curry-21a93b102", "location": "Irving, Texas", "showTotalConnectionsPage": false, "headline": "Assistant Director, Office of Financial Management at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}}