{"lastName": "Cook", "objectUrn": "urn:li:member:385434702", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Relations", "educations": [{"endedOn": {"year": 2018}, "fieldsOfStudy": ["Acquisition"], "degree": "Masters of Business Administration", "schoolName": "University of Maryland University College", "startedOn": {"year": 2016}, "eduId": 250803103}, {"endedOn": {"year": 2014}, "fieldsOfStudy": ["Acquisition/Contract Management"], "school": "urn:li:fs_salesSchool:20072", "degree": "Business Administration", "schoolName": "Strayer University", "startedOn": {"year": 2010}, "eduId": 250800754}, {"endedOn": {"year": 2004}, "degree": "High School Diploma", "schoolName": "Cesar Chavez High School for Public Policy", "startedOn": {"year": 2000}, "eduId": 314889201}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAABb5RE4BYujCAqgiAlGbAkX1hcDwWcYhCU8,NAME_SEARCH,undefined)", "numOfConnections": 134, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFTkaQhwbmPyQ/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=JZUrkpsHdqIdEEJSUJo_yQB75ePDPinUIZlDcwA5m2o", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFTkaQhwbmPyQ/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=YZZDlsBvSnqlcwTb_7RRJVdQR3Mpc7vUyLNYQJ6q-us", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFTkaQhwbmPyQ/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=TcfJ4JDpND7o6HhOXuudUdTt1dw_1Z_yTzsZJEIZ8Ys", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4E03AQFTkaQhwbmPyQ/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=Xrui0ay_-L1E75YY78LebDi6y5rA7Em6fhmwuE6SaP4", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Contract Specialist", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Exceedingly competent Contract Specialist with 8 years of experience in contract closeout and acquisitions.  Highly detailed-oriented with the ability to work independently on multiple projects simultaneously.  Dedicated to providing innovative procedures to efficiently and effectively process complex acquisitions that result in government cost savings.  Deliver excellent leadership skills when managing individuals of diverse backgrounds to guarantee customer satisfaction.  Possess an immense amount of knowledge in the principles of contracting, specifically the Federal Acquisition Regulations (FAR) to ensure a successful outcome when engaging in business activities with contractors.  Acquired a Bachelorâ\u0080\u0099s Degree in Business Administration with a minor in Acquisitions and Contract Management.  Currently, pursuing a Masters of Business Administration with a minor in Acquisitions and a Federal Acquisition Certification (FAC-C) Level 1 certification contracting.", "pendingInvitation": false, "defaultPosition": {"posId": 762649876, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢Review requisitions to determine that proper specifications/purchase descriptions are included in solicitation documents\nâ\u0080¢Evaluate bids or proposals for compliance with specifications/purchase descriptions and applicable clauses\nâ\u0080¢Procure items awarded through formal advertising and use of negotiation techniques\nâ\u0080¢Administer previously negotiated and formally advertised contracts\nâ\u0080¢Consider financial responsibility of suppliers by evaluating contract performance on previous contracts\nâ\u0080¢Review solicitations and amendments for adequacy and completeness\nâ\u0080¢Monitor vendor performance for compliance with terms and conditions of the award\nâ\u0080¢Participate with higher-level specialist in procurement using formal advertisements\nâ\u0080¢Participate as a team member on an Acquisition Management Review Team or equivalent assignments", "location": "Washington D.C. Metro Area", "title": "Contract Specialist", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Demetirus Cook", "positions": [{"posId": 762649876, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "â\u0080¢Review requisitions to determine that proper specifications/purchase descriptions are included in solicitation documents\nâ\u0080¢Evaluate bids or proposals for compliance with specifications/purchase descriptions and applicable clauses\nâ\u0080¢Procure items awarded through formal advertising and use of negotiation techniques\nâ\u0080¢Administer previously negotiated and formally advertised contracts\nâ\u0080¢Consider financial responsibility of suppliers by evaluating contract performance on previous contracts\nâ\u0080¢Review solicitations and amendments for adequacy and completeness\nâ\u0080¢Monitor vendor performance for compliance with terms and conditions of the award\nâ\u0080¢Participate with higher-level specialist in procurement using formal advertisements\nâ\u0080¢Participate as a team member on an Acquisition Management Review Team or equivalent assignments", "location": "Washington D.C. Metro Area", "title": "Contract Specialist", "startedOn": {"month": 1, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 739080149, "new": false, "current": false, "endedOn": {"month": 1, "year": 2016}, "companyName": "OpenText", "description": "â\u0080¢\tLead a team of Contract Analysts on contracts based initiatives \nâ\u0080¢\tReview contracts contained in OpenText archives and database\nâ\u0080¢\tIdentify relevant contract information\nâ\u0080¢\tClassify contracts based on type and content\nâ\u0080¢\tEnter contract information on contract management system\nâ\u0080¢\tUpdate and manage online contract management system\nâ\u0080¢\tFacilitate meetings and translate requirements into defined business solutions\nâ\u0080¢\tTrain new Contract Analysts on project requirements and respond to questions from Contract \n Analysts working both locally and remotely \nâ\u0080¢\tInterface with OpenText Contract Managers/attorneys regarding requirements, problems and \n work plans and to work with other functional teams at OpenText involved in the project, \n including Legal, Information Technology and Finance\n", "location": "Gaithersburg, MD", "title": "Team Lead/Acquisition Specialist", "startedOn": {"month": 11, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:2709"}, {"posId": 675767753, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "Premier Management Corporation", "description": "â\u0080¢Prepare appropriate documents for contract files to be closed out in accordance with Federal Acquisition Regulations (FAR) 4.804 and NIST policy and procedures. \nâ\u0080¢Perform analyses and reconciliations of financial transactions including invoices, Government payments and audit reports\nâ\u0080¢Input contractual data into internal and external business management and financial systems \n(i.e., ComprizonSuite [C-Request and C-Award], Commerce Business Systems Portal [CBS], and Federal Procurement Data System [FPDS] to ensure proper closeout of orders  \nâ\u0080¢Prepare memoranda to obtain Contracting Officer Representative (COR) certification that all goods/materials have been received or that all services have been completed\nâ\u0080¢Verify all contractual invoices have been submitted and paid before closing a contract\nâ\u0080¢Draft modifications for the Contracting Officerâ\u0080\u0099s (CO) approval and signature to assist the Government to recover any unexpended funds (i.e., unliquidated obligations [ULO])\nâ\u0080¢Prepare appropriate forms and completion statements to be signed by the CO to effectuate closeout\nâ\u0080¢\tProvide monthly reports of closeout activities to government personnel and management\n", "title": "Contract Specialist", "startedOn": {"month": 5, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:1027213"}, {"posId": 607596482, "new": false, "current": false, "endedOn": {"month": 4, "year": 2015}, "companyName": "B3 Solutions, LLC", "description": "â\u0080¢\tProvide leadership, technical support, and direction to contract closeout team tasked with completing a variety of contract closeouts such as IDIQâ\u0080\u0099s, Cost Plus Fixed Feeâ\u0080\u0099s, Cost Reimbursable, Cost Sharing, Time and Materials, Labor Hour, Firm Fixed Price, Fixed Price, Sole Source, Task Orders, Delivery Orders, Purchase Orders, Interagency Agreements, Simplified Acquisition Procedures, Blanket Purchase Agreements, De-obligations and Undelivered Obligations (UDOâ\u0080\u0099S).\nâ\u0080¢\tEvaluate contracts, subcontracts, and invoice information to ensure closeout documentation and packages are submitted to the government in compliance with DCMA/DCAA, FAR, and contractual terms and conditions and audit requirements\nâ\u0080¢\tPerform cost analysis by reconciling contract funding obligations and expenditures within the governmentâ\u0080\u0099s financial system.\nâ\u0080¢\tPrepare and suspend final vouchers for submission to the payment office. \nâ\u0080¢\tAudit contractorâ\u0080\u0099s cost proposals to determine indirect, direct, allocable, allowable, and unallowable costs.\nâ\u0080¢\tRead and interpret contract terms and conditions including indirect cost rate agreements and audit reports.\nâ\u0080¢\tApply contractorsâ\u0080\u0099 indirect cost rates to their indirect costs categories (overhead, g&a) to determine accurate indirect costs data.\nâ\u0080¢\tAssist the Contracting Officer in negotiating Quick Closeouts in accordance with FAR 42.708\nâ\u0080¢\tSubmit contractual data in Federal Procurement Data System (FPDS), Comprehensive Acquisition Management System (CAMS) Departmental Contracts Information System (DCIS) to finalize closeout actions. \nâ\u0080¢\tAttend and conduct meetings with the Contracting Officer, Contracting Officer Representative, Division Directors, and management pertaining to contract closeout.\nâ\u0080¢\tConduct interviews of potential employees and conduct yearly performance evaluations of current employees.   \nâ\u0080¢\tCreate and distribute monthly reports to the Contracting Officer and management, which capture closeout numbers, deobligation amounts, challenges, and procedures.", "title": "Team Lead of Contract Closeout", "startedOn": {"month": 11, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:333546"}, {"posId": 607595667, "new": false, "current": false, "endedOn": {"month": 11, "year": 2011}, "companyName": "B3 Solutions, LLC", "description": "â\u0080¢\tWorkload required closing over 2,000 inactive contracts (dated 1990 to 2010) and all current/future contracts for Centers for Medicare & Medicaid Services (CMS).\nâ\u0080¢\tReviewed expired contracts and task orders to determine their type, contract limitations, contract periods, types of costs, legal status, indirect rates and ceilings when applicable.\nâ\u0080¢\tVerified accuracy of contractorsâ\u0080\u0099 indirect cost rate agreements.\nâ\u0080¢\tRead and interpret contract terms and conditions including indirect cost rate agreements and audit reports.\nâ\u0080¢\tApplied contractorsâ\u0080\u0099 indirect cost rates to their indirect costs categories (overhead, g&a) to determine accurate indirect costs data.\nâ\u0080¢\tVerified contractorsâ\u0080\u0099 fee retention amounts and ensure that the contractor is paid their full fee after contract completion. \nâ\u0080¢\tReconciled contractorâ\u0080\u0099s previous paid invoices against agency financial data to ensure that the contractor accurately billed the government for their direct and indirect costs.\nâ\u0080¢\tPrepared and suspend final vouchers for submission to the payment office. \nâ\u0080¢\tDetermined disallowed costs and deobligation funding in CAMS and DCIS.  \nâ\u0080¢\tPerformed desk audits on contracts to reconcile direct and indirect costs billed during the term of the contract by applying the indirect cost rates by year.\nâ\u0080¢\tAssisted in writing and editing of CMS contract closeout policy and guidebook.\nâ\u0080¢\tServed as the Back-up to the Records Liaison Officer (RLO) and the Vital Records Coordinator (VRC), ascertains monitoring, compliance, and determining which records within (OAGM).\nâ\u0080¢\tAbided by the Federal Acquisition Regulations (FAR) and Health and Human Services Acquisition Regulations (HHSAR) when closing contracts.", "title": "Contract Closeout Specialist", "startedOn": {"month": 11, "year": 2010}, "companyUrn": "urn:li:fs_salesCompany:333546"}, {"posId": 607598506, "new": false, "current": false, "endedOn": {"month": 11, "year": 2010}, "companyName": "DeAnder Associates", "description": "â\u0080¢\tSupported contract closeout activities for IDIQâ\u0080\u0099s, Cost Plus Fixed Feeâ\u0080\u0099s, Cost Reimbursable, Cost Sharing, Time and Materials, Labor Hour, Firm Fixed Price, Fixed Price, Sole Source, Task Orders, Delivery Orders, Purchase Orders, Interagency Agreements, Blanket Purchase Agreements, De-obligations and Undelivered Obligations (UDOâ\u0080\u0099S).\nâ\u0080¢\tExamined and evaluated contract financial history, perform indirect cost adjustment analysis, provide solutions to resolve contract settlements.\nâ\u0080¢\tManaged workload by utilizing information management systems including automated financial management systems and procurement data systems.  \nâ\u0080¢\tMaintained closeout management reports and responsible for records management.", "title": "Contract Closeout Analyst", "startedOn": {"month": 4, "year": 2010}}, {"posId": 607598797, "new": false, "current": false, "endedOn": {"month": 4, "year": 2010}, "companyName": "Minority Advancement, Inc. (MAIC)", "description": "â\u0080¢\tInventoried and Queried MAIC database for Contract Files, assigned Closeout Files to Data Analyst. \nâ\u0080¢\tConducted training sessions for Data Analyst for closing and reconstructing contracts in Procurement Request Information System (PRISM).\nâ\u0080¢\tPerformed contract closeout functions and document status using the checklist and the automated tracking system.  \nâ\u0080¢\tPhysically reconstructed Contract Closeout Files for Data Analysis and final disposition of records and prepared Contract files in accordance with the Federal Acquisition Regulations 4.804 (FAR).", "title": "Data Analyst II / Contract Closeout Specialist", "startedOn": {"month": 9, "year": 2008}}, {"posId": 607800629, "new": false, "current": false, "endedOn": {"month": 9, "year": 2008}, "companyName": "Minority Advancement, Inc. (MAIC)", "description": "â\u0080¢\tPrepared Contract files in accordance with the Federal Acquisition Regulations 4.804-5 (FAR).\nâ\u0080¢\tVerified payment history in the Federal Financial Management Systems (FFMS) Accounting database.\nâ\u0080¢\tPrepared modifications for closeout in the Procurement Request Information System (PRISM).\nâ\u0080¢\tAssembled contract files for archiving for the Federal Record Center (FRC).", "title": "Data Analyst I / Contract Closeout Specialist", "startedOn": {"month": 4, "year": 2008}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Demetirus", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/demetirus-cook-5a60b8a9", "location": "Washington D.C. Metro Area"}