{"lastName": "Herbert", "objectUrn": "urn:li:member:69668589", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 2011}, "fieldsOfStudy": ["Communication"], "school": "urn:li:fs_salesSchool:17914", "degree": "Bachelor of Arts (BA)", "schoolName": "Santa Clara University", "startedOn": {"year": 2007}, "eduId": 46458221}, {"endedOn": {"year": 2007}, "schoolName": "Northfield Mount Hermon School", "startedOn": {"year": 2004}, "eduId": 57724601}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAQnDu0BwSrbzKEKSjTXdEFUqr1vKhyHMws,NAME_SEARCH,undefined)", "numOfConnections": 366, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQF7TUzxPkHP0A/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=x9-sNM8ErL1Y5AJY6z4T6yNQDxH3ImaWzuRLP9Mqeqw", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQF7TUzxPkHP0A/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=dKUCvwknbqim2x0MVFUzJfgwkoG2mvynlJFGVq0YY48", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQF7TUzxPkHP0A/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=kQNSIi1pZReADw-0D3oJ4SeOwI8QPiGwtOhZnYXXKZw", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C4D03AQF7TUzxPkHP0A/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=MYjKsVSa5Ntt7w4V2OmL_WL7V4JehpALTx5be92b5lc", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Contract Specialist at U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "â\u0080¢Experienced working with federal clients on site\nâ\u0080¢Fast learner, detail oriented, and self-motivated\nâ\u0080¢Strong written and oral communication skills\nâ\u0080¢Comfortable and effective working with clients on several projects at once\nâ\u0080¢Team oriented leader who motivates others to exceed expectations\nâ\u0080¢Excellent at presenting and communicating complex ideas clearly\nâ\u0080¢Able to develop strong working relationships with colleagues and clients\n", "pendingInvitation": false, "defaultPosition": {"posId": 1274094974, "new": true, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Dallas/Fort Worth Area", "title": "Contract Specialist", "startedOn": {"month": 4, "year": 2018}}, "degree": 3, "fullName": "Shereen Herbert", "positions": [{"posId": 1274094974, "new": true, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Dallas/Fort Worth Area", "title": "Contract Specialist", "startedOn": {"month": 4, "year": 2018}}, {"posId": 857988012, "new": false, "current": false, "endedOn": {"month": 4, "year": 2018}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "location": "Washington D.C. Metro Area", "title": "Contract Specialist", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 848379428, "new": false, "current": false, "endedOn": {"month": 9, "year": 2016}, "companyName": "E3 Federal Solutions, LLC", "description": "Department of Homeland Security, Immigration and Customs Enforcement, Office of Acquisition Management\nâ\u0080¢Conduct interviews with ICE employees to gain a strong understanding of current processes in designated contract sections; Detention, Compliance and Removals (DCR), Information Technologies Division (ITD), and Mission Support (MS). Summarize key findings and interview notes for client use. \nâ\u0080¢Experience interpreting and applying laws, regulations, policies and procedures relevant to contracting and detention issues, including performance based national detention standards (PBNDS), Services Contract Act, Prison Rape Elimination Act (PREA), etc. \nâ\u0080¢Experience reviewing a variety of service contracts including IT support services, financial management services, detention management services and guard services.\nâ\u0080¢Strong understanding of solicitation, administration, close-out and termination of purchase orders and contracts.\nâ\u0080¢Review requisitions to ensure proper specification or descriptions are included and evaluate bids or proposals for compliance. \nâ\u0080¢Implement new processes and procedures to improve work flow and increase efficiency. Establish and adjust administrative policies and procedures as needed.\nâ\u0080¢Create process maps for OAQ current processes, make recommendations for process improvement, and draft standard operating procedures.\nâ\u0080¢Create and implement a database to improve OAQ response time to DHS data calls and Freedom of Information Act requests (FOIA). \nâ\u0080¢Develop new naming conventions for contract files and improve electronic filing system. \nâ\u0080¢Attend biweekly status meetings with OAQ leadership. Report proceedings back to team and write up meeting minutes. \nâ\u0080¢Organize, schedule, and lead meetings and conference calls among various OAQ departments. \nâ\u0080¢Develop and disseminate meeting agendas, presentation tools, and supporting documents. \n", "title": "Senior Analyst", "startedOn": {"month": 9, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:201597"}, {"posId": 644757987, "new": false, "current": false, "endedOn": {"month": 9, "year": 2015}, "companyName": "E3 Federal Solutions, LLC", "description": "Department of Defense, Office of the Inspector General, Audit Policy and Oversight\nâ\u0080¢Coordinates DoD directives, instructions, and other guidance related to audits and audit standards.\nâ\u0080¢Maintains security and accountability of classified information.\nâ\u0080¢Actively and positively participates with other team members, providing updates on the status of audit assignments, sharing information, and identifying requisite revisions to the program and/or annual team goals.\nâ\u0080¢Maintains professional manner and working relationships with team members, associates, contractor and other government personnel.\nâ\u0080¢Responsible for tracking the organizationâ\u0080\u0099s mandatory training and updating the DAMIS database with certificates.\nâ\u0080¢Coordinates Audit Policy publications; editing, formatting, and organizing of information.\nâ\u0080¢Prepares presentation materials for the deputy Directorâ\u0080\u0099s use in meetings with leadership on APO issues, findings, conclusions and recommendations.\nâ\u0080¢Attends weekly functional meetings for all departments in Audit Policy and Oversight. \nâ\u0080¢Responsible for reconciling time by running Project Detail Reports and uploading information into ATAAPS. \nâ\u0080¢Point person for the Audit Follow-Up process; responsible for tracking on-going reports. \nâ\u0080¢FootPrints Database expert; a tool used for tracking all upcoming Policy and Oversight project proposals. \n", "location": "Alexandria, Virginia", "title": "Analyst", "startedOn": {"month": 3, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:201597"}, {"posId": 482455261, "new": false, "current": false, "endedOn": {"month": 3, "year": 2015}, "companyName": "Sektor Solutions, Inc.", "description": "Department of Defense, Passport and Visa Office\nâ\u0080¢Subject matter expert in all aspects of the visa/passport operations; including but not limited to procedural processes, preparation of documents, and regulations.\nâ\u0080¢Served as a customer service agent; promptly answering phone calls, responding to emails, and assisting walk in customers at the front counter. \nâ\u0080¢Received and screened all incoming visitors, passport and visa documents and other mail delivered to the DoD Passport and Visa Office. . \nâ\u0080¢Maintained a computerized maintenance management system to record passport and visa applicantsâ\u0080\u0099 personally identifiable information, leading to successful work assignments and accurate database information. \nâ\u0080¢Provided technical guidance to staff members, Passport Agents, and DoD personnel on policies and procedures pertaining to foreign travel and country entry requirements, including Permanent Change of Station (PCS).\nâ\u0080¢Prepared and delivered briefings to inform employees and branch chiefs of changes in travel regulations, policies, and procedures. \nâ\u0080¢Experienced in fact finding and analytical techniques. Responsible for updating visa applications, country requirements, important notices, and maintaining the website.\nâ\u0080¢Reviewed new or proposed guidance, policy, and regulations to determine the most effective media to use in communicating with intended audiences. \nâ\u0080¢Prepared correspondence, briefing materials, press releases, and other written documents for senior management. Reviewed all written communication and case materials before being distributed to the DoD community.\nâ\u0080¢Designed, edited content, and took pictures for the monthly and quarterly Travel Services Division and Logistics Services Washington newsletters. \nâ\u0080¢Sektor team lead; maintained computerized time and attendance reports, authorized overtime, and monitored leave balance.", "location": "Ft. Belvoir, VA", "title": "Program Analyst", "startedOn": {"month": 10, "year": 2013}}, {"posId": 428556799, "new": false, "current": false, "endedOn": {"month": 10, "year": 2013}, "companyName": "Travisa Passport & Visa Service", "description": "â\u0080¢Assisted corporate clients with expedited visas and passport services.\nâ\u0080¢Processed and billed clients and corporate accounts for services.\nâ\u0080¢Knowledge of all visa and passport requirements for tourist, business, and official travel.\nâ\u0080¢Provided on call assistance for corporate clients and American Express travelers.\nâ\u0080¢Familiar with all embassies across Washington, DC, as well as consulates in other jurisdictions. \nâ\u0080¢Attended weekly staff meetings; responsible for taking minutes.", "title": "Senior Consultant", "startedOn": {"month": 8, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:431849"}, {"posId": 272576958, "new": false, "current": false, "endedOn": {"month": 8, "year": 2012}, "companyName": "South Moon Under", "description": "â\u0080¢Helped customers with in store promotions and products.\nâ\u0080¢Responsible for handling all register duties at opening and closing, including bank deposits.\nâ\u0080¢Merchandised new products and executing moon maps regularly. \nâ\u0080¢Responsible for all supply orders.\nâ\u0080¢Highest sales in the entire company for several months.", "location": "Arlington, VA", "title": "Assistant Manager", "startedOn": {"month": 4, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:741449"}, {"posId": 272578070, "new": false, "current": false, "endedOn": {"month": 7, "year": 2012}, "companyName": "News USA", "description": "â\u0080¢Researched competitive media placement agencies. \nâ\u0080¢Gathered data and provided recommendations on new media placement fields.\nâ\u0080¢Searched for potential media organizations that could use News USAâ\u0080\u0099s services.\nâ\u0080¢Contacted news agencies across the US regarding the Associated Press and RSS feed.\nâ\u0080¢Located News USA placements in various forms of media, such as online, newspapers, etc.", "location": "Falls Church, VA", "title": "Marketing Assistant", "startedOn": {"month": 2, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:84652"}, {"posId": 113389693, "new": false, "current": false, "endedOn": {"month": 12, "year": 2010}, "companyName": "Bon Appetit Management Company", "description": "â\u0080¢Assisted Catering Manager in promoting and selling various Bon Appetite products.\nâ\u0080¢Spearheaded on-campus promotion efforts and sales.\nâ\u0080¢Conducted and maintained weekly inventory of supplies.\nâ\u0080¢Managed company billing and remittance processes.", "location": "Santa Clara, CA", "title": "Catering Intern", "startedOn": {"month": 8, "year": 2008}, "companyUrn": "urn:li:fs_salesCompany:783421"}, {"posId": 113387942, "new": false, "current": false, "endedOn": {"month": 3, "year": 2008}, "companyName": "Santa Clara University", "description": "â\u0080¢Acted as an official University liaison for Alumni and parents. \nâ\u0080¢Developed, planned, and coordinated Alumni social events. \nâ\u0080¢Helped facilitate national fundraisers and donation efforts.", "location": "Santa Clara, CA", "title": "Fundraising Coordinator", "startedOn": {"month": 9, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:165847"}, {"posId": 113388307, "new": false, "current": false, "endedOn": {"month": 8, "year": 2007}, "companyName": "Source Audio", "description": "â\u0080¢Assisted in developing and implementing national marketing campaigns to help build awareness of the brand.\nâ\u0080¢Targeted music festivals across the country and coordinated on-the-ground stunts to engage and educate music fans on the product.\nâ\u0080¢Assembled commercial music production equipment, audited technical problems, and prepared the product for distribution.", "location": "Woburn, MA", "title": "Summer Hire", "startedOn": {"month": 6, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:709090"}, {"posId": 113388735, "new": false, "current": false, "endedOn": {"month": 8, "year": 2005}, "companyName": "U.S. Embassy in Vientiane, Laos", "description": "â\u0080¢Created and implemented a comprehensive inventory process of medical supplies which was accessible to the entire Embassy community.\nâ\u0080¢Provided clerical support and inventory management to Department Heads.\nâ\u0080¢Worked with local vendors on procurement and shipping processes.\nâ\u0080¢Assisted in managing the operations of the Embassy from contracting and procurement to shipping and warehouse.", "title": "Summer Hire", "startedOn": {"month": 6, "year": 2005}}], "pictureInfo": {}, "savedLead": false, "firstName": "Shereen", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/shereen-herbert-5793b91b", "location": "Dallas/Fort Worth Area"}