{"objectUrn": "urn:li:member:119854386", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Information Technology and Services", "educations": [{"endedOn": {"year": 2003}, "fieldsOfStudy": ["Management Information Systems, General"], "school": "urn:li:fs_salesSchool:18058", "degree": "Master's Degree", "schoolName": "American University", "startedOn": {"year": 2000}, "eduId": 71146072}, {"endedOn": {"year": 2003}, "fieldsOfStudy": ["Information Systems"], "degree": "M.S", "schoolName": "Kogod School of Business", "eduId": 71146101}, {"endedOn": {"year": 1998}, "fieldsOfStudy": ["Criminal Justice"], "school": "urn:li:fs_salesSchool:18571", "degree": "B.S", "schoolName": "University of Maryland Eastern Shore", "eduId": 71146073}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAck1TIBFR-c7qAFo2NVCrkPYPEgmLx8fog,NAME_SEARCH,undefined)", "numOfConnections": 33, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHZDdO_7AF7Ug/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=EHzYm1yeVBNbATSICKm23g844B-dDKs83bwkDRv9ulo", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHZDdO_7AF7Ug/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=SMvQgjd-PHQQGD8IFhSPQws028VMdTAdjoUR0jsdjWc", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHZDdO_7AF7Ug/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=BGSd0BtIZjc6OHJm0kT0UFbbWmkrMWX3gmnBHXD8KHc", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQHZDdO_7AF7Ug/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=YMdoHM8kI31EgqLiHbH_ANJ5mv9_lpB7DwvzH3ijaTs", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Adjunct Professor at University of Maryland University College", "profileUnlockInfo": {"showProfileUnlock": false}, "pendingInvitation": false, "defaultPosition": {"posId": 410329944, "new": false, "current": true, "companyName": "University of Maryland University College", "description": "Teaching Information Systems Management to students using the latest IFSM techniques.\nUsing the hybrid method of teaching students which includes both  face to face and online portion of learning, students get the best of both worlds perspective.\nCoordinated with the Department Course Chair to ensure curriculum and course material met university guidelines.\nIncorporated higher-level learning and assisted students in developing IFSM literacy and critical thinking skills.", "title": "Assistant Adjunct Professor", "startedOn": {"month": 11, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:9375"}, "degree": -1, "fullName": "", "positions": [{"posId": 410329944, "new": false, "current": true, "companyName": "University of Maryland University College", "description": "Teaching Information Systems Management to students using the latest IFSM techniques.\nUsing the hybrid method of teaching students which includes both  face to face and online portion of learning, students get the best of both worlds perspective.\nCoordinated with the Department Course Chair to ensure curriculum and course material met university guidelines.\nIncorporated higher-level learning and assisted students in developing IFSM literacy and critical thinking skills.", "title": "Assistant Adjunct Professor", "startedOn": {"month": 11, "year": 2012}, "companyUrn": "urn:li:fs_salesCompany:9375"}, {"posId": 186892904, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Special assistant to the Unit Chief having different types of duties and responsibilities such as; fielding informational requests from the Director of Office of Investigations, and analyzing and compiling various documents and reports to produce weekly and monthly reports.\nLead facilitator of the IPT which works in partnership with various Immigration and Customs Enforcement Entities (i.e., OI, ERO, OPLA, and CIS) in creating the Preliminary Mission Need Statement (MNS) and Preliminary Concept of Operations (CONOPs). Use of the MNS aligns the project with DHS' overarching requirements for mapping to its IT infrastructure to include integrated planning, guidance, objectives, requirements; and acquisition budget/funding. Use of the CONOPs is to achieve consensus, from stakeholders in balancing the objectives of the mission successes against the actual of technology, budget, schedule and risk. \nProgram Manager assigned to oversee IT Investments within the A-File Digitization and EDMS (Enterprise Document Management Systems) environment, with the creation of the MNS and CONOPS this will help with determining applicable funding.\nCo-Program Manager for Enforcement integrated database Arrest Graphic user interface for Law Enforcement (EAGLE). Work in partnership with Enforcement Removal Operations with the building and designing of the EAGLE application. Helped develop the policy and updated handbooks that will help with guidance when distributing the application to the various Special Agents in Charge (SAIC) offices within the continental U.S. and abroad.\nDeveloped the Homeland Security Investigations (HSI) IT portfolio inventory sheet. This helps HSI keep track of the various IT projects background, financial, acquisition, architecture, security and privacy issues that may arise during the different phases of the projects.\nServe as Acting Section chief in the absence of the supervisor", "title": "Program Manager/ Biometric Systems Group", "startedOn": {"month": 6, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 186892911, "new": false, "current": false, "endedOn": {"month": 6, "year": 2009}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Served as lead analyst for two Special Agent in Charge (SAIC) offices, and Student and Exchange Visitors Program (SEVP). This included reviewing and processing funds distribution and reprogramming requests; monitoring spending plan levels and execution; researching and responding to questions and problems; and maintaining files on financial transactions.\nProject Manager for Office of Investigations (OI), temporary project works with the deployment of the new Time & Attendance program WEBTA. This included meeting constantly with managers and employees to ensure personnel information was entered correctly and properly formatted and distributed to the appropriate databases.  Also served as the HR Administrator for the WEB Time and Attendance (WEBTA), overseeing time recording for 7,000+ employees within Office of Investigations (OI) worldwide.\nOther responsibilities included oversight of purchase card for Director of Office of Investigations, which required the display of decisiveness and business acumen in preparation of daily purchases with various vendors valued at $3,000 per day and $50,000 per month totaling $600,000.00 per year. Reconciled funding report at the end of each monthly billing cycle.\nPrepared budgetary analysis for assigned field office and National Security programs using data from the Federal Financial Management Systems (FFMS). This involved checking data for accuracy/ reliability; and developing/ organizing information into Excel spreadsheets to be formatted for additional decision-making as necessary.\nResearched, gathered and organized data into information in order to brief managers on processes and status changes received from procurement and budget offices.\nReviewed, analyzed, and wrote justification requests submitted by field offices for reimbursement of investigative expenses and purchase of information (POI)/ purchase of evidence (POE)", "title": "Mission Support Specialist", "startedOn": {"month": 4, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 186892905, "new": false, "current": false, "endedOn": {"month": 4, "year": 2007}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Prepared and/or coordinated cost estimates, spending and budget plans for various types of space projects.\nUtilized established Department of Homeland Security standards to review and amend space project requirements submitted by the diverse Special Agents in Charge field office personnel to ensure long-term feasibility of space, each year OI Facilities is issued $2.6 million to spend on space projects each fiscal year.\nThe Office of Investigations is mostly collocated with ICE entities (DRO, OPLA, INTEL, etc) in meetings with CBP and ICE Office of Asset Management; represent OI, by providing information to determine benefits to the organization operationally and financially.\nAccount for results of work and ensured customer satisfaction across area of responsibility.\nParticipated in the strategic review of business operations and implemented subsequent outsourcing decisions.\nAdhered to procedures for acquisitions of leasehold interests in real property.\nDesigned and implemented programs and repeatable processes to deliver operational effectiveness targets.\nParticipated in market surveys, research information relative to real estate and demographics, and visited areas under consideration.\nServed as point of contact for 26 Special Agent in Charge field office personnel, as well as, private architectural/engineering firms, by working with ICE Office of Asset Management to finish designated space projects that were pending for each fiscal year", "title": "Mission Support Specialist", "startedOn": {"month": 11, "year": 2005}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 186892923, "new": false, "current": false, "endedOn": {"month": 11, "year": 2005}, "companyName": "U.S. Customs and Border Protection", "description": "Utilize federal recruitment mechanisms and regulations for the selection and job placement of employees, thereby generating tentative select and offer letters for new hires.\nProvide administrative/customer service to more than 40,000+ perspective and permanent employees.\nTrained in such contemporary issues as personnel administration, wage and salary administration, EEO regulations and federal guidelines.\nManage annual payroll for 12 employees of Staffing Branch Division; oversee bi-weekly verification and coding process to ensure accuracy and meet strict payroll deadlines.\nReview and process employee applications and post vacancy announcement using TPX and online databases.\nCoordinate merit promotion panels and maintain merit promotion cases files.\nResearch, compile and track data and statistics for special and recurring report studies on recruitment and employment.\nLiaison between various field offices throughout the United States and territories.", "title": "Human Resources Administrator", "startedOn": {"month": 12, "year": 2003}, "companyUrn": "urn:li:fs_salesCompany:2997"}, {"posId": 186892925, "new": false, "current": false, "endedOn": {"month": 12, "year": 2003}, "companyName": "American University", "description": "Responsible for recruiting, hiring, training and scheduling of student employees. \nCreated both work-study and administrative assistant handbook for future employees.\nMonitored students while filling out their online timesheets to ensure they were completed accurately for bi-weekly submissions.\nProvide administrative support to faculty, staff and students in large fast-paced environment.\nOrder faculty reading, desk copy, office supplies and reserve material ensuring timely delivery.\nAssist the Assistant to the Chair with special projects.\nTroubleshoot minor computer problems (software, hardware, etc).\nMaintained Dept of Government Internship database.", "title": "Staff Assistant/ Internship Coordinator", "startedOn": {"month": 2, "year": 2000}, "companyUrn": "urn:li:fs_salesCompany:6029"}, {"posId": 186892927, "new": false, "current": false, "endedOn": {"month": 2, "year": 2000}, "companyName": "Select Staffing Services", "description": "Provided administrative support to a variety of companies.\nGenerated data using different application and software, including Microsoft Excel, Access, and WordPerfect.\nInstalled and upgraded PC's on LAN/WAN network.\nTroubleshooted user problems.\nAssisted users with office automation and solving printer conflicts.", "title": "Administrative Assistant", "startedOn": {"month": 10, "year": 1999}}, {"posId": 186892908, "new": false, "current": false, "endedOn": {"month": 8, "year": 1999}, "companyName": "University of Maryland Baltimore County", "description": "Responsible for client intake and assessment interviews.\nProvided client advocacy in areas of health, education, vocation, legal, and family/foster family intervention.\nTrained in crisis prevention when client safety is threatened; established aftercare plans and developed resources\nStrengthened working relationships with significant resources in the client network.  (Police, Department of Juvenile Justice, Social Services, Mental Health, court personnel, schools, and health care affiliates)", "title": "Youth Advocate/ Senior Caseworker", "startedOn": {"month": 7, "year": 1998}, "companyUrn": "urn:li:fs_salesCompany:7835"}], "pictureInfo": {}, "relatedColleagueCompanyId": 9375, "savedLead": false, "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/jelani-scott-21618034", "location": "Washington D.C. Metro Area"}