{"lastName": "Mostafaie", "objectUrn": "urn:li:member:199611645", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Government Relations", "educations": [{"endedOn": {"year": 1990}, "fieldsOfStudy": ["MBA"], "school": "urn:li:fs_salesSchool:17829", "degree": "Management Information Systems", "schoolName": "California State University-Los Angeles", "startedOn": {"year": 1988}, "eduId": 531426125}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAvl1P0BY5KXaTZ6g9WUMtD7OaKRmsY6cSI,NAME_SEARCH,undefined)", "numOfConnections": 179, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEkhZWnDHvp-g/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=-hFVWeI9BMucxJPKWoBr-lj8uWvbcSrAnmpnIa4WI90", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEkhZWnDHvp-g/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=AQR57wMUBI2_jGNCe6nqIvaQuSt8RS3KAmOPHW_kpbo", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEkhZWnDHvp-g/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=oTiqu6wfH4YJtg5T_Gwp-Q_1X1jpuMDKGUxsZ4GkImc", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5103AQEkhZWnDHvp-g/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=WleqEJnf3rFBXmaNz9a2mooLnkrZDCtRVSQx_HSP0vo", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Privacy Analyst - The Department of the Treasury", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Combined eight years of supervisory experience, systems analysis and information management, policy creation, program management, audit and analysis with a reputation for meeting the most challenging organizational goals and objectives. \nA proven record for:\nLeading staff at both a Bureau and Department level on program analysis and Privacy and Civil Liberties functions.\nEmbedding in Department level Privacy and information management programs to ensure compliance with Federal standards.\nProviding guidance on executive orders, laws, regulations and oversight for privacy and information management to senior management.\nAligning management objectives and observing project progresses to determine compliance with policies, plans, regulations, and work planning. \nResourceful and insightful analytical thinker, researcher, and problem solver responsible for analyzing intra/inter agency connections among various components of an agency to ensure laws, regulations and polices are in compliance as systems are developed, upgraded and maintained. \nBalance Complex interagency technology requirements and solutions against multiple stakeholder interest to provide solution that get the job done while protecting stakeholderâ\u0080\u0099s interests.\nCollateral duty as Contract Representative for my division, and contribute as a Budget Analyst to assist in monitor and analyzing the funding distribution by legislative actions.\n", "pendingInvitation": false, "defaultPosition": {"posId": 1309772136, "new": false, "current": true, "companyName": "U.S. Department of the Treasury", "description": "Leading staff at both a Bureau and Department level on program analysis and Privacy and Civil Liberties functions.\nEmbedding in Department level Privacy and information management programs to ensure compliance with Federal standards.\nProviding guidance on executive orders, laws, regulations and oversight for privacy and information management to senior management.\nAligning management objectives and observing project progresses to determine compliance with policies, plans, regulations, and work planning. \nResourceful and insightful analytical thinker, researcher, and problem solver responsible for analyzing intra/inter agency connections among various components of an agency to ensure laws, regulations and polices are in compliance as systems are developed, upgraded and maintained. \nBalance Complex interagency technology requirements and solutions against multiple stakeholder interest to provide solution that get the job done while protecting stakeholderâ\u0080\u0099s interests.\nCollateral duty as Contract Representative for my division, and contribute as a Budget Analyst to assist in monitor and analyzing the funding distribution by legislative actions.\n", "location": "Washington D.C. Metro Area", "title": "Privacy Analyst", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:5064"}, "degree": 3, "fullName": "Gina Mostafaie", "positions": [{"posId": 1309772136, "new": false, "current": true, "companyName": "U.S. Department of the Treasury", "description": "Leading staff at both a Bureau and Department level on program analysis and Privacy and Civil Liberties functions.\nEmbedding in Department level Privacy and information management programs to ensure compliance with Federal standards.\nProviding guidance on executive orders, laws, regulations and oversight for privacy and information management to senior management.\nAligning management objectives and observing project progresses to determine compliance with policies, plans, regulations, and work planning. \nResourceful and insightful analytical thinker, researcher, and problem solver responsible for analyzing intra/inter agency connections among various components of an agency to ensure laws, regulations and polices are in compliance as systems are developed, upgraded and maintained. \nBalance Complex interagency technology requirements and solutions against multiple stakeholder interest to provide solution that get the job done while protecting stakeholderâ\u0080\u0099s interests.\nCollateral duty as Contract Representative for my division, and contribute as a Budget Analyst to assist in monitor and analyzing the funding distribution by legislative actions.\n", "location": "Washington D.C. Metro Area", "title": "Privacy Analyst", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:5064"}, {"posId": 1309771266, "new": false, "current": true, "companyName": "U.S. Department of Homeland Security", "description": "Led the planning, design, scheduling, and implementation of data quality, data integrity initiatives for both long and short range projects\nSupervised consultants on the development of a SharePoint system which would provide a robust, dynamic information management system as well as a record keeping mechanism.  \nProvided authoritative guidance and technical oversight on compliance with privacy and information management laws, regulations, and directives. \nIdentified and supports best practices, methodologies, tools, and platforms to maximize efficiency and effectiveness of privacy and security management.\nDeveloped relationships with components, information technology (IT) staff and other bureaus, Federal agencies, and vendors to address privacy and security management needs.\nImplemented corrective actions based on findings from reviews and/or studies.\nExperienced drafting reports to support organization actions and responses to project findings.\nExperienced leading the transformation of Privacy Threshold Analysis (PTA), into the requirement for Privacy Impact Assessment (PIA), and Systems of Records Notice (SORN), when needed, and establishment of the maintenance and monitoring of administrative systems of required documents.\nCollateral duty - COR duty for contracts in HQ management staffing, schedule review, and claims management for 2 separate contracts and 4 task orders. ", "title": "Privacy Analyst - Compliance", "startedOn": {"month": 6, "year": 2015}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 1309770540, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "\nAs team leader for government information specialist, I was responsible for high-level decision making on all aspects of the bureau FOIA management program as well as the development of policy and procedure for IT systems and record keeping processes. \n\nAccomplishments\nServed as senior analyst responsible for Freedom of Information Act (FOIA) cases that required detailed tracking and reporting in the FOIA Express Database. As the functional expert for Database Administrators to ensure they implemented the conversion to a new platform correctly. Served as an alpha tester during the early phases of new feature deployments. \nManaged and implemented a FOIA management program that ensured compliance with the FOIA Act, National Archives and Record Administration (NARA) and regulations, agency directives, policies, and procedures at agency level.\nResearched and investigated new and improved business and management practices for bureau programs and operations in FOIA and its records management. Through collaborative efforts, I was able to develop a process management program that consults, reviews, assesses, and audits records and cases that are open, pending, or complete. Researching and investigating new and improved business and management process for internal programs and operations to increase productivity.\nConducted business case analyses to identify mission requirements for internal processes while ensuring executive requirements are met. This led to the development of an internal process due to cost savings.\nDeveloped and directed the bureauâ\u0080\u0099s first hands on training program. This training helped educated new team members to applying FOIA exemptions to records throughout the bureau.\nDeveloping new goals and objectives in the administrative and management operations of the department process management program. This includes the completion of a strategic plan for number of cases closed at bureau.", "location": "Washington D.C. Metro Area", "title": "Government Information Specialist", "startedOn": {"month": 11, "year": 2014}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 1309771311, "new": false, "current": true, "companyName": "Transportation Security Administration (TSA)", "description": "Processed FOIA and Privacy Act requests and provide advice and guidance to requesters, tasking offices, and the Office of Chief Counsel to ensure requests are perfected and recorded.\nProvided recommendations to internal and external customers regarding the administrative aspects of FOIA guidelines, policies, and procedures.\nAided FOIA requestors to discuss the scope and clarity of requests.\nAssisted in the development of standard operating procedures for the FOIA team.\nSupported the FOIA coordinator for any appealed cases.\nProvided policy guidance in response to FOIA requests.\nContributed subject matter expertise to reports that reflected data collection and distributed them to management, leadership, and other agencies.\nConducted briefings for senior level management on complex technical and non-technical matters.", "location": "Arlington, VA", "title": "Government Information Specialist", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 1309770565, "new": false, "current": true, "companyName": "Transportation Security Administration (TSA)", "description": "Designed, developed and managed the content of data collections critical to the mission, and filed required incident reports to be shared intra and inter agency including Law Enforcement Officers and intelligence community, as needed\nCommunicated strategic objectives to multiple levels of management to facilitate comprehensive situational awareness.\nEstablished working relationships with Customs and Border Protection, Immigration and Customs Enforcement, law enforcement officers, and intelligence communities.\nDrafted, edited, and executed agency-wide enforcement notifications to individuals or designated groups by using various communications media as directed by management.\nEvaluated security policies and conducted research and analysis to identify vulnerabilities.\nConducted risk assessments of travelers and monitored passengerâ\u0080\u0099s behavior to ensure air safety.\nUtilized incoming intelligence reports to identify known or potential terrorists, instruments of terror, criminals, smugglers, and other illegal patterns in a category â\u0080\u009cIâ\u0080\u009d airport.\nConducted enhanced screenings of identified individuals through casual conversations and referred to cases to law enforcement personnel as necessary.\nPrepared incident reports to document all identified anomalous behaviors.", "location": "Washington D.C. Metro Area", "title": "Master - Behavior Detection Officer (BDO)", "startedOn": {"month": 11, "year": 2011}, "companyUrn": "urn:li:fs_salesCompany:2994"}, {"posId": 309003885, "new": false, "current": false, "endedOn": {"month": 10, "year": 2014}, "companyName": "US Department of Homeland Security", "title": "Lead", "startedOn": {"month": 4, "year": 2013}, "companyUrn": "urn:li:fs_salesCompany:2998"}], "pictureInfo": {}, "relatedColleagueCompanyId": 5064, "savedLead": false, "firstName": "Gina", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/gina-mostafaie-bb9a2356", "location": "Washington D.C. Metro Area"}