{"lastName": "Homan", "objectUrn": "urn:li:member:220397441", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Law Enforcement", "educations": [{"endedOn": {"year": 1983}, "fieldsOfStudy": ["Criminal Law - Criminal Justice"], "degree": "Bachelor of Applied Science (BASc)", "schoolName": "SUNY UTICA ROME", "startedOn": {"year": 1981}, "eduId": 142239715}, {"fieldsOfStudy": ["Criminal Justice/Police Science"], "degree": "Bachelor's degree", "schoolName": "State Univeristy of New York @ Utica Rome", "eduId": 142239555}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAA0i_4EBDRdsL75p--3D_RezaHEWENFV4dc,NAME_SEARCH,undefined)", "numOfConnections": 2384, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGFdf_j_RPj8g/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=vs3WpXxeApIMT1BLNeece2xZEwMYq7UDYuQ6Q3EAruI", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGFdf_j_RPj8g/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=NP8QoCEWi1cfqCpMw6rqX6VZCsuSIRaL8AqfbW0YTtU", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGFdf_j_RPj8g/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=1yAHn0Q9IYQ-OqKOBaPWZDj9g9CYiQOD1Z5a3Z5BFy4", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGFdf_j_RPj8g/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=FtvJT81a60iTCJI6eYLKoKx5nGKDK_D9iulaohNU8Hc", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "Acting Director at U.S. Department of Homeland Security ICE", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Dynamic and accomplished executive with 32 yearsâ\u0080\u0099 of law enforcement experience directing programs, people, and resources in leadership role with Federal government.   Created and executed new visions and strategic objectives to enhance operations in the critically challenging world of global and national law enforcement.  Experienced and capable leader, manager and supervisor, having managed several large law enforcement organizations. As a senior manager for complex law enforcement programs, consistently achieved results in a rapidly changing environment in which the challenge is constantly evolving.  Developed and directed programs that are results-based and forward thinking. As a seasoned manager and executive, responsible for managing resources in a variety of areas including human, financial and information technology (IT). Repeatedly demonstrated success to obtain and allocate a variety of resources.   As a senior law enforcement program manager demonstrated an exceptional ability to communicate, including establishing and maintaining effective relationships with a wide range of Government and industry leaders and organizations.  Exemplified diplomatic demeanor, building cooperative relationships with foreign/domestic government agencies and private sector for sharing intelligence, resources, and coordinating effective programs.    Conducted numerous briefings on sensitive and confidential policy and program issues for senior management, exercised leadership roles in inter-agency task forces, and active in professional organizations in the law enforcement disciplines.    A Steward of Public Resources ensuring financial and managerial accountability in executing fiduciary responsibilities and appropriately protecting classified and other security-sensitive information.  \n\nA proven leader, able to unify teams with a forward focus on goals and bringing out the best possible performance in individuals.", "pendingInvitation": false, "defaultPosition": {"posId": 912092362, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Appointed by the President on January 30, 2017 as the Acting Director of ICE.   ICE is the largest investigative arm within the U.S. department of Homeland security (DHS) and the second largest investigative agency in the federal government.  ICE has more than 20,000 Special Agents, Officers and other employees and has an annual budget of more than $6 billion.   ICE is charged with protecting the homeland  through criminal and civil enforcement of federal laws governing border control , customs trade, and immigration. ICE Agents are located in more than 400 offices in the United States and 46 foreign countries.  ICE's budget of over $6 billion is primarily devoted to two operational directorates: Enforcement and Removal Operations (ERO) and Homeland Security Investigations (HSI).  Supporting ERO and HSI is the Management and Administration directorate, the Office of the Principal Legal Advisor , and the Office of Professional Responsibility. \n\nERO enforces the nation's immigration laws including identifying, apprehending, detaining and removing illegal aliens from the United States.  Aliens arrested include convicted criminals, national security threats, fugitives, and other aliens that are in the U.S. illegally. \n\nHSI has broad legal authority to enforce federal statutes  related to cross-border criminal activity and transnational criminal organizations.  Using these authorities, HSI conducts criminal investigations related to financial crimes, commercial fraud, intellectual property theft, cyber crimes, human rights violations, human smuggling and trafficking, immigration document and benefit fraud, narcotics, weapons, transnational gang activity, export enforcement, and international art and antiquity theft.", "location": "Washington DC - Headquarters", "title": "Acting Director", "startedOn": {"month": 1, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Thomas Homan", "positions": [{"posId": 912092362, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "Appointed by the President on January 30, 2017 as the Acting Director of ICE.   ICE is the largest investigative arm within the U.S. department of Homeland security (DHS) and the second largest investigative agency in the federal government.  ICE has more than 20,000 Special Agents, Officers and other employees and has an annual budget of more than $6 billion.   ICE is charged with protecting the homeland  through criminal and civil enforcement of federal laws governing border control , customs trade, and immigration. ICE Agents are located in more than 400 offices in the United States and 46 foreign countries.  ICE's budget of over $6 billion is primarily devoted to two operational directorates: Enforcement and Removal Operations (ERO) and Homeland Security Investigations (HSI).  Supporting ERO and HSI is the Management and Administration directorate, the Office of the Principal Legal Advisor , and the Office of Professional Responsibility. \n\nERO enforces the nation's immigration laws including identifying, apprehending, detaining and removing illegal aliens from the United States.  Aliens arrested include convicted criminals, national security threats, fugitives, and other aliens that are in the U.S. illegally. \n\nHSI has broad legal authority to enforce federal statutes  related to cross-border criminal activity and transnational criminal organizations.  Using these authorities, HSI conducts criminal investigations related to financial crimes, commercial fraud, intellectual property theft, cyber crimes, human rights violations, human smuggling and trafficking, immigration document and benefit fraud, narcotics, weapons, transnational gang activity, export enforcement, and international art and antiquity theft.", "location": "Washington DC - Headquarters", "title": "Acting Director", "startedOn": {"month": 1, "year": 2017}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 394728426, "new": false, "current": false, "endedOn": {"month": 1, "year": 2017}, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "description": "As the Director for ICE Enforcement and Removal Operations (ERO), I am responsible for promoting public safety and national security by maintaining direct oversight of critical ICE programs and operations to identify, locate, arrest, detain and remove illegal aliens from the United States. I execute an operational budget of nearly $3 billion and a staff of nearly 8,000 ERO employees assigned to 24 field offices, 165 sub-offices, 12 overseas locations, and ICE Headquarters. I have overall responsibility for all detention programs managed by Federal, State and local law enforcement agencies that house over 34,000 immigrant detainees at any given time in more than 250 facilities nationwide. As such, over 470,000 aliens passed through ERO detention in FY 2013. \n\nResponsible for establishing and maintaining effective working relationships with various high-level individuals, including Members of Congress and their staffs, other legislative and executive agencies, executives of major corporations, and distinguished members of the public. Maintain close and cooperative working relationships with senior agency officials, government agencies, and other institutions with related interests, in order to advance the programs and objectives of ICE and ERO. Routinely work closely and collaboratively with other law enforcement officials at the highest levels of Federal, State, and local governments, as well as intelligence organizations and international law enforcement entities.\n\nKey Achievements as Director - 2013\nâ\u0080¢ Removed more than 369.000 aliens from the United States including 216,000 criminal aliens\nâ\u0080¢ Identified more than 250,000 dangerous criminal aliens in U.S. jails and prisons \nâ\u0080¢ Prosecuted more than 9,000 egregious, recidivist criminal aliens \nâ\u0080¢ Arrested more than 36,000 aliens through the Fugitive Operations Program \nâ\u0080¢ Through public speaking engagements, raised public and community awareness about the issues of immigration and border security", "location": "ICE Headquarters, Washington DC", "title": "Executive Associate Director", "startedOn": {"month": 5, "year": 2013}}, {"posId": 343913499, "new": false, "current": false, "endedOn": {"month": 5, "year": 2013}, "companyName": "U.S. Department of Homeland Security - ICE", "description": "Responsible for promoting public safety and national security by ensuring the identification, arrest and departure from the U.S. of all removable aliens. Direct operational oversight of six major program divisions, 24 field offices; accountable for the execution of a $2.8B budget and the management of approximately 8,000 staff.  Overall responsibility for all detention programs managed by Federal, state and local law enforcement agencies. ERO houses up to 34,000 immigrant detainees in more than 250 facilities nationwide. As such, over 400,000 aliens passed through ERO detention in FY 2012.   \n\nResponsible for establishing and maintaining effective working relationships with various high-level individuals, including Members of Congress and their staffs, other legislative and executive agencies, executives of major corporations, and distinguished members of the public. Maintain close and cooperative working relationships with senior agency officials, government agencies, and other institutions with related interests, in order to advance the programs and objectives of ICE and ERO.  Routinely work closely and collaboratively with other law enforcement officials at the highest levels of Federal, state, and local governments, as well as intelligence organizations and international law enforcement entities.\n\nKey Achievements during tenure as Deputy Director  \nâ\u0080¢ Removed more than 409,700 aliens from the United States including 225,000 criminal aliens\nâ\u0080¢ Identified more than 235,000 dangerous criminal aliens in U.S. jails and prisons \nâ\u0080¢ Prosecuted more than 11,800 egregious, recidivist criminal aliens \nâ\u0080¢ Arrested more than 35,000 aliens through the Fugitive Operations Program \nâ\u0080¢ Hired and trained more than 3,000 new ERO employees \nâ\u0080¢ Through public speaking engagements, raised public and community awareness about the issues of immigration, border security, detention reform, projecting ICEâ\u0080\u0099s commitment to protecting the Nation and its borders.", "title": "Deputy Associate Director", "startedOn": {"month": 1, "year": 2010}}, {"posId": 356419942, "new": false, "current": false, "endedOn": {"month": 1, "year": 2010}, "companyName": "US Department of Homeland Security", "description": "Provided executive leadership with subordinate Enforcement Divisions and Units, such as the Criminal Alien Division, Fugitive Operations Division, Intelligence Operations Division, Compliance Enforcement Division, Response Coordination Division, and Executive Information Unit. Imparted expert advice and guidance planned and directed administrative, management, and operational functions, activities, and programs pertaining to ERO Enforcement activities.\n\nThe program I directed are responsible for identifying, exploiting intelligence information from, and processing the removal of criminal aliens incarcerated in Federal, state, and local correctional institutions, and jails who have no legal right to remain in the United States after completing their sentence. Oversight responsibilities include policy formulation, and direct accountability of the Fugitive Operations Program, the Fugitive Operations Support Center, the Alternatives to Detention Program, and Bond Management Operation. Responsibilities encompass developing and implementing strategies to ensure the compliance of aliens with conditions of release during the removal process. Also accountable for  managing and tracking different National Joint Operations facilitating requests for operational and logistical support for those operations, and ensuring operations are conducted in compliance with ICE policies. Lastly, the program is responsible for the formulation of policy and providing Statistical Tracking and Reporting, Data Quality and Integrity, and Modernization of Information Technology systems.", "title": "Assistant Director of Enforcement", "startedOn": {"month": 1, "year": 2009}, "companyUrn": "urn:li:fs_salesCompany:2998"}, {"posId": 356420205, "new": false, "current": false, "endedOn": {"month": 1, "year": 2009}, "companyName": "US Department of Homeland Security", "title": "Special Agent In Charge", "startedOn": {"month": 1, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:2998"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Thomas", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/thomas-homan-99598861", "location": "Washington, District Of Columbia"}