{"lastName": "Nguyen", "objectUrn": "urn:li:member:23317313", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Information Technology and Services", "educations": [{"endedOn": {"year": 2011}, "fieldsOfStudy": ["Systems Engineering"], "school": "urn:li:fs_salesSchool:18068", "degree": "MS", "schoolName": "The George Washington University", "startedOn": {"year": 2009}, "eduId": 60294812}, {"endedOn": {"year": 2005}, "fieldsOfStudy": ["Electrical Engineering"], "school": "urn:li:fs_salesSchool:19576", "degree": "Bachelor", "schoolName": "George Mason University", "startedOn": {"year": 2003}, "eduId": 73869575}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAAFjy0EB3S1hUHe2YsSedktky5i07XR7mX0,NAME_SEARCH,undefined)", "numOfConnections": 281, "profilePictureDisplayImage": {"artifacts": [{"width": 100, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGUHfSXBMD15A/profile-displayphoto-shrink_100_100/0?e=1534982400&v=beta&t=xaiDFSmIFgpBQZg3i4geyZJNM_E9ju2jT5--9G7QRbo", "height": 100}, {"width": 200, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGUHfSXBMD15A/profile-displayphoto-shrink_200_200/0?e=1534982400&v=beta&t=DDfe7_dlqE_xVjgh81dEmICoHXkuSbmkYpvPtvG4seA", "height": 200}, {"width": 400, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGUHfSXBMD15A/profile-displayphoto-shrink_400_400/0?e=1534982400&v=beta&t=m3y7qtOSJY_6wUEn6JkZyvVdoE1KI8ZHpNvzufS6_40", "height": 400}, {"width": 800, "fileIdentifyingUrlPathSegment": "https://media.licdn.com/dms/image/C5603AQGUHfSXBMD15A/profile-displayphoto-shrink_800_800/0?e=1534982400&v=beta&t=smghlGaf-FxB8uJLSB7bwrujig8Y5gl18eyxj9cMnFc", "height": 800}], "rootUrl": ""}, "showTotalConnectionsPage": false, "headline": "U.S. Immigration and Customs Enforcement (ICE)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Motivated, detail oriented, results-driven and hands-on IT infrastructure professional with more than 9 years of combined experience impacting DoD and federal government agency performance through skilled alignment of technical resources with enterprise objectives. \n\nâ\u0080¢Conducted technical reviews with internal and external customers aligning project and corporate objectives\nâ\u0080¢Application of Six Sigma Green Belt continuous process improvement initiatives for reducing costs and production efficiency\nâ\u0080¢Maintained and applied Quality Management Systems processes and best practices in defense products and systems technologies\nâ\u0080¢Field knowledge and expertise in Network, Systems, and Electrical Engineering assuring product quality and effectiveness\nâ\u0080¢Collaborate with all levels of management and cross functional teams performing root-cause analysis to resolve complex technical issues ensuring  customerâ\u0080\u0099s mission success \nâ\u0080¢Created, tracked, and monitored key program performance metrics including risks analysis, and requirements volatility \n\nSpecialties: \nPerformance Planning, T&I, Monioring, Network & Application Troubleshooting, Analysis & Report (Design, Deploy, Secure, Manage, Support.)", "pendingInvitation": false, "defaultPosition": {"posId": 862578842, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Information Technology Specialist", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Hung Nguyen", "positions": [{"posId": 862578842, "new": false, "current": true, "companyName": "U.S. Immigration and Customs Enforcement (ICE)", "title": "Information Technology Specialist", "startedOn": {"month": 10, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 843231665, "new": false, "current": false, "endedOn": {"month": 9, "year": 2016}, "companyName": "Lockheed Martin - IS&GS", "description": "Member of the Enterprise Tools team that responsible for the build out and maintenance of the network management systems for DISA-JRSS.", "title": "Multi-Function Information System Analyst Senior Staff", "startedOn": {"month": 6, "year": 2016}, "companyUrn": "urn:li:fs_salesCompany:1319"}, {"posId": 518372387, "new": false, "current": false, "endedOn": {"month": 6, "year": 2016}, "companyName": "Contractor for DHS-USICE", "description": "As a team member of the Network Engineering Design Branch, I am primarily responsible for providing real time in-depth analysis and real time troubleshooting resolution of DHS-ICE Local Area Network (LAN) and Wide Area Network (WAN) devices. These devices provide MPLS back bone distribution to customers and diverse Core and Edge networks; 802.1Q trunks; EtherChannel; OSPF; HSRP; VRRP; Spanning Tree Protocol (STP); switch Port Security and the Spanning Tree BPDU Guard function, which consist of Cisco 2000, 3000 and 4000 series routers and switches; Solarwinds NPM suite, Riverbed Steelhead CX/EX series appliances; and Enterasys S/C/K series switches. In troubleshooting, I am responsible for determining resolving hardware, operating systems, firmware, network, application/systems issues and whether repeatable or non-repeatable patterns exist. In addition, I am responsible for configuring, testing and maintaining over 200 Riverbed Steelhead (CX and EX series) optimization appliances for hybrid networks and organizations along with deploying SolarWinds network performance monitoring suite to ensure efficiency and improved network/application performance and service delivery in a 7x24 environment.", "title": "Sr. Network Engineer", "startedOn": {"month": 12, "year": 2013}}, {"posId": 216443368, "new": false, "current": false, "endedOn": {"month": 7, "year": 2013}, "companyName": "Contractor for DHS-OBIM (formerly known as DHS-USVIT)", "description": "My role has generally included requirements gathering, an in-depth study of vendor hardware, technology and best practices, creating Model Base System Engineering, configuration, deployment, documentation, integration, and troubleshoot of the deployed systems. Below are examples of my daily tasks for design, deploy, secure, mange, and support:\n- Researched & lab tested data center 1 & 2 application monitoring solutions from vendors OPNET, Computer Associate Hyperformix Suite, Quest Foglight, BMC Atrium Suite, Symantec Command Central Storage.  \n- Baseline of existing applications, tracking data, and proof of concept as the potential monitoring solution for DC1/2.  Applied ITIL v3 process to map SLA/SLR monitoring and management metrics to application performance parameters.   \n- Utilized peak and off peak business hour captures to measure traffic by applications, stakeholders, business divisions, locations then analyze historical information for trending and capacity planning.  \n- Leveraged out-of-the-box, create meaningful custom dashboards based on application specific, and develop customized reports for key stakeholders including business executive, application developer, O&M, network engineer.  \n- Proactively supported end-to-end performance management of business-critical applications by applying OPNET tools suite in a variety of use cases, i.e. used ATX for deep packet inspection and application recognition; ARX for end-user experience monitoring at the user transaction level, high-volume packet capture and storage, flow-level analytics.  \n- Used tcpdump, tshark, WireShark to perform packet-level analysis and identify response time among servers to manage multi-tier applications by decompose, triage and troubleshooting network and application performance. Intermediate Perl, Python, and shell scripting for ad hoc data manipulation and analysis.", "location": "Arlington, VA", "title": "Sr. Systems Engineer", "startedOn": {"month": 9, "year": 2012}}, {"posId": 216443914, "new": false, "current": false, "endedOn": {"month": 9, "year": 2012}, "companyName": "Contractor for DHS-USCIS", "description": "Leveraged OPNETâ\u0080\u0099s APM and NPM to plan, deploy, operate and implement performance monitoring base on the End-User experience. Used AppInternal Xpert (Panorama) & AppResponse Xpert (ACELive) to discover meaningful and actionable patterns in troubleshoot and monitor USCIS-Data Center 1 and 2 virtualization and consolidation.  Used AppTransaction Expert to capture and analyze data to see how the quality appeared to the End User in term of SLA that agreeable in end-to-end application availability, latency, execution correctness.  Determined relationship among metrics and highlighted the corresponding causal connections between components, resources, and behavior to perform root cause analysis.  Deep dived into the understanding of  service oriented network infrastructure as a foundation for the internal cloud computing with shared network resources and workload portability, shared network management services and network security services.  Delivered the Enterprise Infrastructure Services Dashboard, by triaged the User-defined transaction profiling, to show the available of network, systems, application, database, and storage health data and capacity utilization trends through use of tools.  Provided infrastructural support services to OIT personnel and staff regarding emerging system concepts and requirements, operational trends, and actively participate in the ITSM Problem Management lifecycle based on the Garner's five basic APM objectives: Tracking, in real time, the execution of the software algorithms that constitute an application, Measuring and reporting on the finite hardware and software resources that are allocated to be consumed as the algorithms execute, Determining whether the application executes successfully according to the application owner, Recording the latencies associated with some of the execution step sequences, and Determining why an application fails to execute successfully, or why resource consumption and latency levels depart from expectations.", "location": "111 Mass", "title": "Sr. Systems Engineer", "startedOn": {"month": 8, "year": 2011}}, {"posId": 36280774, "new": false, "current": false, "endedOn": {"month": 7, "year": 2011}, "companyName": "Lockheed Martin", "description": "Developed and delivered the network system engineering functions based on conceptualization, design, implementation and optimization. Expertise around the USN-SONAR and USN-Tactical communication systems along with analyzed and tracked emerging requirements provide input in the initial portfolio analysis to help identify engineering requirements, refine the scope of these requirements if needed, and oversee specific programmatic and engineering deliverable to transform core requirements into projects. Ensure technical solutions focuses on capabilities being delivered i.e. statement of works, master test plans, and HW/SW test procedures. Developed and maintained current specifications for schedule, risks and program artifacts for projects being implemented as well as collaborated with various Navy components and co-program companies.", "location": "Manassas, VA", "title": "System Integration and Test", "startedOn": {"month": 7, "year": 2006}, "companyUrn": "urn:li:fs_salesCompany:1319"}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Hung", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/hung-nguyen-9959857", "location": "Washington D.C. Metro Area"}