{"lastName": "F.", "objectUrn": "urn:li:member:77560066", "contactInfo": {}, "crmStatus": {"imported": false}, "industry": "Hospital & Health Care", "educations": [{"endedOn": {"year": 1993}, "fieldsOfStudy": ["Criminal Justice"], "school": "urn:li:fs_salesSchool:18920", "degree": "BS", "schoolName": "Binghamton University School of Management", "startedOn": {"year": 1991}, "eduId": 50498736}, {"endedOn": {"year": 1991}, "fieldsOfStudy": ["Criminal Justice"], "degree": "AS", "schoolName": "Jefferson Community College", "startedOn": {"year": 1989}, "eduId": 50498715}], "inmailRestriction": "NO_RESTRICTION", "unlocked": false, "entityUrn": "urn:li:fs_salesProfile:(ACwAAASfeQIBNyJ6Mva_zwoIdXa-PuNT_QB3sE8,NAME_SEARCH,undefined)", "numOfConnections": 30, "showTotalConnectionsPage": false, "headline": "Senior Special Agent at Homeland Security Investigations (HSI)", "profileUnlockInfo": {"showProfileUnlock": false}, "summary": "Homeland Security Investigations (HSI) is responsible for enforcing over 400 statutes of the United States Code.\n\nU.S. Immigration and Customs Enforcement (ICE) is the largest investigative arm of DHS, charged with preventing terrorist and criminal activity by targeting the people, money, and materials that support terrorist and criminal organizations. OI is a critical asset in this mission, responsible for investigating a wide range of domestic and international activities arising from the illegal movement of people and goods into, within, and out of the United States.\n\nICE investigations cover a broad range of areas, including national security threats, financial and smuggling violations (including illegal arms exports), financial crimes, commercial fraud, human trafficking, narcotics smuggling, child pornography/exploitation, and immigration fraud.\n\nParticularly, I possess a specialized knowledge and experience managing and conducting criminal investigations involving the smuggling of narcotics & bulk cash currency, international money laundering, wire fraud and a multitude of certified undercover operation/investigations.", "pendingInvitation": false, "defaultPosition": {"posId": 125475249, "new": false, "current": true, "companyName": "Homeland Security Investigations (HSI)", "description": "Homeland Security Investigations (HSI) is the largest investigative arm of DHS, charged with preventing terrorist and criminal activity by targeting the people, money, and materials that support terrorist and criminal organizations. HSI is a critical asset in this mission, responsible for investigating a wide range of domestic and international activities arising from the illegal movement of people and goods into, within, and out of the United States.\n\nICE investigations cover a broad range of areas, including national security threats, financial and smuggling violations (including illegal arms exports), financial crimes, commercial fraud, human trafficking, narcotics smuggling, child pornography/exploitation, and immigration fraud.\n\nSpecialties: Enforcement of Narcotics Smuggling/Bulk Cash Smuggling/Wire Fraud Investigations/Certified Undercover Operations (CUC)", "location": "RAC-Rouses Point, NY", "title": "Special Agent", "startedOn": {"month": 5, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:533534"}, "degree": 3, "fullName": "Joshua F.", "positions": [{"posId": 125475249, "new": false, "current": true, "companyName": "Homeland Security Investigations (HSI)", "description": "Homeland Security Investigations (HSI) is the largest investigative arm of DHS, charged with preventing terrorist and criminal activity by targeting the people, money, and materials that support terrorist and criminal organizations. HSI is a critical asset in this mission, responsible for investigating a wide range of domestic and international activities arising from the illegal movement of people and goods into, within, and out of the United States.\n\nICE investigations cover a broad range of areas, including national security threats, financial and smuggling violations (including illegal arms exports), financial crimes, commercial fraud, human trafficking, narcotics smuggling, child pornography/exploitation, and immigration fraud.\n\nSpecialties: Enforcement of Narcotics Smuggling/Bulk Cash Smuggling/Wire Fraud Investigations/Certified Undercover Operations (CUC)", "location": "RAC-Rouses Point, NY", "title": "Special Agent", "startedOn": {"month": 5, "year": 2007}, "companyUrn": "urn:li:fs_salesCompany:533534"}, {"posId": 125475896, "new": false, "current": false, "endedOn": {"month": 5, "year": 2007}, "companyName": "US Department of Education, Office of Inspector General", "description": "The U.S. Department of Education Office of the Inspector General is responsible for detecting fraud, waste, and abuse within the department. Special Agents of the Department of Education conduct audits and investigations into allegations of misuse of department money and resources.\nSpecial agents of the Department of Education are fully certified federal law enforcement officers authorized to make arrests, execute searches, carry weapons, and detain suspects. Department of Education Special Agents derive this authority from the Inspector General Act of 1978.\n\nThe U.S. Department of Education overseas the funding of millions, if not billions, of dollars worth of federal student aid and grants. With so much money to keep track of, it is no surprise that a majority of the criminal investigations conducted by the Department of Education Office of the Inspector General relate directly to fraud. In order to combat this fraud and theft of government funds, Special Agents of the Department of Education independent and objective audit, investigations, and inspections which may include activities such as surveillance, undercover work, interviews, and searches.\n\nThere is a lot of money to be had for honest and hard working students who want to further their education, but there are a lot of crooks out there too. In order to make sure that the tax payers only pay for the education of students who truly deserve and require financial aid assistance, the Special Agents of the Department of Education work around the clock to keep the system's integrity in tact.", "location": "Washington D.C. Metro Area", "title": "Special Agent", "startedOn": {"month": 11, "year": 2004}}, {"posId": 125476033, "new": false, "current": false, "endedOn": {"month": 11, "year": 2004}, "companyName": "Federal Air Marshal Service", "description": "Federal Air Marshal â\u0080\u0093 SV-1801\nAs a Federal Air Marshal, you will be an armed federal law enforcement officer responsible for protecting passengers and crew from criminal and terrorist acts onboard commercial aircraft.  Federal Air Marshals promote public confidence in the safety of the nationâ\u0080\u0099s aviation system through deployment on U.S. flagged air carrier flights domestically and internationally.  Federal Air Marshals also have the opportunity to perform important investigative work and assignments to multi-agency law enforcement and investigative task forces.", "location": "Atlantic City NJ / Philadelphia, PA Field Office", "title": "Special Agent", "startedOn": {"month": 11, "year": 2001}}, {"posId": 125476123, "new": false, "current": false, "endedOn": {"month": 11, "year": 2001}, "companyName": "U.S. Border Patrol", "description": "As a Border Patrol Agent, your primary focus would be to work in tandem with your U.S. Customs\nand Border Protection partners to prevent terrorists and terrorist weapons from entering the United\nStates. Border Patrol Agents also detect and prevent the smuggling and unlawful entry of\nundocumented aliens into the United States, and apprehend those people found to be in violation\nof the immigration laws. Also, due to the increase in drug smuggling operations, the Border Patrol\nis the primary drug-interdicting agency along the land border between the ports of entry.\nOne of the most important duties performed by a Border Patrol Agent is known as â\u0080\u009cline-watchâ\u0080\u009d.\nThis involves the detection and apprehension of undocumented aliens and their smugglers by\nmaintaining surveillance from a covert position, pursuing leads, responding to electronic sensor\nalarms, utilizing infrared scopes during night operations, using low-light level television systems,\nsighting aircraft, and interpreting and following tracks, marks, and other physical evidence. In\naddition, Border Patrol Agents perform traffic checks, traffic observation, city patrol transportation\nchecks, and other administrative, intelligence, and anti-smuggling activities.\n\nSpecialties:  Horse Patrol / ATV Patrol /King Ranch Brush Crew", "location": "McAllen, Texas Sector / Harlingen, TX Station", "title": "Border Patrol Agent", "startedOn": {"month": 2, "year": 1997}}, {"posId": 125476245, "new": false, "current": false, "endedOn": {"month": 2, "year": 1997}, "companyName": "Lewis County Sheriff Department", "title": "Deputy Sheriff", "startedOn": {"month": 8, "year": 1995}}, {"posId": 125476373, "new": false, "current": false, "endedOn": {"month": 8, "year": 1995}, "companyName": "Lewis County Department Of Social Services", "title": "Child Protective Services", "startedOn": {"month": 10, "year": 1993}}], "pictureInfo": {}, "relatedColleagueCompanyId": 533534, "savedLead": false, "firstName": "Joshua", "numOfSharedConnections": 0, "memberBadges": {"premium": false, "openLink": false, "jobSeeker": false}, "flagshipProfileUrl": "https://www.linkedin.com/in/joshua-f-36ab8421", "location": "Rouses Point, New York"}